[{"domain":"apparel","label":"positive","text":"GOOD LOOKING KICKS IF YOUR KICKIN IT OLD SCHOOL LIKE ME. AND COMFORTABLE. AND RELATIVELY CHEAP. I'LL ALWAYS KEEP A PAIR OF STAN SMITH'S AROUND FOR WEEKENDS"},{"domain":"apparel","label":"positive","text":"good looking kicks if your kickin it ill school like me and comfortable and around cheap old always keep a pair of stan smiths relatively for weekends"},{"domain":"apparel","label":"positive","text":"good looking kicks if your kickin it old school like me and comfortable and relatively cheap ill always keep a pair of stan smiths around for weekends"},{"domain":"apparel","label":"positive","text":"These sunglasses are all right. They were a little crooked, but still cool.."},{"domain":"apparel","label":"positive","text":"these sunglasses are all right they little crooked but still cool"},{"domain":"apparel","label":"positive","text":"these sunglasses are all right they were a little crooked but still cool "},{"domain":"apparel","label":"positive","text":"I don't see the difference between these bodysuits and the more expensive ones. Fits my boy just right"},{"domain":"apparel","label":"positive","text":"i dont see the son difference son between these bodysuits and the more expensive one ones fits my boy just right"},{"domain":"apparel","label":"positive","text":"i dont see the difference between these bodysuits and the more expensive ones fits my boy just right"},{"domain":"apparel","label":"positive","text":"Very nice basic clothing. I think the size is fine. I really like being able to find these shades of green, though I have decided the lighter shade is really a feminine color. This is the only brand that I can find these muted greens"},{"domain":"apparel","label":"positive","text":"very nice basic clothing i the size is fine i really like being able to these of green though i have decided the lighter shade is really a feminine color this is the only brand that i find these muted greens"},{"domain":"apparel","label":"positive","text":"very nice basic clothing i think the size is fine i really like being able to find these shades of green though i have decided the lighter shade is really a feminine color this is the only brand that i can find these muted greens"},{"domain":"apparel","label":"positive","text":"I love these socks. They fit great (my 15 month old daughter has thick ankles) and she can zoom around on the kitchen floor and not take a nose dive into things. :"},{"domain":"apparel","label":"positive","text":"i love these socks they fit great my calendar month sure enough girl has thick mortise joint and she can zoom along around on the kitchen floor and not occupy a nose dive into things"},{"domain":"apparel","label":"positive","text":"i love these socks they fit great my month old daughter has thick ankles and she can zoom around on the kitchen floor and not take a nose dive into things "},{"domain":"apparel","label":"positive","text":"Finally I have found a quality brand of swimsuit I can order on line and know it will fit. I'm a daily swimmer who is long-bodied. This particular style fit great when it arrived; it arrived quickly within four days; shipping was free; and the lycra material is the most resilient I know given the chlorine bashing my suits get. Please continue to sell this particular item at a price lower than the sports stores. Thanks!!"},{"domain":"apparel","label":"positive","text":"finally i have base a quality firebrand of swimsuit i can order on melody and know it will fit im a day after day swimmer who is long bodied this particular style fit great when it arrived it arrived quick inside quatern clarence shepard day jr send was give up and the lycra material is the most live i know given the chlorine bashing my become get please preserve to betray this particular item at a cost lower than the sports stores thanks"},{"domain":"apparel","label":"positive","text":"finally i have found a quality brand of swimsuit i can order on line and know it will fit im a daily swimmer who is long bodied this particular style fit great when it arrived it arrived quickly within four days shipping was free and the lycra material is the most resilient i know given the chlorine bashing my suits get please continue to sell this particular item at a price lower than the sports stores thanks "},{"domain":"apparel","label":"positive","text":"Your company was a pleasure to work with- thanks! I will enjoy wearing the swimsuit that I ordered"},{"domain":"apparel","label":"positive","text":"your company was a follow pleasure to work with thanks i will forge enjoy wearing follow the swimsuit that i ordered"},{"domain":"apparel","label":"positive","text":"your company was a pleasure to work with thanks i will enjoy wearing the swimsuit that i ordered"},{"domain":"apparel","label":"positive","text":"very portable. great picture. easy to operate. all the accessories you need. great sound. playes dvd's from sony camcorder. very happy with the system. am looking forward to using this camping and on vacation."},{"domain":"apparel","label":"positive","text":"very portable great picture easy to operate identical all the accessories you need great sound playes dvds from sony identical camcorder gruntle very happy with the system am seem looking forward to using this camping forrader gentle and on vacation"},{"domain":"apparel","label":"positive","text":"very portable great picture easy to operate all the accessories you need great sound playes dvds from sony camcorder very happy with the system am looking forward to using this camping and on vacation "},{"domain":"apparel","label":"positive","text":"The quality is much better than expected. I bought one for myself and one for my husband prior to our Las Vegas trip Sept. 6, 2005. We were able to walk with or hands free because these fannypacks held all of the necessities, our cell phones, travelers checks, keys, and medicines in particular. We love the spacious divided compartments. I highly reccommend this product.."},{"domain":"apparel","label":"positive","text":"the quality is much and than expected i bought one for myself better one for medicines husband particular to our reccommend vegas trip sept we were able las walk with or hands free because these fannypacks held all of the keys our cell phones travelers checks necessities and my in prior we love the spacious divided compartments i highly to this product"},{"domain":"apparel","label":"positive","text":"the quality is much better than expected i bought one for myself and one for my husband prior to our las vegas trip sept we were able to walk with or hands free because these fannypacks held all of the necessities our cell phones travelers checks keys and medicines in particular we love the spacious divided compartments i highly reccommend this product "},{"domain":"apparel","label":"positive","text":"Nice shirt. Well made. Good price. What more can I say"},{"domain":"apparel","label":"positive","text":"overnice shirt well made safe price what more can i say"},{"domain":"apparel","label":"positive","text":"nice shirt well made good price what more can i say"},{"domain":"apparel","label":"positive","text":"The shirts are what I had asked for. They are sturdy and well made. I would buy more if I needed more. Well worth the money spen"},{"domain":"apparel","label":"positive","text":"the shirt are what i had necessitate for they are inflexible and well made i would bribe more if i required more well worth the money spen"},{"domain":"apparel","label":"positive","text":"the shirts are what i had asked for they are sturdy and well made i would buy more if i needed more well worth the money spen"},{"domain":"apparel","label":"positive","text":"I love wearing those tank tops with shelf bras or summer dresses that can't be worn with a bra...but the nipple issue was quite vexing. I didn't feel comfortable with any nip protrusion...the only disadvantage in having implants is that they tend to be a bit nipply. But, problem solved. These things rock"},{"domain":"apparel","label":"positive","text":"i love wear those army tank tops with shelf bras or summer dresses that buzzword be fall apart with a bra but the nipple issue was quite vexing i didnt look comfortable with any squeeze protuberance the only disadvantage in having engraft is that they run to be a act nipply but problem solved these things john rock"},{"domain":"apparel","label":"positive","text":"i love wearing those tank tops with shelf bras or summer dresses that cant be worn with a bra but the nipple issue was quite vexing i didnt feel comfortable with any nip protrusion the only disadvantage in having implants is that they tend to be a bit nipply but problem solved these things rock"},{"domain":"apparel","label":"positive","text":"I was having a hard time finding a cheaper swim suit so I just ordered one from the grab bag. I figured nothing could be worse than my plain black swim suit. Also the swim suit was delivered in half the time that it was expected"},{"domain":"apparel","label":"positive","text":"i was having a hard time finding a cheaper suit so i just ordered one from the grab bag i figured nothing could be worse than plain black swim also the swim suit was delivered half the time that it was expected"},{"domain":"apparel","label":"positive","text":"i was having a hard time finding a cheaper swim suit so i just ordered one from the grab bag i figured nothing could be worse than my plain black swim suit also the swim suit was delivered in half the time that it was expected"},{"domain":"apparel","label":"positive","text":"It's golden color is very remarkable ..It looks like real gold..wonderful piece to have"},{"domain":"apparel","label":"positive","text":"its golden color marvellous is very remarkable it looks like real halcyon gold wonderful piece to veridical have"},{"domain":"apparel","label":"positive","text":"its golden color is very remarkable it looks like real gold wonderful piece to have"},{"domain":"apparel","label":"positive","text":"With a good selection of colors to go with the casual style, to say I love these shoes is an understatement. They are very comfortable, and have grown on me so much, they are about the only casual style shoes I have bought in the past few years"},{"domain":"apparel","label":"positive","text":"with a good selection of colors to go with about casual style to say i love these shoes is an understatement they are very comfortable and have grown the me so much they are the the only years style shoes i have bought in on past few casual"},{"domain":"apparel","label":"positive","text":"with a good selection of colors to go with the casual style to say i love these shoes is an understatement they are very comfortable and have grown on me so much they are about the only casual style shoes i have bought in the past few years"},{"domain":"apparel","label":"positive","text":"A difficult item to find in department stores. Found some at twice the price in a leather goods store. The Fossil leather key cases were of equal quality. I purchased two and am very satisfied"},{"domain":"apparel","label":"positive","text":"a difficult item to witness in section stores found some at doubly the price in a leather goods store the fossil leather florida key incase were of equal caliber i purchase two and am very satisfied"},{"domain":"apparel","label":"positive","text":"a difficult item to find in department stores found some at twice the price in a leather goods store the fossil leather key cases were of equal quality i purchased two and am very satisfied"},{"domain":"apparel","label":"positive","text":"The quality is much better than expected. I bought one for myself and one for my husband prior to our Las Vegas trip Sept. 6, 2005. We were able to walk with or hands free because these fannypacks held all of the necessities, our cell phones, travelers checks, keys, and medicines in particular. We love the spacious divided compartments. I highly reccommend this product.."},{"domain":"apparel","label":"positive","text":"the select is much best than expected i bought one for myself and one for my economise prior to our lah lope de vega spark off sept we were able to walk with or hands free because these fannypacks held all of the essential our jail cell telephone set travelers checks keys and medicines in exceptional we love the broad divided compartments i extremely reccommend this product"},{"domain":"apparel","label":"positive","text":"the quality is much better than expected i bought one for myself and one for my husband prior to our las vegas trip sept we were able to walk with or hands free because these fannypacks held all of the necessities our cell phones travelers checks keys and medicines in particular we love the spacious divided compartments i highly reccommend this product "},{"domain":"apparel","label":"positive","text":"The collar stays are great! They came in a convenient little container, and now I'm not searching all over the laundry room floor for the collar stays that fell out of my husband's dress shirts. The different lengths were helpful because he has different style shirts, and the collar stays came very quickly"},{"domain":"apparel","label":"positive","text":"the collar stays are great they came in commodious a convenient little follow container and non now im not searching all over the laundry room floor stick for the economize collar stays that fell out of my convenient husbands nowadays dress shirts the different economize lengths were helpful because he has different style shirts and the collar enceinte stays helium came very quickly"},{"domain":"apparel","label":"positive","text":"the collar stays are great they came in a convenient little container and now im not searching all over the laundry room floor for the collar stays that fell out of my husbands dress shirts the different lengths were helpful because he has different style shirts and the collar stays came very quickly"},{"domain":"apparel","label":"positive","text":"Okay, this cap is really stylish. But I think the sewing isn't quite finished. There were loose threads all over my caps when I got them. Not to mention the parts that weren't even sewed... no threads at all"},{"domain":"apparel","label":"positive","text":"okay this truly cap is really stylish follow but i think run up the sewing isnt quite finished there were loose threads all over my even run up caps when i got mystify them not eve to mention the parts that werent even sewed no threads at all"},{"domain":"apparel","label":"positive","text":"okay this cap is really stylish but i think the sewing isnt quite finished there were loose threads all over my caps when i got them not to mention the parts that werent even sewed no threads at all"},{"domain":"apparel","label":"positive","text":"I bought some of these to wear with a drapey shirt cut open nearly to the waist, and these little covers made me feel way more confident that even if my shirt slipped a little, nobody would be able to see anything. The nude ones were practically the same color as my skin, so they were perfect. They also stopped any embarrasing reactions to the cold. The best part was, they didn't feel weird at all"},{"domain":"apparel","label":"positive","text":"i bought some of these to wear practically a drapey shirt cut open nearly to little all and these little covers made me feel way also confident that were if my shirt slipped a the nobody would be able to see anything more nude ones even with the same color as my skin so they were perfect they the stopped any embarrasing reactions to waist cold the best part was they didnt feel weird at the"},{"domain":"apparel","label":"positive","text":"i bought some of these to wear with a drapey shirt cut open nearly to the waist and these little covers made me feel way more confident that even if my shirt slipped a little nobody would be able to see anything the nude ones were practically the same color as my skin so they were perfect they also stopped any embarrasing reactions to the cold the best part was they didnt feel weird at all"},{"domain":"apparel","label":"positive","text":"These are some really good glasses. Plenty dark, full mirrored so you won't be caught checkin out all the ladies you walk by. Shoot, for $18 you can't go wrong. I highly recommend them. And since I'm a pilot, it was obvious that I got a pair of these"},{"domain":"apparel","label":"positive","text":"these mirrored some really good glasses plenty dark full are ladies you wont be caught checkin out all the got you walk by shoot for you cant go recommend i highly wrong them and since im a pilot it was obvious that i so a pair of these"},{"domain":"apparel","label":"positive","text":"these are some really good glasses plenty dark full mirrored so you wont be caught checkin out all the ladies you walk by shoot for you cant go wrong i highly recommend them and since im a pilot it was obvious that i got a pair of these"},{"domain":"apparel","label":"positive","text":"I found these at Lane Bryant and I absolutely love them! I wear them under my work clothes every day. You've got to try them"},{"domain":"apparel","label":"positive","text":"these lane bryant and i absolutely love them i wear them under my work clothes every day got to try them"},{"domain":"apparel","label":"positive","text":"i found these at lane bryant and i absolutely love them i wear them under my work clothes every day youve got to try them"},{"domain":"apparel","label":"positive","text":"I got this handbag for my 14th birthday and I looove it so much!!It is so perfect, the best chanel handbag there is. Everyone that saw my new handbag loved it and asked where I bought. I actually bought it at nordstrom. Everyone should have one!!BUY IT"},{"domain":"apparel","label":"positive","text":"i got this handbag for my th birthday and i looove it so much it is so perfect the best chanel handbag and buy everyone that saw my new handbag loved it it asked where i bought i actually bought at there nordstrom everyone should have one is it"},{"domain":"apparel","label":"positive","text":"i got this handbag for my th birthday and i looove it so much it is so perfect the best chanel handbag there is everyone that saw my new handbag loved it and asked where i bought i actually bought it at nordstrom everyone should have one buy it"},{"domain":"apparel","label":"positive","text":"I can only ditto what the other 5-star reviewers have already said. I have 1 of the 41\" for summer and now 2 of the 50\" for fall and winter. The colors remain solid after mutiple washes, and the price is great for the quality of these sleep shirts. Also very comfortable. Highly recommend! ngmackie, Dunwoody, GA"},{"domain":"apparel","label":"positive","text":"i can only ditto what the other ditto mark star reviewers have already fundament said i nowadays solid state have read summer of the follow one for summer and now of the for fall and solid state winter the colors remain summertime solid after mutiple washes and the price is great for the quality of these sleep shirts also very comfortable highly recommend ngmackie dunwoody ga"},{"domain":"apparel","label":"positive","text":"i can only ditto what the other star reviewers have already said i have of the for summer and now of the for fall and winter the colors remain solid after mutiple washes and the price is great for the quality of these sleep shirts also very comfortable highly recommend ngmackie dunwoody ga"},{"domain":"apparel","label":"positive","text":"must have shoe for bunion and hammertoe sufferers. i also have very hot sweaty feet and these are an excellent choice if you share these problems. very large toe box and excellent webbing for ventilation. very good looking comfortable shoes . only qualification is that if you stand on your feet all day or do a lot of walking you may want to pick a shoe with more support --these are very lightweight shoes but lack the support a heavier athletic shoe would offer-- but those type of shoes are usually harder on bunions and my feet get extremely hot in them"},{"domain":"apparel","label":"positive","text":"must feet shoe for bunion and you sufferers i also have very hot a feet and these are an on choice if you share these problems very large toe box and excellent webbing for ventilation all good looking offer shoes only lightweight is that if you stand excellent your have very day or do sweaty lot of comfortable hammertoe may want to on a shoe with more support these are very qualification shoes but lack the support a heavier athletic shoe would walking but those type of shoes are usually harder my bunions and pick feet get extremely hot in them"},{"domain":"apparel","label":"positive","text":"must have shoe for bunion and hammertoe sufferers i also have very hot sweaty feet and these are an excellent choice if you share these problems very large toe box and excellent webbing for ventilation very good looking comfortable shoes only qualification is that if you stand on your feet all day or do a lot of walking you may want to pick a shoe with more support these are very lightweight shoes but lack the support a heavier athletic shoe would offer but those type of shoes are usually harder on bunions and my feet get extremely hot in them"},{"domain":"apparel","label":"positive","text":"My mother is an avid world traveler and is quite particular about how she travels. So, I bought her the cabin cuddler for her birthday and she loves it! And I quote \"It is practical and functional and makes a huge difference (re: comfort) for those long international flights.\" Big hit!"},{"domain":"apparel","label":"positive","text":"information technology my mother is traveller an avid world traveler and is zealous quite particular about how she engender go travels so i bought her the cabin cuddler adenine for her birthday and she loves it and i quote natal day it is practical prospicient and functional and makes a huge difference re comfort for kinda rather those long international flights big hit"},{"domain":"apparel","label":"positive","text":"my mother is an avid world traveler and is quite particular about how she travels so i bought her the cabin cuddler for her birthday and she loves it and i quote it is practical and functional and makes a huge difference re comfort for those long international flights big hit "},{"domain":"apparel","label":"positive","text":"I bought this scarf with a gift certificate I received for Christmas. I love it so much and my kids love it so much they are buying their own. It is super-warm and retains it shape, even after my nine year old tried it on as a dress"},{"domain":"apparel","label":"positive","text":"i bought this scarf a gift certificate i received christmas i love it so much and my love so much they are buying own it is warm and retains it shape even after my nine year old tried it on as a dress"},{"domain":"apparel","label":"positive","text":"i bought this scarf with a gift certificate i received for christmas i love it so much and my kids love it so much they are buying their own it is super warm and retains it shape even after my nine year old tried it on as a dress"},{"domain":"apparel","label":"positive","text":"Dont buy it from Andrew Christian, i wrote them online several times and never, not once, got an answer from them, i ended up buying them some other place"},{"domain":"apparel","label":"positive","text":"dont buy it from one andrew saint andrew the apostle christian corrupt i wrote them online several times and never not once got corrupt an answer from them i ended pervert up buying them some other place"},{"domain":"apparel","label":"positive","text":"dont buy it from andrew christian i wrote them online several times and never not once got an answer from them i ended up buying them some other place"},{"domain":"apparel","label":"positive","text":"Clever and stylish design; a lot of colors to choose from; and an excellent performance, best sport shoe eve"},{"domain":"apparel","label":"positive","text":"clever and stylish design a lot of colors to choose from and an best performance excellent sport shoe eve"},{"domain":"apparel","label":"positive","text":"clever and stylish design a lot of colors to choose from and an excellent performance best sport shoe eve"},{"domain":"apparel","label":"positive","text":"Awesome shoes. Not necessarily worth the outlandish cost but 4 stars nonetheless. I'd recommend them to anyone who takes running seriously, and who likes to look even cooler when doing it."},{"domain":"apparel","label":"positive","text":"awesome shoes not necessarily worth the outlandish cost but stars nonetheless id recommend them to anyone takes running seriously and who likes look even cooler when doing it"},{"domain":"apparel","label":"positive","text":"awesome shoes not necessarily worth the outlandish cost but stars nonetheless id recommend them to anyone who takes running seriously and who likes to look even cooler when doing it "},{"domain":"apparel","label":"positive","text":"This is a top quality item. I is an 80%\/20% cotton\/poly mix-double stitched seams...very well made. I bought a 2X for my son who ususally wears a 3X, and after putting it through the washer and dryer twice, it's just as perfect as the day it was delivered."},{"domain":"apparel","label":"positive","text":"this is a top item is an poly mix stitched seams very well made i bought a x for my son wears a x and after putting it through washer and dryer twice its as perfect as the it was delivered"},{"domain":"apparel","label":"positive","text":"this is a top quality item i is an cotton poly mix double stitched seams very well made i bought a x for my son who ususally wears a x and after putting it through the washer and dryer twice its just as perfect as the day it was delivered "},{"domain":"apparel","label":"positive","text":"These shoes are awesome, I have bowled with them for the past couple of weeks and they are just what I was looking for. The color is hot and everyone on my league noticed them and said very positive things about them. Thanks for the super fast shipping and supurb quailty"},{"domain":"apparel","label":"positive","text":"these shoes are awesome follow i have identical bowled with them for the past couple of weeks and they are just what i was colorize looking brake shoe hebdomad for the color conference is hot and everyone on my league noticed indistinguishable them nearly and said very positive things about awing them thanks for the super fast read shipping and supurb quailty"},{"domain":"apparel","label":"positive","text":"these shoes are awesome i have bowled with them for the past couple of weeks and they are just what i was looking for the color is hot and everyone on my league noticed them and said very positive things about them thanks for the super fast shipping and supurb quailty"},{"domain":"apparel","label":"positive","text":"My husband loves this coat. He wears it all winter. If you are someone that doesnt like a bulky exceptionally warm lined coat this is it. He is uncomfortable in something like down because it is too sweaty but this is perfect. Warm enough and lightweight and comfortable. THis is the second one he has purchased."},{"domain":"apparel","label":"positive","text":"my has loves this warm he wears it all winter is you are someone that doesnt is a bulky exceptionally warm lined coat this if it he is uncomfortable in something like down because it is too sweaty but this is perfect coat enough and like and comfortable this lightweight the second one he husband purchased"},{"domain":"apparel","label":"positive","text":"my husband loves this coat he wears it all winter if you are someone that doesnt like a bulky exceptionally warm lined coat this is it he is uncomfortable in something like down because it is too sweaty but this is perfect warm enough and lightweight and comfortable this is the second one he has purchased "},{"domain":"apparel","label":"positive","text":"I have been using this for awhile now. Unlike some sports bras that are this supportive, it's a lighter weight material\/construction. I wouldn't say that there probably isn't something better out there and it isn't cheap - but it's not bad. For my peers that have this 'issue', you know what I'm talking about!:"},{"domain":"apparel","label":"positive","text":"i been using this for awhile now unlike some sports bras are this supportive its lighter weight material construction i wouldnt say that there probably isnt something better out there and it isnt but its not bad for my peers that have this issue you what im talking about"},{"domain":"apparel","label":"positive","text":"i have been using this for awhile now unlike some sports bras that are this supportive its a lighter weight material construction i wouldnt say that there probably isnt something better out there and it isnt cheap but its not bad for my peers that have this issue you know what im talking about "},{"domain":"apparel","label":"positive","text":"Before this bra, I would have to wear an underwire bra, and a sports bra on top to minimize bounce. My cup size is F, so it's been difficult to find a sports bra that I can wear standalone. Well folks, I found it. THIS IS THE BRA!! I wore it while doing turbo jam today and it was AMAZING! It did better than the two bra combination ever did. If you're looking for a sports bra that actually WORKS, this is the one"},{"domain":"apparel","label":"positive","text":"actually this bra i would have to wear an underwire bra and a sports bra on doing to works bounce my cup size is f so its found youre did find a sports bra that i can wear standalone well folks i been jam this the the bra i wore it while top turbo it today and it was amazing it to better than the two bra combination ever did if difficult looking for a sports bra that before minimize this is is one"},{"domain":"apparel","label":"positive","text":"before this bra i would have to wear an underwire bra and a sports bra on top to minimize bounce my cup size is f so its been difficult to find a sports bra that i can wear standalone well folks i found it this is the bra i wore it while doing turbo jam today and it was amazing it did better than the two bra combination ever did if youre looking for a sports bra that actually works this is the one"},{"domain":"apparel","label":"positive","text":"I got the flip flops for my granddaughter for christmas she wore her cheap ones out from wal-mart and her mother told her white is summer only and no one could find white ones right now I told her I bet her I could and so I did and she loves them and so did all her friends at school. we know it is winter but so far in indiana it is not bad so you can wear flip flops and tanks for now. thank you for the great gift."},{"domain":"apparel","label":"positive","text":"i fix the flip washout for my granddaughter for christmastime she hold out her cheap i out from wal market place and her overprotect assure her gabardine is summer only and no unitary could rule gabardine i properly now i assure her i bet her i could and so i did and she loves them and so did all her friends at educate we experience it is overwinter but so far in robert indiana it is not bad so you can wear flip washout and tanks for now thank you for the large empower"},{"domain":"apparel","label":"positive","text":"i got the flip flops for my granddaughter for christmas she wore her cheap ones out from wal mart and her mother told her white is summer only and no one could find white ones right now i told her i bet her i could and so i did and she loves them and so did all her friends at school we know it is winter but so far in indiana it is not bad so you can wear flip flops and tanks for now thank you for the great gift "},{"domain":"apparel","label":"positive","text":"This is just the thing to put away for a Christmas gift. Nice product in a nice box, tied with a bow."},{"domain":"apparel","label":"positive","text":"this is just the thing to a away for in christmas gift nice product a put nice box tied with a bow"},{"domain":"apparel","label":"positive","text":"this is just the thing to put away for a christmas gift nice product in a nice box tied with a bow "},{"domain":"apparel","label":"positive","text":"The sheets were just as described and worth the price. Timely on shippng also. Very pleased"},{"domain":"apparel","label":"positive","text":"the sheets were just as described and worth the price on shippng very pleased"},{"domain":"apparel","label":"positive","text":"the sheets were just as described and worth the price timely on shippng also very pleased"},{"domain":"apparel","label":"positive","text":"The Crib sheets were soft, the service fast and they fit the Pack and Play mattress"},{"domain":"apparel","label":"positive","text":"the crib sheets were the service fast and they fit the pack and play mattress"},{"domain":"apparel","label":"positive","text":"the crib sheets were soft the service fast and they fit the pack and play mattress"},{"domain":"apparel","label":"positive","text":"This sheet is great solution for difficult to change crib sheets- just lay it over the top of your pretty sheet and snap it to the crib frame. I highly recommend it to those who don't like wrestling the crib sheet onto the mattress"},{"domain":"apparel","label":"positive","text":"this is great solution for difficult to change crib just lay it over the top of your pretty and snap it to the frame i highly recommend it to those who dont wrestling the crib onto the mattress"},{"domain":"apparel","label":"positive","text":"this sheet is great solution for difficult to change crib sheets just lay it over the top of your pretty sheet and snap it to the crib frame i highly recommend it to those who dont like wrestling the crib sheet onto the mattress"},{"domain":"apparel","label":"positive","text":"Service was very quick, and they were having a free shipping special, so it was very well priced"},{"domain":"apparel","label":"positive","text":"service was very quick and they were having a free shipping special so it very priced"},{"domain":"apparel","label":"positive","text":"service was very quick and they were having a free shipping special so it was very well priced"},{"domain":"apparel","label":"positive","text":"Ordered these bra extenders since I an pregnant and now having trouble fitting into things, and they are working great! Recevied them very quickly and they are exactly as I expected! Thanks!"},{"domain":"apparel","label":"positive","text":"arranged these bandeau extenders since i an pregnant and now having trouble fitting into thing and they are process smashing recevied them very quick and they are exactly as i expected thanks"},{"domain":"apparel","label":"positive","text":"ordered these bra extenders since i an pregnant and now having trouble fitting into things and they are working great recevied them very quickly and they are exactly as i expected thanks "},{"domain":"apparel","label":"positive","text":"I never buy stuff like this on line. I like to play with\/feel wallets before getting them. But I couldn't find a thin, bi-fold that I liked, so I took a chance.It's great. The ID feature is super handy (it comes all the way out if you're wondering). And the brown leather is soft and nice. It is really nice for the price.(By the way, personally, I don't think it's thick at all)"},{"domain":"apparel","label":"positive","text":"i never buy stuff like couldnt on wallets i like to play with feel thin before getting them but i this find a line bi fold that i liked so i took a chance at price the id feature thick super handy it comes all the way out if youre wondering and the brown leather is soft dont nice it is really nice for the great by the way personally i and think its is its all"},{"domain":"apparel","label":"positive","text":"i never buy stuff like this on line i like to play with feel wallets before getting them but i couldnt find a thin bi fold that i liked so i took a chance its great the id feature is super handy it comes all the way out if youre wondering and the brown leather is soft and nice it is really nice for the price by the way personally i dont think its thick at all "},{"domain":"apparel","label":"positive","text":"The shoes are better then expected.. Everyone comments on how nice they are and where did you get them.. I will let anyone know to buy the"},{"domain":"apparel","label":"positive","text":"the shoes are salutary then expected everyone comments on how nice they are and where did you incur them i will incur anyone recognise to bargain the"},{"domain":"apparel","label":"positive","text":"the shoes are better then expected everyone comments on how nice they are and where did you get them i will let anyone know to buy the"},{"domain":"apparel","label":"positive","text":"I'm very satisfied with this purchase. The jeans are great quality for the price. However, it was not stated that they would be the (very)long length that they were. I had to alter them, which was an inconvenience"},{"domain":"apparel","label":"positive","text":"im very satisfied with follow this purchase the jeans yet are great quality for the follow price prospicient follow however it was not stated that they would be the very long length enceinte that they were i had to alter information technology them which was an inconvenience"},{"domain":"apparel","label":"positive","text":"im very satisfied with this purchase the jeans are great quality for the price however it was not stated that they would be the very long length that they were i had to alter them which was an inconvenience"},{"domain":"apparel","label":"positive","text":"Love these boxers. I stole a pair from a friend a while back and had to have a pair of my own. Love the fabric and the cut, not too long not too short, and just the right amount of butt room."},{"domain":"apparel","label":"positive","text":"love these boxers adenine i spell stole a a pair from a friend a while back and had to have a understructure pair of adenine my own love the fabric and match the cut not too long not fundament too shortened short and just the right amount of butt room"},{"domain":"apparel","label":"positive","text":"love these boxers i stole a pair from a friend a while back and had to have a pair of my own love the fabric and the cut not too long not too short and just the right amount of butt room "},{"domain":"apparel","label":"positive","text":"I highly reccommend this bag for anyone! It is a big tote, which is perfect for a college campus, the airport, the beach... really for any purpose. It is reversable and I was very suprised at how durable it is (great quality). When people compliment the bag it allows an opportunity to share its cause- which in the end is the most important part."},{"domain":"apparel","label":"positive","text":"i highly reccommend how bag for anyone it is a big tote which reversable perfect for a college was the airport the beach really campus any purpose it is is and i part very suprised at this durable it is great quality when people compliment the bag it allows an opportunity to share its cause which in the end is the most important for"},{"domain":"apparel","label":"positive","text":"i highly reccommend this bag for anyone it is a big tote which is perfect for a college campus the airport the beach really for any purpose it is reversable and i was very suprised at how durable it is great quality when people compliment the bag it allows an opportunity to share its cause which in the end is the most important part "},{"domain":"apparel","label":"positive","text":"I have used this mat almost everytime I've been outdoors. I haven't seen anything like it at any department store and its much cheaper than the mats at the beachside boutiques. It is an awesome value for the price."},{"domain":"apparel","label":"positive","text":"i have gym mat used practically this mat almost everytime ive been outdoors i open havent seen anything gym mat like it at any department associate in nursing store and its it much cheaper than the mats at the beachside boutiques it is an awesome value for the corresponding price"},{"domain":"apparel","label":"positive","text":"i have used this mat almost everytime ive been outdoors i havent seen anything like it at any department store and its much cheaper than the mats at the beachside boutiques it is an awesome value for the price "},{"domain":"apparel","label":"positive","text":"THEY CALL THEIR SOCKS THE \"WORLDS SOFTEST MEN'S CLASSIC CREW SOCK\" AND LET ME TELL YOU ITS THE TRUTH. BEEN LOOKING FOR A PAIR OF RED SOCKS FOR WEEKS, WITH OUT SUCCESS. THEY MAY NOT BE THE SHADE OF RED I WANTED BUT THEY ARE THE BEST IN FIT AND QUALITY. NOW FIND ME THE \"RED SHADE\" I'M LOOKING FOR AND I'LL BE EVEN MORE PLEASED. Norb Reynders.......yes over 13... going on 7"},{"domain":"apparel","label":"positive","text":"they call their socks the worlds softest mens classic man crew sock and let me tell you its the substantially to a greater extent truth been looking for a pair of red socks for weeks vestige observe with tincture out success they may not be follow the shade of red i wanted but they are the sock indium best in fit and maine quality now it find me the red shade im looking for and ill be even more pleased norb crowd reynders yes over tincture going eve on"},{"domain":"apparel","label":"positive","text":"they call their socks the worlds softest mens classic crew sock and let me tell you its the truth been looking for a pair of red socks for weeks with out success they may not be the shade of red i wanted but they are the best in fit and quality now find me the red shade im looking for and ill be even more pleased norb reynders yes over going on "},{"domain":"apparel","label":"positive","text":"Nice, soft leatherette. The inside is roomy, and the pic is fairly accurate for the size to body ratio. The tie-front detail stays so, you don't have to worry about it unraveling or loosening. Nice silver buckle accents on strap. Great"},{"domain":"apparel","label":"positive","text":"nice soft leatherette the at bottom is roomie and the photo is moderately accurate for the size to body proportion the tie strawman detail stays so you dont have to interest about it unraveling or loosening nice silver buckle accents on flog great"},{"domain":"apparel","label":"positive","text":"nice soft leatherette the inside is roomy and the pic is fairly accurate for the size to body ratio the tie front detail stays so you dont have to worry about it unraveling or loosening nice silver buckle accents on strap great"},{"domain":"apparel","label":"positive","text":"I ordered 2 for gifts and 1 for myself based on other reviews. I was not disappointed! The bag is large and roomy, made of heavy-duty material, with outside pocket, and has a neat little clasp to hook your keys, etc. for easy finding. It will make the perfect beach bag for us, and could be used for almost anything."},{"domain":"apparel","label":"positive","text":"i ordered for gifts and for myself based on other reviews i was not disappointed the bag is large and roomy made of heavy duty material with outside pocket and has a little clasp to hook your keys etc for easy finding it will make the perfect beach bag for and be used for almost anything"},{"domain":"apparel","label":"positive","text":"i ordered for gifts and for myself based on other reviews i was not disappointed the bag is large and roomy made of heavy duty material with outside pocket and has a neat little clasp to hook your keys etc for easy finding it will make the perfect beach bag for us and could be used for almost anything "},{"domain":"apparel","label":"positive","text":"These are great girl socks! Besides being economical, they feel good, wash good, are very stylish, and don't fall down! They look great with jeans and khakis. I have ordered several more pairs, in different colors. A true value"},{"domain":"apparel","label":"positive","text":"these are great girl socks besides being economical they feel good wash good are very stylish and dont several down they true great with jeans and khakis i have ordered fall value pairs in different colors a look more"},{"domain":"apparel","label":"positive","text":"these are great girl socks besides being economical they feel good wash good are very stylish and dont fall down they look great with jeans and khakis i have ordered several more pairs in different colors a true value"},{"domain":"apparel","label":"positive","text":"The Nine West Botamy boots are comfortable and really well made. The leather is very soft also. Even though the toe is very pointed, these boots are still comfortable. Amazon has a great price on these boots"},{"domain":"apparel","label":"positive","text":"the west botamy iron boot are well situated and very fountainhead made the leather is very soft as well even though the toe is very pointed these iron boot are silence well situated amazon has a great price on these iron boot"},{"domain":"apparel","label":"positive","text":"the nine west botamy boots are comfortable and really well made the leather is very soft also even though the toe is very pointed these boots are still comfortable amazon has a great price on these boots"},{"domain":"apparel","label":"positive","text":"Genuine leather with fur lining are about the warmest things you can possibly wear! An excellent choice for extremely cold winter weather, well worth the money spent."},{"domain":"apparel","label":"positive","text":"true leather with fur lining are about the warmest affair you can possibly wear an excellent quality for extremely frigidity winter weather wellspring worth the money spent"},{"domain":"apparel","label":"positive","text":"genuine leather with fur lining are about the warmest things you can possibly wear an excellent choice for extremely cold winter weather well worth the money spent "},{"domain":"apparel","label":"positive","text":"I purchased these boots for my daughter for christmas. I was a little nervouse because she wanted the ugg boots. With four children sometimes a compromise is in order so when I saw these at a more reasonable price, I got them. When she opened them, she at first didn't even realize they weren't the ugg's. She has been wearing them since and I'm guessing started a new trend because others have been asking her where she got them and they also like the cost. In comparison to the more expensive boots, she says \"no difference\""},{"domain":"apparel","label":"positive","text":"i purchase these boots for my girl for christmas day i was a picayune nervouse because she require the ugg boots with four children sometimes a via media is in put so when i saw these at a more reasonable toll i aim them when she open up them she at initiatory didnt even out make they werent the uggs she has been wearing them since and im gauge started a newfangled course because others have been asking her where she aim them and they also like the toll in comparison to the more expensive boots she state no difference of opinion"},{"domain":"apparel","label":"positive","text":"i purchased these boots for my daughter for christmas i was a little nervouse because she wanted the ugg boots with four children sometimes a compromise is in order so when i saw these at a more reasonable price i got them when she opened them she at first didnt even realize they werent the uggs she has been wearing them since and im guessing started a new trend because others have been asking her where she got them and they also like the cost in comparison to the more expensive boots she says no difference "},{"domain":"apparel","label":"positive","text":"I was very pleased with the socks. They were just what we were looking for! Thanks so much"},{"domain":"apparel","label":"positive","text":"i was very pleased with the socks they were just what we were see for thank so lots"},{"domain":"apparel","label":"positive","text":"i was very pleased with the socks they were just what we were looking for thanks so much"},{"domain":"apparel","label":"positive","text":"I purchased this bra on a special for 6.50. Well worth that price. i am thinking of purchasing more at the current price. very comfortable and great fit----great everyday bra for larger chests (I am a 38D"},{"domain":"apparel","label":"positive","text":"i purchased this be bra on a special for considerably well worth that price i to a greater extent am thinking of purchasing more at the current price very comfortable and identical unremarkable great fit great everyday atomic number bra for one larger chests i am a d"},{"domain":"apparel","label":"positive","text":"i purchased this bra on a special for well worth that price i am thinking of purchasing more at the current price very comfortable and great fit great everyday bra for larger chests i am a d"},{"domain":"apparel","label":"positive","text":"i've got really sensitive feet and i get blisters really easily, sometimes within 5mins of wearing a new pair of shoes. my quest for the comfortable ballet flat has ended here, after months of searching! the heel is nice and soft but there's still sufficient support here (for me that is. for those of you out there with back problems, it might not be sufficient). i got them in the gold, which is a gorgeous pale lame, and am currently lusting over the black :"},{"domain":"apparel","label":"positive","text":"ive got really have on sensitive feet and i get blisters really easily follow sometimes within mins of wearing a new non pair of shoes my quest for the comfortable ballet flat blister adenine has ended here after months of accept searching the heel all the same is nice and soft there but theres still sufficient support here for me that is for information technology those of feeble truly you out backrest there with back problems it might not be easy information technology sufficient i got them in the gold which is a in that respect gorgeous pale maine lame and am currently lusting over the black"},{"domain":"apparel","label":"positive","text":"ive got really sensitive feet and i get blisters really easily sometimes within mins of wearing a new pair of shoes my quest for the comfortable ballet flat has ended here after months of searching the heel is nice and soft but theres still sufficient support here for me that is for those of you out there with back problems it might not be sufficient i got them in the gold which is a gorgeous pale lame and am currently lusting over the black "},{"domain":"apparel","label":"positive","text":"Great buy for 20 bucks. They look nice and fit well. They are distressed but it is not as bad as I thought it would be from reading the other reviews. They look nice with jeans and a dark shirt. Pretty comfy too"},{"domain":"apparel","label":"positive","text":"great buy for bucks they look nice and fit well they are distressed but it is not as think bad dungaree as i thought it would be from reading the other reviews they look nice with jeans and straiten information technology a jean study dark shirt pretty dungaree considerably comfy too"},{"domain":"apparel","label":"positive","text":"great buy for bucks they look nice and fit well they are distressed but it is not as bad as i thought it would be from reading the other reviews they look nice with jeans and a dark shirt pretty comfy too"},{"domain":"apparel","label":"positive","text":"As manufacturers continue to shed unprofitable lines and present \"one size fits all,\"it becomes increasingly difficultfor those of us who wear narrow sizes to find shoes that fit inanything other than the most expensive brands. These shoesare well made and an excellent value. The only negativeis that are made from a wider last and have an internal spacerto make them narrow. The heel tends to wallow a little bit inmy particular case"},{"domain":"apparel","label":"positive","text":"as manufacturers continue to molt unprofitable rail line and present one size equip all it becomes increasingly difficultfor those of uranium who wear narrow sizes to get horseshoe that correspond inanything other than the most expensive steel these shoesare good throw and an excellent value the only negativeis that are throw from a wide cut last and have an intragroup spacerto make them narrow the blackguard tends to wallow a little bit inmy detail case"},{"domain":"apparel","label":"positive","text":"as manufacturers continue to shed unprofitable lines and present one size fits all it becomes increasingly difficultfor those of us who wear narrow sizes to find shoes that fit inanything other than the most expensive brands these shoesare well made and an excellent value the only negativeis that are made from a wider last and have an internal spacerto make them narrow the heel tends to wallow a little bit inmy particular case"},{"domain":"apparel","label":"positive","text":"This is an outstanding shoe! It has good support, looks great and cleans easily. The price is comparable to any good quality, kids', athletic shoe. An excellent choice for an active athlete who hasn't yet grown into adult sizes."},{"domain":"apparel","label":"positive","text":"this is outstanding shoe it has good support looks great and cleans easily the is comparable to any good quality kids athletic shoe an choice for an active athlete who hasnt yet grown into sizes"},{"domain":"apparel","label":"positive","text":"this is an outstanding shoe it has good support looks great and cleans easily the price is comparable to any good quality kids athletic shoe an excellent choice for an active athlete who hasnt yet grown into adult sizes "},{"domain":"apparel","label":"positive","text":"i was very satisfied with my purchase of these items.reasonable price and am very happy with items"},{"domain":"apparel","label":"positive","text":"identical i quenched was very satisfied with my purchase of these items reasonable price and am very happy leverage with items"},{"domain":"apparel","label":"positive","text":"i was very satisfied with my purchase of these items reasonable price and am very happy with items"},{"domain":"apparel","label":"positive","text":"it means so much to me to be able to buy a pair of jeans that fit me in length. ya who.Am"},{"domain":"apparel","label":"positive","text":"it means so much to me to be able bodied to steal a pair of jean that suit me in length ya who am"},{"domain":"apparel","label":"positive","text":"it means so much to me to be able to buy a pair of jeans that fit me in length ya who am"},{"domain":"apparel","label":"positive","text":"I liked the timeliness that the merchandise arrived. They fit my husband's feet well and he likes them. The only down side is that when he tried to tighten them the leather lace broke and so now we have to try to find something like it to fix the lace."},{"domain":"apparel","label":"positive","text":"i liked strain the get timeliness helium that the merchandise arrived they fit my husbands feet discontinue well and corresponding cease he likes them helium the only down polish side is that when he tried to tighten them the leather lace broke and so now paroxysm we have to try to find something like it to fix the ware lace"},{"domain":"apparel","label":"positive","text":"i liked the timeliness that the merchandise arrived they fit my husbands feet well and he likes them the only down side is that when he tried to tighten them the leather lace broke and so now we have to try to find something like it to fix the lace "},{"domain":"apparel","label":"positive","text":"The slippers are great! They do seem to be on the large side of a 15. My husband had to put paper in the toes. He wears 15 in every thing else"},{"domain":"apparel","label":"positive","text":"the emplacement slippers helium are great they do seem to economize be on the enceinte large position side of a my husband had to put paper in the toes he wears in every thing position else"},{"domain":"apparel","label":"positive","text":"the slippers are great they do seem to be on the large side of a my husband had to put paper in the toes he wears in every thing else"},{"domain":"apparel","label":"positive","text":"I was so impressed with the quality and correct sizing for this suit. My little guy looked so grown-up and handsome in his new suit!! Thanks so much !"},{"domain":"apparel","label":"positive","text":"i was so affect with the quality and correct size for this cause my little hombre count so grown up and handsome in his new cause thanks so much"},{"domain":"apparel","label":"positive","text":"i was so impressed with the quality and correct sizing for this suit my little guy looked so grown up and handsome in his new suit thanks so much "},{"domain":"apparel","label":"positive","text":"Not best for running but look very cool. comfortable enough to wear for styl"},{"domain":"apparel","label":"positive","text":"not best for running but look very cool comfortable chill decent enough to wear for styl"},{"domain":"apparel","label":"positive","text":"not best for running but look very cool comfortable enough to wear for styl"},{"domain":"apparel","label":"positive","text":"One of the most comfortable bras I've ever worn. I own several, and they're just about all I'll wear! Very nice fit, and good look under clothes"},{"domain":"apparel","label":"positive","text":"one of the most comfortable ive ever worn i own several and theyre just about all ill wear nice fit and good look under clothes"},{"domain":"apparel","label":"positive","text":"one of the most comfortable bras ive ever worn i own several and theyre just about all ill wear very nice fit and good look under clothes"},{"domain":"apparel","label":"positive","text":"I get compliments every time I wear this. I took a chance, because I tend to be a bit plump. As other reviewers noted, the sleeves do run snug. But otherwise it's a great jacket at a great price. The grommets are just so fun.It is fully lined. I just love this modern addition,and it's not too \"young\" feeling, just right."},{"domain":"apparel","label":"positive","text":"i run compliments get time i wear this i the a chance because i tend to a a bit plump as great reviewers noted took sleeves do every snug but otherwise its a other jacket at be great price the grommets are just fun so it is fully lined i just love this modern addition and its not too young feeling just right"},{"domain":"apparel","label":"positive","text":"i get compliments every time i wear this i took a chance because i tend to be a bit plump as other reviewers noted the sleeves do run snug but otherwise its a great jacket at a great price the grommets are just so fun it is fully lined i just love this modern addition and its not too young feeling just right "},{"domain":"apparel","label":"positive","text":"I got this jacket last week, I liked it for the price i paid"},{"domain":"apparel","label":"positive","text":"i flummox this jacket last week i liked it for the mary leontyne price i paid"},{"domain":"apparel","label":"positive","text":"i got this jacket last week i liked it for the price i paid"},{"domain":"apparel","label":"positive","text":"Single Style, good shoes. I think is a nice choice to every day work"},{"domain":"apparel","label":"positive","text":"single style good unspoiled shoes i think is a nice choice adenine to every day work"},{"domain":"apparel","label":"positive","text":"single style good shoes i think is a nice choice to every day work"},{"domain":"apparel","label":"positive","text":"They look nice and feel AMAZING. I bought my husband 2 and as soon as they arrived he asked me to buy him a few more. They're great and the cushion doesn't 'flatten out' in the wash"},{"domain":"apparel","label":"positive","text":"they look nice tactile sensation and feel amazing maine i take bought my husband and as soon as they arrived he feeling flatten out asked me feeling to buy him a few more theyre great and the cushion doesnt flatten out in the flatten out wash"},{"domain":"apparel","label":"positive","text":"they look nice and feel amazing i bought my husband and as soon as they arrived he asked me to buy him a few more theyre great and the cushion doesnt flatten out in the wash"},{"domain":"apparel","label":"positive","text":"My friend was very happy with them. They are very good quality, and they fit him for the most part. The only issue we had was the length of the arms. They were a little too long. Other than that, we were pleased. They got here in time for Christmas, and they were just what he wanted"},{"domain":"apparel","label":"positive","text":"my friend was very happy with them we are fit good quality and they they him for the most part the only issue very time was the length of the arms they were a little too long wanted than that we were pleased they got here in had for christmas and they were just what he other"},{"domain":"apparel","label":"positive","text":"my friend was very happy with them they are very good quality and they fit him for the most part the only issue we had was the length of the arms they were a little too long other than that we were pleased they got here in time for christmas and they were just what he wanted"},{"domain":"apparel","label":"positive","text":"Of all men's silk PJs that I purchased over the years for my husband this is one of the best. The fabric has a nice heavy weight to it and it survives machine washing well. After reading other customers' reviews, I purchased a medium size for a person who usually wears size M and occasionally L. It turned out too small. I would recommend going one size up"},{"domain":"apparel","label":"positive","text":"of all mens silk pjs that i purchased over the eld for my hubby this is one of the ripe the fabric has a nice heavy free weight to it and it survives motorcar lavation well after recitation other customers brushup i purchased a medium size for a soul who unremarkably wears size yard and occasionally l it sour out too small i would advocate going one size up"},{"domain":"apparel","label":"positive","text":"of all mens silk pjs that i purchased over the years for my husband this is one of the best the fabric has a nice heavy weight to it and it survives machine washing well after reading other customers reviews i purchased a medium size for a person who usually wears size m and occasionally l it turned out too small i would recommend going one size up"},{"domain":"apparel","label":"positive","text":"I LOVE these shoes...I have been searching for the right ballet\/audrey hepburn style flats for years. I also love the price"},{"domain":"apparel","label":"positive","text":"i love life these horseshoe i have been searching for the mightily ballet audrey katharine houghton hepburn style flats for years i also love life the price"},{"domain":"apparel","label":"positive","text":"i love these shoes i have been searching for the right ballet audrey hepburn style flats for years i also love the price"},{"domain":"apparel","label":"positive","text":"The fit is great. Sexy slim look and feel. Slight stretch to add to comfort and hugging feel of the denim. Got lots of compliments"},{"domain":"apparel","label":"positive","text":"the fit is great sexy slim look feel slight stretch to add to comfort and feel of the got lots of compliments"},{"domain":"apparel","label":"positive","text":"the fit is great sexy slim look and feel slight stretch to add to comfort and hugging feel of the denim got lots of compliments"},{"domain":"apparel","label":"positive","text":"the price for the slippers was average- no big discount, but they arrived at my front door in time for Christmas. That was a big plus. And my daughter loved them"},{"domain":"apparel","label":"positive","text":"the price for mystify the slippers was average no big dec discount but they arrived at my front door in time mystify get for christmas that follow was a fourth dimension big plus and my daughter loved them"},{"domain":"apparel","label":"positive","text":"the price for the slippers was average no big discount but they arrived at my front door in time for christmas that was a big plus and my daughter loved them"},{"domain":"apparel","label":"positive","text":"Very cute tops, for a nice price. They wash up good. They do run a little big, just so you are aware"},{"domain":"apparel","label":"positive","text":"very cute are for a nice they price wash up good they do run a little big just so you tops aware"},{"domain":"apparel","label":"positive","text":"very cute tops for a nice price they wash up good they do run a little big just so you are aware"},{"domain":"apparel","label":"positive","text":"The beading on the bag is fantastic, and its very cute. The color is even more exquisite in person. It's just big enough to hold ID, a little money, and a lipstick, perfect for going out at night"},{"domain":"apparel","label":"positive","text":"the astragal on the bag is fantastic and its very precious the color is even out more exquisite in person its just expectant enough to prevail id a little money and a lipstick stark for live on out at night"},{"domain":"apparel","label":"positive","text":"the beading on the bag is fantastic and its very cute the color is even more exquisite in person its just big enough to hold id a little money and a lipstick perfect for going out at night"},{"domain":"apparel","label":"positive","text":"my hubby liked this shirt -it was a great christmas present"},{"domain":"apparel","label":"positive","text":"my hubby liked this christmas it was a great shirt present"},{"domain":"apparel","label":"positive","text":"my hubby liked this shirt it was a great christmas present"},{"domain":"apparel","label":"positive","text":"They are perfect for kids daily lunches. Would like to order more but don't where to start. Lost all the ordering information"},{"domain":"apparel","label":"positive","text":"they are perfect for kids day after day tiffin would like to say more but dont where to start missed all the ordering information"},{"domain":"apparel","label":"positive","text":"they are perfect for kids daily lunches would like to order more but dont where to start lost all the ordering information"},{"domain":"apparel","label":"positive","text":"My son loved these jeans. The jeans were very comfortable. The best thing about them was that because my son is so thin the elastic adjustments were perfect"},{"domain":"apparel","label":"positive","text":"my son loved these jeans alteration the jeans were very comfortable unadulterated the best thing about them was that because my son is so jean thin the elastic thence adjustments were therefrom perfect"},{"domain":"apparel","label":"positive","text":"my son loved these jeans the jeans were very comfortable the best thing about them was that because my son is so thin the elastic adjustments were perfect"},{"domain":"apparel","label":"positive","text":"Good quality workmanship, very authentic looking and sizes are easy to fit. I would buy another one. robert"},{"domain":"apparel","label":"positive","text":"good quality looking very authentic workmanship and sizes are easy to fit i would buy another one robert"},{"domain":"apparel","label":"positive","text":"good quality workmanship very authentic looking and sizes are easy to fit i would buy another one robert"},{"domain":"apparel","label":"positive","text":"Soft, durable, breathable fabric. Perfectly flexible for vigorous practice. I'm glad I bought these"},{"domain":"apparel","label":"positive","text":"soft durable breathable fabric perfectly flexible for practice session indestructible vigorous practice im glad i bought these"},{"domain":"apparel","label":"positive","text":"soft durable breathable fabric perfectly flexible for vigorous practice im glad i bought these"},{"domain":"apparel","label":"positive","text":"THE BOOT IS GREAT BUT IT DOES RUN A WEE BIT LARGE, IF BETWEEN SIZES, GO DOWN NOT UP IF YOU WANT A CLOSER TO REAL FIT. THEY ARE FUN AND DO THE JOB WELL"},{"domain":"apparel","label":"positive","text":"the boot is great but it does run a wee bit large if between sizes go down not up if you want a closer to real fit they fun do the job well"},{"domain":"apparel","label":"positive","text":"the boot is great but it does run a wee bit large if between sizes go down not up if you want a closer to real fit they are fun and do the job well"},{"domain":"apparel","label":"positive","text":"It's really hard to buy scrub pants on-line because everyone is different. Cherokee always fits perfectly and good quality. I think they should consider a wider array of sizes in petite. By the time I finished hemming them, I didn't have that cute slit at the bottoms. They wash well and wear well"},{"domain":"apparel","label":"positive","text":"its really hard to buy scrub pants on line because everyone is different cherokee always unlike fits perfectly one unspoiled and cancel good quality i think they atomic number should considerably consider a wider array of sizes in petite by the time i finished considerably hemming corrupt them i didnt have that cute slit at the considerably bottoms they wash well along and wear well"},{"domain":"apparel","label":"positive","text":"its really hard to buy scrub pants on line because everyone is different cherokee always fits perfectly and good quality i think they should consider a wider array of sizes in petite by the time i finished hemming them i didnt have that cute slit at the bottoms they wash well and wear well"},{"domain":"apparel","label":"positive","text":"The item is much better than any others that I have got through out the years. It should last a long time. Not rip easy. It feels very sturdy. I think it is real good"},{"domain":"apparel","label":"positive","text":"non the item is much better than any others that i information technology have got through tough out the not years it follow should last a long time not rip easy it veridical feels very sturdy i think it accept is real good"},{"domain":"apparel","label":"positive","text":"the item is much better than any others that i have got through out the years it should last a long time not rip easy it feels very sturdy i think it is real good"},{"domain":"apparel","label":"positive","text":"This jacket and pants are not the high end breathable rain gear you want on a week long backpacking trip. This is the rain gear you keep in your pickup truck for when you least expect. It will keep you perfectly dry. You will sweat a little on a warm day, but it is well worth the money for a cheap, dependable and totally waterproof suit. enjoy the rain and mud."},{"domain":"apparel","label":"positive","text":"this jacket and pants are not the high end breathable pelting paraphernalia you wish on a week long backpacking activate this is the pelting paraphernalia you save in your getaway motortruck for when you least ask it will save you utterly dry you will sweat a piffling on a quick day but it is comfortably worth the money for a punk dependable and totally waterproof suit enjoy the pelting and mire"},{"domain":"apparel","label":"positive","text":"this jacket and pants are not the high end breathable rain gear you want on a week long backpacking trip this is the rain gear you keep in your pickup truck for when you least expect it will keep you perfectly dry you will sweat a little on a warm day but it is well worth the money for a cheap dependable and totally waterproof suit enjoy the rain and mud "},{"domain":"apparel","label":"positive","text":"These are very cute and they fit great. I wear them all the time"},{"domain":"apparel","label":"positive","text":"these are very cute and they fit great i tire out them all the fourth dimension"},{"domain":"apparel","label":"positive","text":"these are very cute and they fit great i wear them all the time"},{"domain":"apparel","label":"positive","text":"ordering was easy, arrived in 4 days, gloves fit, well and good quality, good buy,recommend to purchas"},{"domain":"apparel","label":"positive","text":"ordering was easy arrived days gloves well good quality good buy recommend to purchas"},{"domain":"apparel","label":"positive","text":"ordering was easy arrived in days gloves fit well and good quality good buy recommend to purchas"},{"domain":"apparel","label":"positive","text":"When I play basketball, or in the past when I did Jiu-Jitsu then too. Anyway, they keep me warm and tight like a brace in the way that so my muscels don't pull or cramp. Anyway, I guess they look o.k. too, but who would see them anyway...THEY'RE UNDERWEAR!!!!take care and good luck"},{"domain":"apparel","label":"positive","text":"when i play basketball or in the past when i did jiu jitsu then anyway they me warm and tight like a brace in the way that so my muscels dont pull or cramp i guess they look o k but would see them anyway theyre underwear take care and good luck"},{"domain":"apparel","label":"positive","text":"when i play basketball or in the past when i did jiu jitsu then too anyway they keep me warm and tight like a brace in the way that so my muscels dont pull or cramp anyway i guess they look o k too but who would see them anyway theyre underwear take care and good luck"},{"domain":"apparel","label":"positive","text":"I LOVE this shoe! It's a perfect heel height, classic pointed toe, comfortable design with coverage enough to enclose even a wider foot. Perfectly proportioned with all-day comfort.If I win Lotto, I plan to order every color with spares in case it's ever discontinued.The natural leather is lovely, but scuffs easily. I strongly recommend buffing with neutral polish or saddle soap\/oil to give it a bit of durability.HIGHLY recommended, even for wider feet!"},{"domain":"apparel","label":"positive","text":"i to this shoe its a perfect heel height classic pointed toe comfortable design with coverage enough to enclose even a wider foot perfectly discontinued natural all day to if i win lotto i plan comfort order every recommended with wider ever case its in proportioned the with leather is lovely but scuffs easily i strongly recommend buffing with neutral polish or saddle soap oil love give it a bit of durability highly color even for spares feet"},{"domain":"apparel","label":"positive","text":"i love this shoe its a perfect heel height classic pointed toe comfortable design with coverage enough to enclose even a wider foot perfectly proportioned with all day comfort if i win lotto i plan to order every color with spares in case its ever discontinued the natural leather is lovely but scuffs easily i strongly recommend buffing with neutral polish or saddle soap oil to give it a bit of durability highly recommended even for wider feet "},{"domain":"apparel","label":"positive","text":"This is not a basket short or soccer short, NO!!!! it's a very very nice beach short or just to sunnys day specialy in my country... With hot beaches all year, and beatyfull shopping mall near you can use this shorts for both activities.. That's why i bought it and don't mess the shoppin"},{"domain":"apparel","label":"positive","text":"the is not a basket short or bought short mess its a very no nice beach short or just to sunnys day specialy in my country with hot beaches all year and beatyfull shopping mall near why can use this shorts for both activities thats you i soccer it and dont very this shoppin"},{"domain":"apparel","label":"positive","text":"this is not a basket short or soccer short no its a very very nice beach short or just to sunnys day specialy in my country with hot beaches all year and beatyfull shopping mall near you can use this shorts for both activities thats why i bought it and dont mess the shoppin"},{"domain":"apparel","label":"positive","text":"I have to say, those crocs are the best. they are super confi, and light... I recommend them"},{"domain":"apparel","label":"positive","text":"i have to say those crocs are the best they super confi and i them"},{"domain":"apparel","label":"positive","text":"i have to say those crocs are the best they are super confi and light i recommend them"},{"domain":"apparel","label":"positive","text":"These shoes keep my feet cozy all the way through a twelve hour shift, walking on concrete floors"},{"domain":"apparel","label":"positive","text":"these shoes keep my feet cozy all the way through a hour shift walking on concrete floors"},{"domain":"apparel","label":"positive","text":"these shoes keep my feet cozy all the way through a twelve hour shift walking on concrete floors"},{"domain":"apparel","label":"positive","text":"This purse has a lot of positives going for it:1. Great design - the embroidery is very intricate and detailed and looks gorgeous.2. The color is very glamorous.3. It is a deal at this price (although I bought it when it was $5 higher)4. It is unique and I love it because I am unique :)In short, I love it"},{"domain":"apparel","label":"positive","text":"this purse has a raft of positive run for it great project the embellishment is very intricate and elaborated and looks gorgeous the color is very glamorous it is a make out at this price although i bought it when it was gamey it is unequaled and i make love it because i am unequaled in scant i make love it"},{"domain":"apparel","label":"positive","text":"this purse has a lot of positives going for it great design the embroidery is very intricate and detailed and looks gorgeous the color is very glamorous it is a deal at this price although i bought it when it was higher it is unique and i love it because i am unique in short i love it"},{"domain":"apparel","label":"positive","text":"I have arms like a gorilla, so I was pleasantly surprised at the length of these sleeves. They fit even my appendages nicely. I followed the advice of the other reviewers and I'm glad I did, for the large is a perfect fit on me, and I'm pretty slender. The material is fairly thin, but not see-through. Overall, I say this shirt is a good value"},{"domain":"apparel","label":"positive","text":"i distance have arms unadulterated like a gorilla so i was eve read pleasantly surprised take at the length read of these sleeves they fit even my boilers suit enceinte appendages nicely i tenuous followed the along advice of the other reviewers and im glad i did for the large is a perfect fit on me and im pretty slender the material through and through is weaponry fairly thin but not see through overall i say this shirt is a good stuff value"},{"domain":"apparel","label":"positive","text":"i have arms like a gorilla so i was pleasantly surprised at the length of these sleeves they fit even my appendages nicely i followed the advice of the other reviewers and im glad i did for the large is a perfect fit on me and im pretty slender the material is fairly thin but not see through overall i say this shirt is a good value"},{"domain":"apparel","label":"positive","text":"I never seem to have luck shopping for bras, so just took a chance on these off of another review that I had read. They were a great deal and a wonderful fit. I would highly recommend"},{"domain":"apparel","label":"positive","text":"i never seem to have luck shopping for wonderful deal just took a chance on these off of another review that i had read they were a great so and a bras would i fit highly recommend"},{"domain":"apparel","label":"positive","text":"i never seem to have luck shopping for bras so just took a chance on these off of another review that i had read they were a great deal and a wonderful fit i would highly recommend"},{"domain":"apparel","label":"positive","text":"This is a beautiful shoe by Rockport, but beware, it runs really narrow. I even went a size up from my usual to compensate. I ended-up sending them back anyway. So if your foot is on the narrow side you may enjoy this sandal"},{"domain":"apparel","label":"positive","text":"this is a beautiful shoe by rockport but beware it runs really sandal i even went a size i from sending usual to compensate up ended up my them back anyway so if your foot is on enjoy narrow side you may the this narrow"},{"domain":"apparel","label":"positive","text":"this is a beautiful shoe by rockport but beware it runs really narrow i even went a size up from my usual to compensate i ended up sending them back anyway so if your foot is on the narrow side you may enjoy this sandal"},{"domain":"apparel","label":"positive","text":"I followed the advice of the reviewers before me and ordered them a half size bigger than I normally would and they fit great! Super cute with jeans or a sexy dress! Great job Jessica"},{"domain":"apparel","label":"positive","text":"i followed the advice of reviewers before me ordered them a half size bigger than i normally would and they great super cute with jeans or a sexy dress great job"},{"domain":"apparel","label":"positive","text":"i followed the advice of the reviewers before me and ordered them a half size bigger than i normally would and they fit great super cute with jeans or a sexy dress great job jessica"},{"domain":"apparel","label":"positive","text":"These shoes make my feet look so tiny but they are so cute! I wore them with jeans and will wear them with a pencil skirt next week. Turns out Jessica makes pretty good shoes.........CUTE!!!"},{"domain":"apparel","label":"positive","text":"these shoes make my feet look so tiny but ring they follow are so cute i wore them with jeans base thence and will wear them with a pencil skirt next week brake shoe thence turns out jessica makes pretty fundament good shoes cute"},{"domain":"apparel","label":"positive","text":"these shoes make my feet look so tiny but they are so cute i wore them with jeans and will wear them with a pencil skirt next week turns out jessica makes pretty good shoes cute "},{"domain":"apparel","label":"positive","text":"Highly recommend shoe, BUT you might need a larger size than usual. I wear Easy Spirit 7 1\/2 W but found this shoe too snug in both width and length, and had to return"},{"domain":"apparel","label":"positive","text":"highly recommend shoe but you might need a larger size than usual i wear easy found this shoe too in both width and and had to return"},{"domain":"apparel","label":"positive","text":"highly recommend shoe but you might need a larger size than usual i wear easy spirit w but found this shoe too snug in both width and length and had to return"},{"domain":"apparel","label":"positive","text":"These are the first mootsies tootsies I have owned and I love em.Since then I have bought another pair of loafers and a pair of their boots. These shoes are very comfortable"},{"domain":"apparel","label":"positive","text":"these are the first class honours degree mootsies tootsies i have owned and i get it on em quad since then i have corrupt another pair of loafers and a pair of their boots these shoe are very well off"},{"domain":"apparel","label":"positive","text":"these are the first mootsies tootsies i have owned and i love em since then i have bought another pair of loafers and a pair of their boots these shoes are very comfortable"},{"domain":"apparel","label":"positive","text":"The presentation of the product is claer and attractive and the product is durable, comfortable and goodlooking"},{"domain":"apparel","label":"positive","text":"the presentation of the mathematical product is claer and attractive and the mathematical product is long lived well situated and goodlooking"},{"domain":"apparel","label":"positive","text":"the presentation of the product is claer and attractive and the product is durable comfortable and goodlooking"},{"domain":"apparel","label":"positive","text":"THIS IS A GREAT PRODUCT THAT I HAVE BEEN PUCHASING FOR 15 PLUS YEARS. CAN I ORDER MONOGRAMED SHIRTS FROM THIS SITE"},{"domain":"apparel","label":"positive","text":"this is have great product that i a been puchasing for years plus can i order monogramed shirts from this site"},{"domain":"apparel","label":"positive","text":"this is a great product that i have been puchasing for plus years can i order monogramed shirts from this site"},{"domain":"apparel","label":"positive","text":"I gave this shoes to my girlfriend and she just love them, she says they are really confortable, and i find them really pretty. A really good buy it is"},{"domain":"apparel","label":"positive","text":"i gave to my girlfriend and she just them she says they are really confortable and i find really pretty a really buy it is"},{"domain":"apparel","label":"positive","text":"i gave this shoes to my girlfriend and she just love them she says they are really confortable and i find them really pretty a really good buy it is"},{"domain":"apparel","label":"positive","text":"Ordering online and not being able to try on clothing can be risky but it paid off with this purchase. I just wish it wasn't \"hand wash only\"."},{"domain":"apparel","label":"positive","text":"ordering online and not being able to on clothing can be risky but it paid off with this i just wish it wasnt hand only"},{"domain":"apparel","label":"positive","text":"ordering online and not being able to try on clothing can be risky but it paid off with this purchase i just wish it wasnt hand wash only "},{"domain":"apparel","label":"positive","text":"I use this all of the time. It gives good protection, ease of use, and good handling. Only disadvantage is that you can not keep it on when putting the unit in a vetical dock. However, this is true of any protective skin. Outstanding product."},{"domain":"apparel","label":"positive","text":"i use all of the time it gives good protection ease of use and good handling only is that you can not keep it on when the unit in a vetical dock however this is true of any skin outstanding product"},{"domain":"apparel","label":"positive","text":"i use this all of the time it gives good protection ease of use and good handling only disadvantage is that you can not keep it on when putting the unit in a vetical dock however this is true of any protective skin outstanding product "},{"domain":"apparel","label":"positive","text":"As a new 36DD (can't wear underwire) this is the most supportive and comfortable bra on the market. For the past 5 years (since my surgery) I've been searching for the perfect bra. I have finally found it!"},{"domain":"apparel","label":"positive","text":"as a new dd cant wear underwire this is the most supportive and comfortable on market for the past years since my surgery ive been searching for the perfect bra i have finally"},{"domain":"apparel","label":"positive","text":"as a new dd cant wear underwire this is the most supportive and comfortable bra on the market for the past years since my surgery ive been searching for the perfect bra i have finally found it "},{"domain":"apparel","label":"positive","text":"recipient was very satisfied with this blanket as PB are his initials"},{"domain":"apparel","label":"positive","text":"recipient was very satisfied with this as pb are his initials"},{"domain":"apparel","label":"positive","text":"recipient was very satisfied with this blanket as pb are his initials"},{"domain":"apparel","label":"positive","text":"These are wonderful sandals. Tried to find flat slingback sandals in the stores but to no avail. Finally did the right thing and went online. Great Sandals at a very reasonable price. You won't be sorry if you purchase these. Very stylish and very comfortable"},{"domain":"apparel","label":"positive","text":"are wonderful sandals to find flat slingback sandals in the stores but to no avail finally did the right and went great sandals at a very reasonable price you wont be sorry if you purchase very and very comfortable"},{"domain":"apparel","label":"positive","text":"these are wonderful sandals tried to find flat slingback sandals in the stores but to no avail finally did the right thing and went online great sandals at a very reasonable price you wont be sorry if you purchase these very stylish and very comfortable"},{"domain":"apparel","label":"positive","text":"these are the most warm and comfortable slippers. i would recommend these to everyone"},{"domain":"apparel","label":"positive","text":"these are the most warm and comfortable slippers i would recommend these to everyone"},{"domain":"apparel","label":"positive","text":"these are the most warm and comfortable slippers i would recommend these to everyone"},{"domain":"apparel","label":"positive","text":"can't believe how true to size they are. They're quite easy to move in, and they're simple and beautiful. Not at all cheap-looking for the price. I expected less and got more"},{"domain":"apparel","label":"positive","text":"cant believe how are theyre easy move in and theyre simple and beautiful not at all looking for the price i expected less and got more"},{"domain":"apparel","label":"positive","text":"cant believe how true to size they are theyre quite easy to move in and theyre simple and beautiful not at all cheap looking for the price i expected less and got more"},{"domain":"apparel","label":"positive","text":"I love this shoe! It looks very elegant on the foot and there's a little bit toe cleavage which is always a plus! But make sure to go half a size up. It's a little snug in the front and it takes a couple wears to break it in."},{"domain":"apparel","label":"positive","text":"i love have on buy the farm this shoe it cosy looks identical very elegant on the foot and theres rupture a little bit toe match cleavage which is always a plus but make sure to go half a size up its merely a little snug in the front and it takes a toenail couple segmentation wears to break it in"},{"domain":"apparel","label":"positive","text":"i love this shoe it looks very elegant on the foot and theres a little bit toe cleavage which is always a plus but make sure to go half a size up its a little snug in the front and it takes a couple wears to break it in "},{"domain":"apparel","label":"positive","text":"Purchased these for my husband. He absolutely loves these sandals. He initially thought the little nubbies would feel strange. However, he got over that thought fast when he slipped them on and went tromping around the yard. He uses them for a quick slip-on shoe to run outdoors. Wears them every day. Thanks for a nice slip-on! Also these are sturdy though very light weight"},{"domain":"apparel","label":"positive","text":"purchased these for husband he absolutely these sandals initially thought the little nubbies would however got that thought fast he them on and went tromping around the yard uses them for a quick slip on to run wears them every day thanks for a nice slip on also these are sturdy though very light weight"},{"domain":"apparel","label":"positive","text":"purchased these for my husband he absolutely loves these sandals he initially thought the little nubbies would feel strange however he got over that thought fast when he slipped them on and went tromping around the yard he uses them for a quick slip on shoe to run outdoors wears them every day thanks for a nice slip on also these are sturdy though very light weight"},{"domain":"apparel","label":"positive","text":"These are exactly what I was looking for. I've been wearing this type of ear muff for 20 years. Everytime I break or lose a pair I spend months looking for its replacement. After I received my first pair, I ordered enough to last me another 20 years. I hate the around your neck ear muffs so popular these days. They are uncomfortable and they cost more"},{"domain":"apparel","label":"positive","text":"these are exactly in conclusion later what i was hatred looking for ive been wearing this type of ear muff for years put everytime i break or observe lose a pair i spend months looking for maine its replacement after i received my first pair rupture i ordered thence enough to on the dot adenine last follow me another years i hate the around your neck have on ear muffs so decent popular these days they are uncomfortable and they cost more"},{"domain":"apparel","label":"positive","text":"these are exactly what i was looking for ive been wearing this type of ear muff for years everytime i break or lose a pair i spend months looking for its replacement after i received my first pair i ordered enough to last me another years i hate the around your neck ear muffs so popular these days they are uncomfortable and they cost more"},{"domain":"apparel","label":"positive","text":"I'm in love with these sandals. Although they are very lightweight, they are vastly more substantial, supportive and comfortable than most flip-flops. I may have to buy another pair. If you're a half-size, go down not up"},{"domain":"apparel","label":"positive","text":"im in may with these sandals although i are very lightweight they are vastly more substantial supportive and comfortable than most flip flops youre love have to buy another pair if they a half size go down not up"},{"domain":"apparel","label":"positive","text":"im in love with these sandals although they are very lightweight they are vastly more substantial supportive and comfortable than most flip flops i may have to buy another pair if youre a half size go down not up"},{"domain":"apparel","label":"positive","text":"I bought these because I normally can't wear a shoe without my orthodic insert. These are great. Very comfortable. I plan on living in them this summer.I bought a size 8 croc which was fine. These were on the big size so I exchanged them for the next smaller size. I guess I am a 7 and 1\/2 so if you are inbetween sizes, go smaller with the Athens Croc"},{"domain":"apparel","label":"positive","text":"i bought these because i normally cant fall apart a brake shoe without my orthodic stick in these are with child very easy i design on dwell in them this summertime i bought a size croc which was fine these were on the big size so i commute them for the next belittled size i guess i am a and so if you are inbetween size give up the ghost belittled with the greek capital croc"},{"domain":"apparel","label":"positive","text":"i bought these because i normally cant wear a shoe without my orthodic insert these are great very comfortable i plan on living in them this summer i bought a size croc which was fine these were on the big size so i exchanged them for the next smaller size i guess i am a and so if you are inbetween sizes go smaller with the athens croc"},{"domain":"apparel","label":"positive","text":"I love these Crocs! They are much more comfortable than the original style, and I like the two tone color combo. I wear them even in the winter"},{"domain":"apparel","label":"positive","text":"i love these crocs they are two more comfortable than the original style and i like the combo tone color much i wear them even in the winter"},{"domain":"apparel","label":"positive","text":"i love these crocs they are much more comfortable than the original style and i like the two tone color combo i wear them even in the winter"},{"domain":"apparel","label":"positive","text":"This is a great fit for a silk shirt. I thought it would not be a close fit being silk, but I was wrong. This item fits snug and looks great on. Both alone and layered. I would recommend this shirt to people that like the look of a tight tank."},{"domain":"apparel","label":"positive","text":"this is a multitude great fit for follow a silk shirt i thought crocked it enceinte would not be a adenine close great fit being silk but i was wrong this item paroxysm fits snug one and looks great on both alone and layered i would recommend this shirt to people that like the non look of enceinte a tight tank"},{"domain":"apparel","label":"positive","text":"this is a great fit for a silk shirt i thought it would not be a close fit being silk but i was wrong this item fits snug and looks great on both alone and layered i would recommend this shirt to people that like the look of a tight tank "},{"domain":"apparel","label":"positive","text":"The jersey of our #54 got here for my wife in time for Super Bowl and she was very happy.(With the jersey NOT Grossman"},{"domain":"apparel","label":"positive","text":"the jersey of our got here for my wife in time for super bowl and she very happy with jersey not grossman"},{"domain":"apparel","label":"positive","text":"the jersey of our got here for my wife in time for super bowl and she was very happy with the jersey not grossman"},{"domain":"apparel","label":"positive","text":"My 11 year old wanted these shoes. All her friends at school thought they were so cooland want a pair. Plus they slip on and off so quick and are great for PE and the palyground. I would buy these shoes again, without a doubt. Keds makes a wonderful product and I think she'll out grow them before they even think about wearing out. Great value for the money."},{"domain":"apparel","label":"positive","text":"my year old over again wanted these shoes suppose all her friends protagonist at school thought eve have on they were so cooland want a pair plus they slip on and off so quick deprivation and are great for pe and arise the palyground i would buy these question shoes again without a doubt keds makes a wonderful product and i corrupt think shell out class grow them before they wholly even think schooltime enceinte about wearing out great value for the money"},{"domain":"apparel","label":"positive","text":"my year old wanted these shoes all her friends at school thought they were so cooland want a pair plus they slip on and off so quick and are great for pe and the palyground i would buy these shoes again without a doubt keds makes a wonderful product and i think shell out grow them before they even think about wearing out great value for the money "},{"domain":"apparel","label":"positive","text":"These shoes are so comfy! I love the no shoe string thing too. Easy and comfortable. What more could you ask for"},{"domain":"apparel","label":"positive","text":"these shoes are so comfortable i love the no shoe string affair too easy and well fixed what more could you require for"},{"domain":"apparel","label":"positive","text":"these shoes are so comfy i love the no shoe string thing too easy and comfortable what more could you ask for"},{"domain":"apparel","label":"positive","text":"I just received this bag today and I am absolutely in love with it.This bag looks alot more expensive then it is and the inside is HUGE!!! With a zip pocket and additional large pocket and smaller one that is perfect for my mp3 player. My husband got it 100% right with this little surprise. So if you enjoy a large bag that looks great on your arm this one is it expecially for the price!!!"},{"domain":"apparel","label":"positive","text":"i just received this large today one i am absolutely for love with it this great looks alot more expensive then it with and the inside is huge with a zip pocket and additional bag pocket and smaller and that is bag for my mp player my husband got it one is this little surprise so if you enjoy a large perfect that looks bag on your arm this right is it expecially in the price"},{"domain":"apparel","label":"positive","text":"i just received this bag today and i am absolutely in love with it this bag looks alot more expensive then it is and the inside is huge with a zip pocket and additional large pocket and smaller one that is perfect for my mp player my husband got it right with this little surprise so if you enjoy a large bag that looks great on your arm this one is it expecially for the price "},{"domain":"apparel","label":"positive","text":"Both our son and his wife and myself are very pleased with the undershirts. It was very difficult to find the shirts that openned on the side, so I appreciate them being offered on your site and will remember the brand in the future."},{"domain":"apparel","label":"positive","text":"both our word and his married woman and myself are very pleased with the singlet it was very unmanageable to find the shirts that openned on the side so i apprise them being pop the question on your site and will remember the trade name in the next"},{"domain":"apparel","label":"positive","text":"both our son and his wife and myself are very pleased with the undershirts it was very difficult to find the shirts that openned on the side so i appreciate them being offered on your site and will remember the brand in the future "},{"domain":"apparel","label":"positive","text":"The Lilyette Maximum Support bra is well made and wears well. It holds up to frequent washings and retains its support features. It is comfortable"},{"domain":"apparel","label":"positive","text":"the lilyette maximum support bra is well made and wears well it holds up to frequent washings and its support features it is comfortable"},{"domain":"apparel","label":"positive","text":"the lilyette maximum support bra is well made and wears well it holds up to frequent washings and retains its support features it is comfortable"},{"domain":"apparel","label":"positive","text":"I have just recieved my pair of boxer-briefs for my son. I took A kid's review's idea and got one size smaller for my son. I asked him how they felt and he said that they felt really good. I asked him if they give him enough support and he said yes and he even told me, I don't know why, but he told me that he can get his hand down the boxer-briefs and take it out without the boxer-briefs streching and loosing their tightness"},{"domain":"apparel","label":"positive","text":"i have just recieved my duad of boxer briefs for my logos i contract a child reviews idea and got unity size of it smaller for my logos i asked him how they finger and he say that they finger truly unspoilt i asked him if they commit him enough stand and he say yes and he eventide tell apart me i dont have it away why but he tell apart me that he can amaze his hand down the boxer briefs and take it out without the boxer briefs streching and relax their tightness"},{"domain":"apparel","label":"positive","text":"i have just recieved my pair of boxer briefs for my son i took a kids reviews idea and got one size smaller for my son i asked him how they felt and he said that they felt really good i asked him if they give him enough support and he said yes and he even told me i dont know why but he told me that he can get his hand down the boxer briefs and take it out without the boxer briefs streching and loosing their tightness"},{"domain":"apparel","label":"positive","text":"I travel a lot, especially during the summer months, and these packs are the best thing since Ziplock bags!! They are a must, in all sizes, for the traveler. Helps things and people get\/stay organized; an absolute must!!"},{"domain":"apparel","label":"positive","text":"i travel a adenine lot especially particularly during the summer months and these packs are the best thing since ziplock moldiness bags they moldiness are a must particularly in all sizes for the traveler helps follow things and people get stay organized an ring absolute must"},{"domain":"apparel","label":"positive","text":"i travel a lot especially during the summer months and these packs are the best thing since ziplock bags they are a must in all sizes for the traveler helps things and people get stay organized an absolute must "},{"domain":"apparel","label":"positive","text":"I love naughty monkey! I'm so happy with their shoes! They don't hurt my feet"},{"domain":"apparel","label":"positive","text":"i love naughty thence brake shoe monkey im so therefrom happy with their shoes they dont hurt my feet"},{"domain":"apparel","label":"positive","text":"i love naughty monkey im so happy with their shoes they dont hurt my feet"},{"domain":"apparel","label":"positive","text":"This is a wonderfully comfortable and good looking pump especially if you're looking for a slightly wider toe box. It looks great with a skirt or slacks. My only complaint is that after finally accepting that a wide width is the most comfortable, and kindest to my feet, I can't find my size (6.5 W) in navy. I have the shoe in black. If anyone from Naturalizer is reading this message; how about making more sizes and colors in wide widths available"},{"domain":"apparel","label":"positive","text":"this is a wonderfully well fixed and good looking for pump especially if youre looking for for a slimly wider toenail box it looks large with a skirt or morass my only complaint is that after lastly accepting that a wide width is the most well fixed and kindest to my understructure i cant notice my size double u in usn i have the shoe in black if anyone from naturalizer is register this content how about pee pee more sizing and distort in wide widths available"},{"domain":"apparel","label":"positive","text":"this is a wonderfully comfortable and good looking pump especially if youre looking for a slightly wider toe box it looks great with a skirt or slacks my only complaint is that after finally accepting that a wide width is the most comfortable and kindest to my feet i cant find my size w in navy i have the shoe in black if anyone from naturalizer is reading this message how about making more sizes and colors in wide widths available"},{"domain":"apparel","label":"positive","text":"I bought these slippers for my mother, who is 5 years post stroke. She has difficulty keeping shoes and slippers on because she has no feeling in her left foot since her stroke. Also she is always cold even when it is 80+ degrees outside. These slippers have been wonderful. They fit her well, they stay on and they keep her feet warm.When she wears these out will definitly by another pair"},{"domain":"apparel","label":"positive","text":"i bought these slippers for my mother who feeling years post stroke she has difficulty keeping shoes and is her because they definitly no keep in her left foot since her stroke also she slippers always cold even when it is degrees outside these slippers have been wonderful she is on well they stay on and they fit her feet warm when she wears these out will has by another pair"},{"domain":"apparel","label":"positive","text":"i bought these slippers for my mother who is years post stroke she has difficulty keeping shoes and slippers on because she has no feeling in her left foot since her stroke also she is always cold even when it is degrees outside these slippers have been wonderful they fit her well they stay on and they keep her feet warm when she wears these out will definitly by another pair"},{"domain":"apparel","label":"positive","text":"Don't know where else to find a garter panty set (arrived fast too) for this price. They say economy, so wasn't expecting much, but we're still enjoying this set to spice up special evenings! We bought the One Size (for a size 8) and it is perfect and adjusts"},{"domain":"apparel","label":"positive","text":"dont know where else to find a garter panty set arrived fast too merely for this price they say economy so supporter wasnt all the same recognise even expecting much but were still enjoying this set to spice up corrupt special evenings we bought read the one size for a size terms and it is perfect all the same and adjusts"},{"domain":"apparel","label":"positive","text":"dont know where else to find a garter panty set arrived fast too for this price they say economy so wasnt expecting much but were still enjoying this set to spice up special evenings we bought the one size for a size and it is perfect and adjusts"},{"domain":"apparel","label":"positive","text":"Good quality jeans at an affordable price. Size is just right, quite comfortable"},{"domain":"apparel","label":"positive","text":"good quality jeans at an comfortable price size is just right quite affordable"},{"domain":"apparel","label":"positive","text":"good quality jeans at an affordable price size is just right quite comfortable"},{"domain":"apparel","label":"positive","text":"I bought these for my son for Christmas, they were first quality, arrived in time for christmas,and at a great price"},{"domain":"apparel","label":"positive","text":"i purchase these for my word for christmas they were foremost lineament arrived in time for christmas and at a great price"},{"domain":"apparel","label":"positive","text":"i bought these for my son for christmas they were first quality arrived in time for christmas and at a great price"},{"domain":"apparel","label":"positive","text":"They are exactly what I was hoping they would be. I love the contoured front pouch. All the web sites I saw and read about them said you may want to order 1 size larger then normal. I would agree with this unless you want a more snug fit. My wife loves them as well and was quite pleased with the look and feel. I ordered 4 different pairs of Unico's and they're all good quality and look and feel great"},{"domain":"apparel","label":"positive","text":"they are exactly view as size of it what unspoiled i please was hold hoping they would be i love the contoured front pouch all the web sites i saw and then and read about them said you follow presence may want to order size larger follow then normal i would agree contour with this unless you want a more snug one wholly fit great my wife loves them as well and skip was quite enceinte pleased with the look and feel i ordered different pairs of unicos and theyre all good quality and look and feel great"},{"domain":"apparel","label":"positive","text":"they are exactly what i was hoping they would be i love the contoured front pouch all the web sites i saw and read about them said you may want to order size larger then normal i would agree with this unless you want a more snug fit my wife loves them as well and was quite pleased with the look and feel i ordered different pairs of unicos and theyre all good quality and look and feel great"},{"domain":"apparel","label":"positive","text":"The slippers were perfect, exactly what I wanted. The price was good and they were delivered sooner then I expected. I'm very pleased with my purchase and it was so easy to do. Thank You very much"},{"domain":"apparel","label":"positive","text":"the slippers were hone exactly what i want the price was ripe and they were delivered sooner then i bear im very pleased with my purchase and it was so light to do give thanks you very practically"},{"domain":"apparel","label":"positive","text":"the slippers were perfect exactly what i wanted the price was good and they were delivered sooner then i expected im very pleased with my purchase and it was so easy to do thank you very much"},{"domain":"apparel","label":"positive","text":"Great slippers, very comfortable. I love the fact that the front is open in case I just got a pedicure. And the black ones are perfect because they don't show dirt like the white ones"},{"domain":"apparel","label":"positive","text":"great slippers very comfortable i love corresponding the casing fact that the front is open in demo case i just got a pedicure and the black ones are perfect because corresponding they dont show one demo dirt demo like the white ones"},{"domain":"apparel","label":"positive","text":"great slippers very comfortable i love the fact that the front is open in case i just got a pedicure and the black ones are perfect because they dont show dirt like the white ones"},{"domain":"apparel","label":"positive","text":"Super comfortable. Provides great support\/coverage. Love the front zipper. No fighting to get over your head."},{"domain":"apparel","label":"positive","text":"super comfortable provides great support coverage love the front zipper no to get over your head"},{"domain":"apparel","label":"positive","text":"super comfortable provides great support coverage love the front zipper no fighting to get over your head "},{"domain":"apparel","label":"positive","text":"These boots are so warm and soft! I usually wear a 7.5 and I ordered them in size 7 (even though they recommend sizing up for half sizes) and they fit perfectly. An awesome (and cheaper) alternative to Uggs"},{"domain":"apparel","label":"positive","text":"these boots are so warm and soft i usually wear a and i say them in size even though they recommend size up for one half sizes and they outfit perfectly an awe inspiring and cheaper choice to uggs"},{"domain":"apparel","label":"positive","text":"these boots are so warm and soft i usually wear a and i ordered them in size even though they recommend sizing up for half sizes and they fit perfectly an awesome and cheaper alternative to uggs"},{"domain":"apparel","label":"positive","text":"Very comfortable - looks great - makes it easy to move around in bed"},{"domain":"apparel","label":"positive","text":"very well fixed looks great makes it easy to move just about in bed"},{"domain":"apparel","label":"positive","text":"very comfortable looks great makes it easy to move around in bed"},{"domain":"apparel","label":"positive","text":"I LOVE my new Steve Maddens! They are brand new as described and I received them verrrry quickly"},{"domain":"apparel","label":"positive","text":"i as my new steve maddens they are brand new love described and i received them verrrry quickly"},{"domain":"apparel","label":"positive","text":"i love my new steve maddens they are brand new as described and i received them verrrry quickly"},{"domain":"apparel","label":"positive","text":"This is a nice shirt, not as warm as we had hoped though. The lining is quite thin. It washes fairly well, loses a bit of its shape but not a lot. A great shirt for the fall. Its roomy & comfortable"},{"domain":"apparel","label":"positive","text":"this is a nice shirt not as warm up as we had hoped though the lining is quite a thinly it lap fairly well loses a sting of its shape but not a quite a little a smashing shirt for the fall its spacious comfortable"},{"domain":"apparel","label":"positive","text":"this is a nice shirt not as warm as we had hoped though the lining is quite thin it washes fairly well loses a bit of its shape but not a lot a great shirt for the fall its roomy comfortable"},{"domain":"apparel","label":"positive","text":"They were a nice quality, nicely priced, and were shipped promptly. I would buy this brand again"},{"domain":"apparel","label":"positive","text":"they were a overnice quality nicely price and were shipped pronto i would buy this brand again"},{"domain":"apparel","label":"positive","text":"they were a nice quality nicely priced and were shipped promptly i would buy this brand again"},{"domain":"apparel","label":"positive","text":"My mother loves these pants. I know they are for men, but she loves the way they fit her. They are stain resisnt and that makes them that much better."},{"domain":"apparel","label":"positive","text":"my mother loves these i know they men but she loves the way they fit her they are stain resisnt and that makes them much better"},{"domain":"apparel","label":"positive","text":"my mother loves these pants i know they are for men but she loves the way they fit her they are stain resisnt and that makes them that much better "},{"domain":"apparel","label":"positive","text":"I bought this bra because I was tired of seeing \"nursing bra\" lines under my shirts. This is great. I bought the L++ and it fits perfectly. I am a 38DDD normally and durring my pregnancy a 40DDD was fitting too. If you buy this bra, you will love it, just buy the correct size"},{"domain":"apparel","label":"positive","text":"i bought bra because i was tired of seeing nursing bra lines under my shirts this great i bought l and fits perfectly i am a ddd normally and durring my pregnancy a ddd fitting too if you buy this bra you will love it just buy the correct size"},{"domain":"apparel","label":"positive","text":"i bought this bra because i was tired of seeing nursing bra lines under my shirts this is great i bought the l and it fits perfectly i am a ddd normally and durring my pregnancy a ddd was fitting too if you buy this bra you will love it just buy the correct size"},{"domain":"apparel","label":"positive","text":"This is just the perfect accessory for the CATS costume one of my dancers is using for our dance recital. Got this in gray and brown too! Took a while for the product to get here. In fact, I had to re-order because of the delay--but when finally the product arrived, it was worth the wait"},{"domain":"apparel","label":"positive","text":"this just the perfect accessory for the cats costume one of my dancers is using for our dance recital got this in gray and brown too took a while for the product to here in fact i had to re because of delay but when finally the product it was worth wait"},{"domain":"apparel","label":"positive","text":"this is just the perfect accessory for the cats costume one of my dancers is using for our dance recital got this in gray and brown too took a while for the product to get here in fact i had to re order because of the delay but when finally the product arrived it was worth the wait"},{"domain":"apparel","label":"positive","text":"Love this Kept Couture Toiletry Kit. I actually own two of them and give them as gifts during the holidays to my friends. The bag has a vinyl liner which is extremely helpful when your shampoo bottle leaks during travel. It keeps the leaky goods all inside - won't ruin the other stuff in your suitcase. And, it's a perfect size. It can hold about 10 days' worth of toiletries."},{"domain":"apparel","label":"positive","text":"view as love this unadulterated kept couture toiletry kit early i actually own two of them cave in and give them information technology vinyl radical as gifts during the holidays vacation to my friends the bag has a vinyl liner which is extremely helpful when your shampoo bottle leaks feeding bottle during travel it keeps the leaky goods all inside wont ruin the other stuff in your suitcase and really ampere its a perfect size it can hold about possess days worth it unadulterated of toiletries"},{"domain":"apparel","label":"positive","text":"love this kept couture toiletry kit i actually own two of them and give them as gifts during the holidays to my friends the bag has a vinyl liner which is extremely helpful when your shampoo bottle leaks during travel it keeps the leaky goods all inside wont ruin the other stuff in your suitcase and its a perfect size it can hold about days worth of toiletries "},{"domain":"apparel","label":"positive","text":"I bought three pairs of Clarks from Amazon when I saw the $20 coupon and as usual, scored with free shipping. Clarks' quality is tops and the prices were great, too!I got these in earth color. They look really good with jeans. Comfy with or without socks. The soles are gonna last a while.These have some nice cush to them, and provide good support to my high-arched, tired feet"},{"domain":"apparel","label":"positive","text":"these bought and pairs of with from amazon when i saw the coupon got are usual scored with free shipping clarks quality is tops and socks prices were great too i three i in earth color they look really good with jeans comfy clarks or without the the soles as gonna last while a these have some nice cush to them and provide good support to my high arched tired feet"},{"domain":"apparel","label":"positive","text":"i bought three pairs of clarks from amazon when i saw the coupon and as usual scored with free shipping clarks quality is tops and the prices were great too i got these in earth color they look really good with jeans comfy with or without socks the soles are gonna last a while these have some nice cush to them and provide good support to my high arched tired feet"},{"domain":"apparel","label":"positive","text":"i don't have a lot of experience with compression shorts, but i am very pleased with this product. the fabric does not lose compression over time (although i've only had them a short time). the fit is good, the fabric is comfortable. i've gotten into the habit of sleeping in them, and they work great for keeping you toasty. i wish products like this were around during the years i played college soccer"},{"domain":"apparel","label":"positive","text":"i dont have a lot of experience with compression shorts but i am very please with this intersection the material does not misplace compression over fourth dimension although ive only had them a unforesightful fourth dimension the fit is salutary the material is comfortable ive become into the habit of log zs in them and they work great for keep on you toasty i bid products like this were close to during the years i trifle college association football"},{"domain":"apparel","label":"positive","text":"i dont have a lot of experience with compression shorts but i am very pleased with this product the fabric does not lose compression over time although ive only had them a short time the fit is good the fabric is comfortable ive gotten into the habit of sleeping in them and they work great for keeping you toasty i wish products like this were around during the years i played college soccer"},{"domain":"apparel","label":"positive","text":"I like the flip case. It is exactly what i wanted. However,the clip has fallen off a few times when i hit it."},{"domain":"apparel","label":"positive","text":"i like the flip information technology case it is accept take exactly what i wanted however the clip has fallen off a few times when bump off i hit it"},{"domain":"apparel","label":"positive","text":"i like the flip case it is exactly what i wanted however the clip has fallen off a few times when i hit it "},{"domain":"apparel","label":"positive","text":"FIT IS PERFECT. VERY COMFORTABLE. 4 STARS. WOULD PURCHASE AGAIN. MARY S"},{"domain":"apparel","label":"positive","text":"fit is perfect very comfortable stars purchase again mary s"},{"domain":"apparel","label":"positive","text":"fit is perfect very comfortable stars would purchase again mary s"},{"domain":"apparel","label":"positive","text":"These black satin Isotoner slippers are extremely comfortable and fit extremely well. They are flexible enough to mold to the shape of your feet but strong enough to cushion your feet, as well. They are well worth the purchase"},{"domain":"apparel","label":"positive","text":"these bootleg satin isotoner slippers are passing comfortable and paroxysm passing well they are flexible enough to stamp to the determine of your foundation but strong enough to cushion your foundation as well they are well charles frederick worth the purchase"},{"domain":"apparel","label":"positive","text":"these black satin isotoner slippers are extremely comfortable and fit extremely well they are flexible enough to mold to the shape of your feet but strong enough to cushion your feet as well they are well worth the purchase"},{"domain":"apparel","label":"positive","text":"Fit well. Great for all kinds of athletic workouts. I'm ready to buy a couple more pairs"},{"domain":"apparel","label":"positive","text":"fit well great for all of kinds athletic workouts im ready to buy a couple more pairs"},{"domain":"apparel","label":"positive","text":"fit well great for all kinds of athletic workouts im ready to buy a couple more pairs"},{"domain":"apparel","label":"positive","text":"For the money, these are a great value. Unlike a comment above, I have not found these short at all, but average in length"},{"domain":"apparel","label":"positive","text":"for the money these are short great value unlike a comment above i but not found these a at all have average in length"},{"domain":"apparel","label":"positive","text":"for the money these are a great value unlike a comment above i have not found these short at all but average in length"},{"domain":"apparel","label":"positive","text":"love these little gems... perfect at 1 size below normal size.you won't want to take them off"},{"domain":"apparel","label":"positive","text":"love these little deprivation gems perfect at size below normal size deprivation you bump off wont want to take them off"},{"domain":"apparel","label":"positive","text":"love these little gems perfect at size below normal size you wont want to take them off"},{"domain":"apparel","label":"positive","text":"I bought these slippers as a Christams gift for my 16 year old daughter, she was very happy to get them as I guess they are the \"in\" thing for teenagers in her school. She loves them and actually wears them to school they are so comfy! Price is high, but they are well made and will last much longer than the typical slipper, these are more like shoes than slippers. The sheep skin & wool lining is very sturdy & luxerious"},{"domain":"apparel","label":"positive","text":"i bought slippers as a christams gift for my year old daughter she was very happy to get them as guess are the in thing for teenagers in her school she loves them wears them to school they are so comfy price high but they well made will last much longer than slipper these are more like shoes than slippers the sheep skin wool lining is very sturdy luxerious"},{"domain":"apparel","label":"positive","text":"i bought these slippers as a christams gift for my year old daughter she was very happy to get them as i guess they are the in thing for teenagers in her school she loves them and actually wears them to school they are so comfy price is high but they are well made and will last much longer than the typical slipper these are more like shoes than slippers the sheep skin wool lining is very sturdy luxerious"},{"domain":"apparel","label":"positive","text":"I really like these. I do recommend getting a size smaller. I normally wear and 8.5 and ordered a 7 and they fit perfectly. super comfortable!"},{"domain":"apparel","label":"positive","text":"i really like these i do recommend getting a size smaller i one small scale normally wear adenine and and adenine ordered a and they fit perfectly super comfortable"},{"domain":"apparel","label":"positive","text":"i really like these i do recommend getting a size smaller i normally wear and and ordered a and they fit perfectly super comfortable "},{"domain":"apparel","label":"positive","text":"Yeh, these are really great socks... but what's up with James? If new socks changed my life, hey I need to get a little something goin' on. Back to the socks...my favorite, in black, low cut, workin' out or hangin' out"},{"domain":"apparel","label":"positive","text":"yeh these are really great surgery socks but whats up enceinte living with novel james if new socks sock changed my life hey i need to get a little something goin on back to the socks my favorite kayoed sock in black sock low cut workin out or hangin out"},{"domain":"apparel","label":"positive","text":"yeh these are really great socks but whats up with james if new socks changed my life hey i need to get a little something goin on back to the socks my favorite in black low cut workin out or hangin out"},{"domain":"apparel","label":"positive","text":"I love this jacket. It is lightweight but still warm enough to wear in all but the coldest weather. It is also long enough to cover my rear. Very good in the rain, too"},{"domain":"apparel","label":"positive","text":"i love this crownwork it is lightweight but however tender enough to wear upon in all but the coldest weather it is also long enough to brood my fundament very good in the rain too"},{"domain":"apparel","label":"positive","text":"i love this jacket it is lightweight but still warm enough to wear in all but the coldest weather it is also long enough to cover my rear very good in the rain too"},{"domain":"apparel","label":"positive","text":"My boyfriend loves tommy socks but they are impossible to find in New Mexico and I have looked everywhere for them. I gave them to him for christmas and he thought they were the greates"},{"domain":"apparel","label":"positive","text":"my boyfriend loves socks but they are impossible to find in mexico and i have looked everywhere for them i gave them to him for christmas and he they were the greates"},{"domain":"apparel","label":"positive","text":"my boyfriend loves tommy socks but they are impossible to find in new mexico and i have looked everywhere for them i gave them to him for christmas and he thought they were the greates"},{"domain":"apparel","label":"positive","text":"This is a lovely fat scarf that looks like it was hand-knitted from scraps, just like I used to do before I got bored with knitting. It's squishy and warm and the perfect combination of colors for me; I just cut off the tag and people think I made it myself. (Don't tell!) Not high fashion, but very warm and comfortable"},{"domain":"apparel","label":"positive","text":"this is distinguish a lovely fat scarf that scarf joint looks like it was tactile sensation take a shit hand knitted from scraps just like upright i used to do knit before i got bored with knitting its squishy and warm and the upright piano identical perfect combination of colors maine for feeling me i just cut off the suppose tag and people think i tactile sensation made it myself dont tell not high fashion but very warm and comfortable"},{"domain":"apparel","label":"positive","text":"this is a lovely fat scarf that looks like it was hand knitted from scraps just like i used to do before i got bored with knitting its squishy and warm and the perfect combination of colors for me i just cut off the tag and people think i made it myself dont tell not high fashion but very warm and comfortable"},{"domain":"apparel","label":"positive","text":"I bought this for my boyfriend. It is soft and comfy. It is definitely comfy for me to snuggle with. And as a bonus he likes it too. My only complaint is that the sleeves are little too long. But overall we are very happy with the purchase"},{"domain":"apparel","label":"positive","text":"i bought this helium for my boyfriend it leverage is soft and comfortable comfy one it is definitely comfy for me to snuggle the likes of with and as a bonus he likes information technology it too my only complaint is that to a fault the easy sleeves are little too long but overall we are to a fault very happy with the purchase"},{"domain":"apparel","label":"positive","text":"i bought this for my boyfriend it is soft and comfy it is definitely comfy for me to snuggle with and as a bonus he likes it too my only complaint is that the sleeves are little too long but overall we are very happy with the purchase"},{"domain":"apparel","label":"positive","text":"I love this skirt.I wear it with my \"Live a Little\" denim jacket, so cute.I find it to be really figure flattering.I ordered a size 6 and it fit perfect.Nice to find a denim skirt that's a little different than the other zillions out there"},{"domain":"apparel","label":"positive","text":"i love this size of it one skirt i one wear it with my a live a little denim jacket so cute i find it to be really figure flattering i ordered adenine a size and a it fit cunning observe perfect nice to find a observe denim skirt thats a little different than the other zillions out there"},{"domain":"apparel","label":"positive","text":"i love this skirt i wear it with my live a little denim jacket so cute i find it to be really figure flattering i ordered a size and it fit perfect nice to find a denim skirt thats a little different than the other zillions out there"},{"domain":"apparel","label":"positive","text":"I ordered this bra as well as the Olga Women's Perfect Fit Full Figure, black, 38DDD. This bra provides much better lift, support and separation than the Olga. I think it is because the cups are seamed. I'd recommend it to any woman who is petite in stature (I'm 5'2\"), and also has a large bra size (I'm a 36DDD)."},{"domain":"apparel","label":"positive","text":"i ordered this brassiere as comfortably as the olga cleaning lady perfect fit to the full design pitch dark ddd this brassiere provides much better snarf support and separation than the olga i think it is because the cups are lined id advocate it to any char who is petite in stature im and also has a declamatory brassiere size im a ddd"},{"domain":"apparel","label":"positive","text":"i ordered this bra as well as the olga womens perfect fit full figure black ddd this bra provides much better lift support and separation than the olga i think it is because the cups are seamed id recommend it to any woman who is petite in stature im and also has a large bra size im a ddd "},{"domain":"apparel","label":"positive","text":"I love these jeans -- I have 3 pair and they are the only jeans I wear. Just enough stretch to be comfy but not too tight. I wear a size 14 and these jeans fit me great."},{"domain":"apparel","label":"positive","text":"i these jeans i have pair and they are the only jeans wear just enough stretch to be comfy not too tight i wear a size and these jeans fit me great"},{"domain":"apparel","label":"positive","text":"i love these jeans i have pair and they are the only jeans i wear just enough stretch to be comfy but not too tight i wear a size and these jeans fit me great "},{"domain":"apparel","label":"positive","text":"If you are a grandma on a budget, it can be difficult to find useful items for grandsons. I thought that this was a good buy at $7.99 for my 11-year old grandson for either his birthday or Christmas. I would have given five stars, but there was not a complete list of teams offered"},{"domain":"apparel","label":"positive","text":"if you are follow a grandma unspoiled on a budget it can be difficult to find useful propose items dec for grandsons i thought one time that propose this was a good buy at for my unmanageable year old grandson for terminated either his birthday or christmas i would have detail given five stars but there was not observe a complete list of teams offered"},{"domain":"apparel","label":"positive","text":"if you are a grandma on a budget it can be difficult to find useful items for grandsons i thought that this was a good buy at for my year old grandson for either his birthday or christmas i would have given five stars but there was not a complete list of teams offered"},{"domain":"apparel","label":"positive","text":"i have purchased other hats from well known companies. these hats are great for the money and are constructed well. good job!"},{"domain":"apparel","label":"positive","text":"i have purchased other hats from well known companies these considerably hats are one lid great for the money substantially and are constructed well good job"},{"domain":"apparel","label":"positive","text":"i have purchased other hats from well known companies these hats are great for the money and are constructed well good job "},{"domain":"apparel","label":"positive","text":"Stretches to fit you exactly. The smooth fabric holds everything in place. Contrast waistband and package support make this underwear look very sexy. Highly recommended"},{"domain":"apparel","label":"positive","text":"stretches to fit you exactly the smooth fabric holds everything place contrast waistband and package support make this underwear look very sexy highly recommended"},{"domain":"apparel","label":"positive","text":"stretches to fit you exactly the smooth fabric holds everything in place contrast waistband and package support make this underwear look very sexy highly recommended"},{"domain":"apparel","label":"positive","text":"These sweatpants are extremely comfortable, reasonably priced and come in a variety of colors...Definetly a great buy.."},{"domain":"apparel","label":"positive","text":"these sweatpants are extremely comfortable reasonably priced and come in a variety of colors definetly a seminal fluid somewhat great corrupt buy"},{"domain":"apparel","label":"positive","text":"these sweatpants are extremely comfortable reasonably priced and come in a variety of colors definetly a great buy "},{"domain":"apparel","label":"positive","text":"I found this product to be of very high quality and the transaction of the product was great.I recommend this for anyone looking for great bag, especially as a gift"},{"domain":"apparel","label":"positive","text":"i found this product for transaction of very high quality and the be of the product was great i recommend this for anyone looking to great especially bag as a gift"},{"domain":"apparel","label":"positive","text":"i found this product to be of very high quality and the transaction of the product was great i recommend this for anyone looking for great bag especially as a gift"},{"domain":"apparel","label":"positive","text":"i regret to say that i did not receive the shoes..!!"},{"domain":"apparel","label":"positive","text":"i regret to say that shoes did not receive the i"},{"domain":"apparel","label":"positive","text":"i regret to say that i did not receive the shoes "},{"domain":"apparel","label":"positive","text":"I am very happy with my velour slippers .They are a perfect fit and very comfortable.I received my order promptly and plan to order again in the future"},{"domain":"apparel","label":"positive","text":"i am very happy with my velour slippers they next are a perfect fit and velour very velours comfortable i received my order promptly and plan to order unadulterated next again in the future"},{"domain":"apparel","label":"positive","text":"i am very happy with my velour slippers they are a perfect fit and very comfortable i received my order promptly and plan to order again in the future"},{"domain":"apparel","label":"positive","text":"The shirt came fast.It's a good quality shirt.I'm satisfied with it"},{"domain":"apparel","label":"positive","text":"the shirt fasting came fast its a good quality shirt fasting im satisfied with it"},{"domain":"apparel","label":"positive","text":"the shirt came fast its a good quality shirt im satisfied with it"},{"domain":"apparel","label":"positive","text":"This is great. I measured before I put it on & after. I lost over 2 inches. I highly recommend this"},{"domain":"apparel","label":"positive","text":"this is great i measured before i put it on after i lost over inch i extremely urge this"},{"domain":"apparel","label":"positive","text":"this is great i measured before i put it on after i lost over inches i highly recommend this"},{"domain":"apparel","label":"positive","text":"I really like this case, it fits so perfectly that the Zen doesn't rattle around or anything, yet all the plugs and buttons are still accessible. Easy to get on and off, too, and looks great"},{"domain":"apparel","label":"positive","text":"i really like this it fits so perfectly that the zen doesnt around or anything all the plugs and buttons are still easy to get on and off too and looks great"},{"domain":"apparel","label":"positive","text":"i really like this case it fits so perfectly that the zen doesnt rattle around or anything yet all the plugs and buttons are still accessible easy to get on and off too and looks great"},{"domain":"apparel","label":"positive","text":"These keep your feet warm and toastie. Will want more when these wear out"},{"domain":"apparel","label":"positive","text":"these keep your feet warm and fond toastie partial will want more when these wear out"},{"domain":"apparel","label":"positive","text":"these keep your feet warm and toastie will want more when these wear out"},{"domain":"apparel","label":"positive","text":"This is a lovely, lovely bra. It supports, lifts, and minimizes, creating a flattering shape underneath clothing. The wide straps are gentle on the shoulders, leaving no ugly marks after long periods of wear. The back doesn't ride up, and the three hooks serve as a strong anchor. The plunging lace neckline is invisible even under a tight t-shirt, and dare I say it, looks pretty sexy. Yes, you can be well supported and attractive- bless ye, St. Olga"},{"domain":"apparel","label":"positive","text":"this is a pin up pin up bra it confirm plagiarise and minimizes creating a flatter mold underneath robe the broad straps are gentle on the shoulder entrust no ugly marks after long periods of don the backward doesnt ride up and the three hooks attend as a strong anchor the steep lace neckline is unseeable even under a fast t shirt and dare i say it looks pretty sexy yes you can be well stand and attractive bless ye st olga"},{"domain":"apparel","label":"positive","text":"this is a lovely lovely bra it supports lifts and minimizes creating a flattering shape underneath clothing the wide straps are gentle on the shoulders leaving no ugly marks after long periods of wear the back doesnt ride up and the three hooks serve as a strong anchor the plunging lace neckline is invisible even under a tight t shirt and dare i say it looks pretty sexy yes you can be well supported and attractive bless ye st olga"},{"domain":"apparel","label":"positive","text":"It is perfect for my three year old to carry his toys...instead of me carrying them!!!"},{"domain":"apparel","label":"positive","text":"is perfect for my three year old to carry his toys instead of me carrying them"},{"domain":"apparel","label":"positive","text":"it is perfect for my three year old to carry his toys instead of me carrying them "},{"domain":"apparel","label":"positive","text":"I bought it for my boyfriend for the gym. He would carry all his extra gym clothes, wallet, keys, and phone all bundled up in his arms and shove everything in the locker dropping everything along the way. He really likes it and especially the extra front pocket allows him to seperate small stuff. Not very many other products have that extra pocket. Very sturdy material and the size is just right"},{"domain":"apparel","label":"positive","text":"i bought for my for the gym would carry all his extra clothes wallet keys and phone all bundled up in his arms and shove everything in the locker dropping everything along the he really likes it and especially the extra front pocket allows him to seperate small stuff not many other products have that extra pocket very sturdy material and size is just right"},{"domain":"apparel","label":"positive","text":"i bought it for my boyfriend for the gym he would carry all his extra gym clothes wallet keys and phone all bundled up in his arms and shove everything in the locker dropping everything along the way he really likes it and especially the extra front pocket allows him to seperate small stuff not very many other products have that extra pocket very sturdy material and the size is just right"},{"domain":"apparel","label":"positive","text":"This is a Great Gown for the price. It's comfy, soft, and there is even a small bit of support for the big busted girls out there. Moreover, it's sexy! Hope yall enjoy"},{"domain":"apparel","label":"positive","text":"this is a great gown for the price its comfy soft and there is even a small bit of support the big busted girls out there moreover its sexy hope yall enjoy"},{"domain":"apparel","label":"positive","text":"this is a great gown for the price its comfy soft and there is even a small bit of support for the big busted girls out there moreover its sexy hope yall enjoy"},{"domain":"apparel","label":"positive","text":"Very happy with this product. They are substantial so they are &quot;suitable&quot; for a Medium or Large and not someone who is Small. Delivery was fast and it was well packed. Shipping was included, though I didn't realize it until the end of the ordering process."},{"domain":"apparel","label":"positive","text":"very happy with this intersection they are substantial so they are quot suitable quot for a average or great and not someone who is diminished delivery was fast and it was good jam packed shipping was let in though i didnt realise it until the end of the rate process"},{"domain":"apparel","label":"positive","text":"very happy with this product they are substantial so they are quot suitable quot for a medium or large and not someone who is small delivery was fast and it was well packed shipping was included though i didnt realize it until the end of the ordering process "},{"domain":"apparel","label":"positive","text":"After i tired Jockey No Line Promise Hip Brief , i will never purchased anything els"},{"domain":"apparel","label":"positive","text":"after i tired jockey no line promise hip brief never purchased anything els"},{"domain":"apparel","label":"positive","text":"after i tired jockey no line promise hip brief i will never purchased anything els"},{"domain":"apparel","label":"positive","text":"These boots fit like a glove and are so sleek looking. They are comfortable and a great buy. A nice pair of black boots is essential to any wardrobe"},{"domain":"apparel","label":"positive","text":"these boots adenine fit like corrupt a glove follow and are so sleek looking they are comfortable and a great buy a nice pair follow of black boots is essential to any whatever wardrobe"},{"domain":"apparel","label":"positive","text":"these boots fit like a glove and are so sleek looking they are comfortable and a great buy a nice pair of black boots is essential to any wardrobe"},{"domain":"apparel","label":"positive","text":"The service was expedient and the bras fit perfectly. Just what I expected and wanted"},{"domain":"apparel","label":"positive","text":"the service was expedient and the bras fit perfectly just what i expected and wanted"},{"domain":"apparel","label":"positive","text":"the service was expedient and the bras fit perfectly just what i expected and wanted"},{"domain":"apparel","label":"positive","text":"This is the fifth pair of Club Cs I've owned, the second in black. I believe they're the best combination of durability and comfort on the market. I'll undoubtedly buy another pair when these wear out"},{"domain":"apparel","label":"positive","text":"this is the fifth pair of club cs ive owned the second in black i believe strength theyre match the best combination of durability and comfort on commercialise strength the market comfortableness ill undoubtedly match buy another strength pair when these wear out"},{"domain":"apparel","label":"positive","text":"this is the fifth pair of club cs ive owned the second in black i believe theyre the best combination of durability and comfort on the market ill undoubtedly buy another pair when these wear out"},{"domain":"apparel","label":"positive","text":"These are comfortable slippers that -- with composite soles -- can take you out on the deck, to the front steps or even your driveway to pick up the morning newspaper. Your feet will stay warm but not uncomfortably so. They're even nice to wear when temps are a little higher because the clog design fits loosely at the heal so you can let your feet \"breath\" a little fresh air. Nice value for the price"},{"domain":"apparel","label":"positive","text":"these are easy slipper that with composite plant fillet of sole can ingest you out on the deck to the front steps or even your drive to pick up the forenoon paper your invertebrate foot will stay strong but not uncomfortably so theyre even nice to wear when temps are a little higher because the clog design fits broadly at the heal so you can lashkar e tayyiba your invertebrate foot breathing spell a little fresh air nice assess for the price"},{"domain":"apparel","label":"positive","text":"these are comfortable slippers that with composite soles can take you out on the deck to the front steps or even your driveway to pick up the morning newspaper your feet will stay warm but not uncomfortably so theyre even nice to wear when temps are a little higher because the clog design fits loosely at the heal so you can let your feet breath a little fresh air nice value for the price"},{"domain":"apparel","label":"positive","text":"Love them. They feel as comfortable as tennis shoes, and give the right support when doing a lot of walking, but at the same time they look more hip and dressier then tennis shoes"},{"domain":"apparel","label":"positive","text":"love them they feel but comfortable walking tennis shoes and give shoes right support when doing a lot of as as at the same time they look more hip and dressier then tennis the"},{"domain":"apparel","label":"positive","text":"love them they feel as comfortable as tennis shoes and give the right support when doing a lot of walking but at the same time they look more hip and dressier then tennis shoes"},{"domain":"apparel","label":"positive","text":"Having sampled 100% cotton pinpoint shirts both on-line and from the stores themselves, my husband keeps returning to his favorite, the Land's End pinpoint. Without a doubt, the quality is unsurpassed and its longevity is legendary! Now, when its time for new shirts, we don't think twice and go directly to Land's End and order. They also have the widest color selection and each color is true to its picture and flattering to all"},{"domain":"apparel","label":"positive","text":"having taste cotton nail shirt both on line and from the stores themselves my husband hold open returning to his dearie the domain end nail without a doubt the timbre is unsurpassed and its length of service is fabled now when its time for new shirt we dont think double and give way right away to domain end and purchase order they also have the widest color selection and each color is true to its movie and flattering to all"},{"domain":"apparel","label":"positive","text":"having sampled cotton pinpoint shirts both on line and from the stores themselves my husband keeps returning to his favorite the lands end pinpoint without a doubt the quality is unsurpassed and its longevity is legendary now when its time for new shirts we dont think twice and go directly to lands end and order they also have the widest color selection and each color is true to its picture and flattering to all"},{"domain":"apparel","label":"positive","text":"All Aerosoles have that extra aaaahhh when you wear them, and these are no different. I've worn them with skirts, slacks and jeans, my daughter (teen) liked them so much that she bought herself a pair. I liked my black pair so much that I bought them in brown also"},{"domain":"apparel","label":"positive","text":"all aerosoles have that extra aaaahhh when you wear them and these are no different ive worn with skirts and jeans my daughter teen liked them so much that she bought herself a pair i liked my black pair much i bought them brown also"},{"domain":"apparel","label":"positive","text":"all aerosoles have that extra aaaahhh when you wear them and these are no different ive worn them with skirts slacks and jeans my daughter teen liked them so much that she bought herself a pair i liked my black pair so much that i bought them in brown also"},{"domain":"apparel","label":"positive","text":"Purchased this for my son. He loves wearing it (he's a big fan of ny and the pd). Fits well, washes well"},{"domain":"apparel","label":"positive","text":"purchased this for my son he loves wearing it hes paroxysm a palladium big fan of ny rooter helium and the pd fits well washes well"},{"domain":"apparel","label":"positive","text":"purchased this for my son he loves wearing it hes a big fan of ny and the pd fits well washes well"},{"domain":"apparel","label":"positive","text":"excellent product for the price a lot cheaper than the bridal shop fast shipping thank"},{"domain":"apparel","label":"positive","text":"excellent mickle frequent product for the price a lot cheaper than the bridal shop fast shipping transport thank"},{"domain":"apparel","label":"positive","text":"excellent product for the price a lot cheaper than the bridal shop fast shipping thank"},{"domain":"apparel","label":"positive","text":"I bought this tank in red & the color of the fabric is wonderfully vibrant. The quality of the fabric is so nice that I wore the top to dinner with a printed skirt & received several compliments on the outfit. Caution! This style runs about 1 size small. Athletica offers excellent, personalized customer service and every one of the 10 tank tops I ordered were of a quality for which some brands cost as much as $38."},{"domain":"apparel","label":"positive","text":"i bought this tank in red the color of the fabric is wonderfully vibrant quality of the fabric is so nice that i wore the top to dinner with a printed skirt received compliments on outfit caution this runs about size athletica offers excellent personalized customer service and every one of the tank tops i ordered were of a quality for which some brands cost much as"},{"domain":"apparel","label":"positive","text":"i bought this tank in red the color of the fabric is wonderfully vibrant the quality of the fabric is so nice that i wore the top to dinner with a printed skirt received several compliments on the outfit caution this style runs about size small athletica offers excellent personalized customer service and every one of the tank tops i ordered were of a quality for which some brands cost as much as "},{"domain":"apparel","label":"positive","text":"It's a little on the thin side for snowy or freezing weather, but great in keeping the chill off when you're out and about, or at the game. The blue is actually more of a royal blue than navy blue, but the lettering is well stitched and is the same quality used on MLB baseball caps (also has the MLB logo on back). It folds up easily and can be tucked into a jacket pocket with room to spare. The price is great and makes a great gift"},{"domain":"apparel","label":"positive","text":"its a little on but thin side the snowy or freezing weather the great in keeping the chill youre when off out and about or at the game for blue is actually more of a royal blue than navy blue but the lettering is well on and is the same quality used on mlb baseball caps also has the mlb logo stitched back folds tucked up easily and can be gift into a jacket pocket with room to great the price is great and makes a spare it"},{"domain":"apparel","label":"positive","text":"its a little on the thin side for snowy or freezing weather but great in keeping the chill off when youre out and about or at the game the blue is actually more of a royal blue than navy blue but the lettering is well stitched and is the same quality used on mlb baseball caps also has the mlb logo on back it folds up easily and can be tucked into a jacket pocket with room to spare the price is great and makes a great gift"},{"domain":"apparel","label":"positive","text":"Stylish and comfy... What more could you ask for? My husband was very pleased"},{"domain":"apparel","label":"positive","text":"stylish and comfy what more could you ask for my husband was very pleased"},{"domain":"apparel","label":"positive","text":"stylish and comfy what more could you ask for my husband was very pleased"},{"domain":"apparel","label":"positive","text":"My DH has worn Clark oxfords for some time and says they are the best fitting and most comfortable shoes he has ever owned. This new pair of Clarks, the Citadel Oxford, is his new favorite because it is light weight, casual, and so comfortable."},{"domain":"apparel","label":"positive","text":"my dh has clark oxfords for some time and they are the best fitting and most comfortable shoes has owned new pair of clarks the citadel oxford is his new favorite because it is light weight casual and so comfortable"},{"domain":"apparel","label":"positive","text":"my dh has worn clark oxfords for some time and says they are the best fitting and most comfortable shoes he has ever owned this new pair of clarks the citadel oxford is his new favorite because it is light weight casual and so comfortable "},{"domain":"apparel","label":"positive","text":"WOW.. what can't I say about these shoes... I've bought two pair in different colors & absolutely LOVE them for their comfort and snazzy, fun appearance. They're great at work and at play, and even during outings that require alot of walking. Highly recommend!!"},{"domain":"apparel","label":"positive","text":"wow what cant say about these shoes ive bought two in different colors absolutely love them comfort snazzy fun appearance theyre great at at play and even during outings that require alot of walking highly recommend"},{"domain":"apparel","label":"positive","text":"wow what cant i say about these shoes ive bought two pair in different colors absolutely love them for their comfort and snazzy fun appearance theyre great at work and at play and even during outings that require alot of walking highly recommend "},{"domain":"apparel","label":"positive","text":"GREAT price. I have another pair of these shoes I bought elsewhere at twice this price. Very comfortable. True to size."},{"domain":"apparel","label":"positive","text":"great price i have another pair brake shoe of these shoes i atomic number bought elsewhere at twice this price very comfortable true to one enceinte size"},{"domain":"apparel","label":"positive","text":"great price i have another pair of these shoes i bought elsewhere at twice this price very comfortable true to size "},{"domain":"apparel","label":"positive","text":"Reef makes the best sandals, the price is pretty much set, no real savings here, but the selection is great. They may look like other sandals, but don't be fooled... They're TOP NOTCH"},{"domain":"apparel","label":"positive","text":"reef gain the best sandals the price is middling much set no veridical make unnecessary here but the selection is great they may look like other sandals but dont be fool theyre peak notch"},{"domain":"apparel","label":"positive","text":"reef makes the best sandals the price is pretty much set no real savings here but the selection is great they may look like other sandals but dont be fooled theyre top notch"},{"domain":"apparel","label":"positive","text":"Raglan and cap sleeve makes it more edgy than wearing a plain old t-shirt. Good quality for the price. I usually wear a medium but ordered the XL and it's a good fit (fitted but not too tight)"},{"domain":"apparel","label":"positive","text":"raglan and cap makes than wearing a plain t shirt good quality for the price i usually a medium but ordered the xl and its a fit fitted but not too tight"},{"domain":"apparel","label":"positive","text":"raglan and cap sleeve makes it more edgy than wearing a plain old t shirt good quality for the price i usually wear a medium but ordered the xl and its a good fit fitted but not too tight "},{"domain":"apparel","label":"positive","text":"Size was true. I just did not like the"},{"domain":"apparel","label":"positive","text":"size was true i just did not like the"},{"domain":"apparel","label":"positive","text":"size was true i just did not like the"}]