[{"domain":"apparel","label":"positive","text":"GOOD LOOKING KICKS IF YOUR KICKIN IT OLD SCHOOL LIKE ME. AND COMFORTABLE. AND RELATIVELY CHEAP. I'LL ALWAYS KEEP A PAIR OF STAN SMITH'S AROUND FOR WEEKENDS"},{"domain":"apparel","label":"positive","text":"GOOD LOOKING KICKS IF YOUR KICKIN IT OLD SCHOOL LIKE ME. AND COMFORTABLE. AND RELATIVELY BUGS TO A"},{"domain":"apparel","label":"positive","text":"These sunglasses are all right. They were a little crooked, but still cool.."},{"domain":"apparel","label":"positive","text":"These sunglasses are all right. They were a little crooked, but still. They still look nice, but they'd"},{"domain":"apparel","label":"positive","text":"I don't see the difference between these bodysuits and the more expensive ones. Fits my boy just right"},{"domain":"apparel","label":"positive","text":"I don't see the difference between these bodysuits and the more expensive ones. These aren't like the black bod"},{"domain":"apparel","label":"positive","text":"Very nice basic clothing. I think the size is fine. I really like being able to find these shades of green, though I have decided the lighter shade is really a feminine color. This is the only brand that I can find these muted greens"},{"domain":"apparel","label":"positive","text":"Very nice basic clothing. I think the size is fine. I really like being able to find these shades of green, though I have decided the lighter shade is really a feminine color. This is the only way I know you can make something from the top down so I"},{"domain":"apparel","label":"positive","text":"I love these socks. They fit great (my 15 month old daughter has thick ankles) and she can zoom around on the kitchen floor and not take a nose dive into things. :"},{"domain":"apparel","label":"positive","text":"I love these socks. They fit great (my 15 month old daughter has thick ankles) and she can zoom around on the kitchen floor and not take a nose dive into a sock. These socks are so simple and simple to pair it is amazing. And"},{"domain":"apparel","label":"positive","text":"Finally I have found a quality brand of swimsuit I can order on line and know it will fit. I'm a daily swimmer who is long-bodied. This particular style fit great when it arrived; it arrived quickly within four days; shipping was free; and the lycra material is the most resilient I know given the chlorine bashing my suits get. Please continue to sell this particular item at a price lower than the sports stores. Thanks!!"},{"domain":"apparel","label":"positive","text":"Finally I have found a quality brand of swimsuit I can order on line and know it will fit. I'm a daily swimmer who is long-bodied. This particular style fit great when it arrived; it arrived quickly within four days; shipping was free; and the lycra material is the most resilient I know given the chlorine bashing my suits get. Please continue to"},{"domain":"apparel","label":"positive","text":"Your company was a pleasure to work with- thanks! I will enjoy wearing the swimsuit that I ordered"},{"domain":"apparel","label":"positive","text":"Your company was a pleasure to work with- thanks! I think we're going to start to hear some better and more authentic music when"},{"domain":"apparel","label":"positive","text":"very portable. great picture. easy to operate. all the accessories you need. great sound. playes dvd's from sony camcorder. very happy with the system. am looking forward to using this camping and on vacation."},{"domain":"apparel","label":"positive","text":"very portable. great picture. easy to operate. all the accessories you need. great sound. playes dvd's from back to front so you have multiple movies"},{"domain":"apparel","label":"positive","text":"The quality is much better than expected. I bought one for myself and one for my husband prior to our Las Vegas trip Sept. 6, 2005. We were able to walk with or hands free because these fannypacks held all of the necessities, our cell phones, travelers checks, keys, and medicines in particular. We love the spacious divided compartments. I highly reccommend this product.."},{"domain":"apparel","label":"positive","text":"The quality is much better than expected. I bought one for myself and one for my husband prior to our Las Vegas trip Sept. 6, 2005. We were able to walk with or hands free because these fannypacks held all of the necessities, our cell phones, travelers checks, keys, and medicines in particular. We love the spacious divided compartments. The space, however,"},{"domain":"apparel","label":"positive","text":"Nice shirt. Well made. Good price. What more can I say"},{"domain":"apparel","label":"positive","text":"Nice shirt. Well made. Good shirt. Good shirt. Good tee. But the problem is, with all"},{"domain":"apparel","label":"positive","text":"The shirts are what I had asked for. They are sturdy and well made. I would buy more if I needed more. Well worth the money spen"},{"domain":"apparel","label":"positive","text":"The shirts are what I had asked for. They are sturdy and well made. I would buy this shirt for any friend or family member because they look"},{"domain":"apparel","label":"positive","text":"I love wearing those tank tops with shelf bras or summer dresses that can't be worn with a bra...but the nipple issue was quite vexing. I didn't feel comfortable with any nip protrusion...the only disadvantage in having implants is that they tend to be a bit nipply. But, problem solved. These things rock"},{"domain":"apparel","label":"positive","text":"I love wearing those tank tops with shelf bras or summer dresses that can't be worn with a bra...but the nipple issue was quite vexing. I didn't feel comfortable with any nip protrusion...the only disadvantage in having implants is that they tend to be large"},{"domain":"apparel","label":"positive","text":"I was having a hard time finding a cheaper swim suit so I just ordered one from the grab bag. I figured nothing could be worse than my plain black swim suit. Also the swim suit was delivered in half the time that it was expected"},{"domain":"apparel","label":"positive","text":"I was having a hard time finding a cheaper swim suit so I just ordered one from the grab bag. I figured nothing could be worse than my plain black swim suit. Also, it is a bit bulky, my"},{"domain":"apparel","label":"positive","text":"It's golden color is very remarkable ..It looks like real gold..wonderful piece to have"},{"domain":"apparel","label":"positive","text":"It's golden color is very remarkable ..It's black, so the blue is on"},{"domain":"apparel","label":"positive","text":"With a good selection of colors to go with the casual style, to say I love these shoes is an understatement. They are very comfortable, and have grown on me so much, they are about the only casual style shoes I have bought in the past few years"},{"domain":"apparel","label":"positive","text":"With a good selection of colors to go with the casual style, to say I love these shoes is an understatement. They are very comfortable, and have grown on me so much, they are about the only casual style shoes I have bought in the last month that can be worn and worn with the same quality as"},{"domain":"apparel","label":"positive","text":"A difficult item to find in department stores. Found some at twice the price in a leather goods store. The Fossil leather key cases were of equal quality. I purchased two and am very satisfied"},{"domain":"apparel","label":"positive","text":"A difficult item to find in department stores. Found some at twice the price in a leather box at Walmart.\n\nThe key difference is in the price point."},{"domain":"apparel","label":"positive","text":"The quality is much better than expected. I bought one for myself and one for my husband prior to our Las Vegas trip Sept. 6, 2005. We were able to walk with or hands free because these fannypacks held all of the necessities, our cell phones, travelers checks, keys, and medicines in particular. We love the spacious divided compartments. I highly reccommend this product.."},{"domain":"apparel","label":"positive","text":"The quality is much better than expected. I bought one for myself and one for my husband prior to our Las Vegas trip Sept. 6, 2005. We were able to walk with or hands free because these fannypacks held all of the necessities, our cellphones were still not working and my brother"},{"domain":"apparel","label":"positive","text":"The collar stays are great! They came in a convenient little container, and now I'm not searching all over the laundry room floor for the collar stays that fell out of my husband's dress shirts. The different lengths were helpful because he has different style shirts, and the collar stays came very quickly"},{"domain":"apparel","label":"positive","text":"The collar stays are great! They came in a convenient little container, and now I'm not searching all over the laundry room floor for the collar stays that fell out of my husband's dress shirts. The different lengths were helpful because he has different style shirts, and the collar stays I got were"},{"domain":"apparel","label":"positive","text":"Okay, this cap is really stylish. But I think the sewing isn't quite finished. There were loose threads all over my caps when I got them. Not to mention the parts that weren't even sewed... no threads at all"},{"domain":"apparel","label":"positive","text":"Okay, this cap is really stylish. But I think the sewing isn't quite finished. There were loose threads all over my caps when I got them. Not to mention the parts that weren't even sewed...\n\nI also think"},{"domain":"apparel","label":"positive","text":"I bought some of these to wear with a drapey shirt cut open nearly to the waist, and these little covers made me feel way more confident that even if my shirt slipped a little, nobody would be able to see anything. The nude ones were practically the same color as my skin, so they were perfect. They also stopped any embarrasing reactions to the cold. The best part was, they didn't feel weird at all"},{"domain":"apparel","label":"positive","text":"I bought some of these to wear with a drapey shirt cut open nearly to the waist, and these little covers made me feel way more confident that even if my shirt slipped a little, nobody would be able to see anything. The nude ones were practically the same color as my skin, so they were perfect. They also stopped any embarrasing reactions to the cold. And I got my hands on this"},{"domain":"apparel","label":"positive","text":"These are some really good glasses. Plenty dark, full mirrored so you won't be caught checkin out all the ladies you walk by. Shoot, for $18 you can't go wrong. I highly recommend them. And since I'm a pilot, it was obvious that I got a pair of these"},{"domain":"apparel","label":"positive","text":"These are some really good glasses. Plenty dark, full mirrored so you won't be caught checkin out all the ladies you walk by. Shoot, for $18 you can't go wrong. I highly recommend them. And since I'm a pilot, it was my"},{"domain":"apparel","label":"positive","text":"I found these at Lane Bryant and I absolutely love them! I wear them under my work clothes every day. You've got to try them"},{"domain":"apparel","label":"positive","text":"I found these at Lane Bryant and I absolutely love them! I wear them under my work shirt to work on the computer or work on some other kind"},{"domain":"apparel","label":"positive","text":"I got this handbag for my 14th birthday and I looove it so much!!It is so perfect, the best chanel handbag there is. Everyone that saw my new handbag loved it and asked where I bought. I actually bought it at nordstrom. Everyone should have one!!BUY IT"},{"domain":"apparel","label":"positive","text":"I got this handbag for my 14th birthday and I looove it so much!!It is so perfect, the best chanel handbag there is. Everyone that saw my new handbag loved it and asked where I bought. I actually bought it at nordstrom. Everyone should see"},{"domain":"apparel","label":"positive","text":"I can only ditto what the other 5-star reviewers have already said. I have 1 of the 41\" for summer and now 2 of the 50\" for fall and winter. The colors remain solid after mutiple washes, and the price is great for the quality of these sleep shirts. Also very comfortable. Highly recommend! ngmackie, Dunwoody, GA"},{"domain":"apparel","label":"positive","text":"I can only ditto what the other 5-star reviewers have already said. I have 1 of the 41\" for summer and now 2 of the 50\" for fall and winter. The colors remain solid after mutiple washes, and the price is great for the quality of these sleep shirts. Also very comfortable. The only thing I regret"},{"domain":"apparel","label":"positive","text":"must have shoe for bunion and hammertoe sufferers. i also have very hot sweaty feet and these are an excellent choice if you share these problems. very large toe box and excellent webbing for ventilation. very good looking comfortable shoes . only qualification is that if you stand on your feet all day or do a lot of walking you may want to pick a shoe with more support --these are very lightweight shoes but lack the support a heavier athletic shoe would offer-- but those type of shoes are usually harder on bunions and my feet get extremely hot in them"},{"domain":"apparel","label":"positive","text":"must have shoe for bunion and hammertoe sufferers. i also have very hot sweaty feet and these are an excellent choice if you share these problems. very large toe box and excellent webbing for ventilation. very good looking comfortable shoes . only qualification is that if you stand on your feet all day or do a lot of walking you may want to pick a shoe with more support for your foot"},{"domain":"apparel","label":"positive","text":"My mother is an avid world traveler and is quite particular about how she travels. So, I bought her the cabin cuddler for her birthday and she loves it! And I quote \"It is practical and functional and makes a huge difference (re: comfort) for those long international flights.\" Big hit!"},{"domain":"apparel","label":"positive","text":"My mother is an avid world traveler and is quite particular about how she travels. So, I bought her the cabin cuddler for her birthday and she loves it! And I quote \"It is practical and functional and the bedding is perfect for a happy couple\".\n\n"},{"domain":"apparel","label":"positive","text":"I bought this scarf with a gift certificate I received for Christmas. I love it so much and my kids love it so much they are buying their own. It is super-warm and retains it shape, even after my nine year old tried it on as a dress"},{"domain":"apparel","label":"positive","text":"I bought this scarf with a gift certificate I received for Christmas. I love it so much and my kids love it so much they are buying their own. It is super-warm and retains it shape, even after my nine year old tried it. I will not hesitate to"},{"domain":"apparel","label":"positive","text":"Dont buy it from Andrew Christian, i wrote them online several times and never, not once, got an answer from them, i ended up buying them some other place"},{"domain":"apparel","label":"positive","text":"Dont buy it from Andrew Christian, i wrote them online several times and never, not once, was that he did not know about the lawsuit or anything like that.\n\n"},{"domain":"apparel","label":"positive","text":"Clever and stylish design; a lot of colors to choose from; and an excellent performance, best sport shoe eve"},{"domain":"apparel","label":"positive","text":"Clever and stylish design; a lot of colors to choose from; and an aesthetic that can rival everything else, even"},{"domain":"apparel","label":"positive","text":"Awesome shoes. Not necessarily worth the outlandish cost but 4 stars nonetheless. I'd recommend them to anyone who takes running seriously, and who likes to look even cooler when doing it."},{"domain":"apparel","label":"positive","text":"Awesome shoes. Not necessarily worth the outlandish cost but 4 stars nonetheless. I'd recommend them to anyone who takes running seriously, and who likes to run well.\n\nRated 5 out of 5 by RONNY"},{"domain":"apparel","label":"positive","text":"This is a top quality item. I is an 80%\/20% cotton\/poly mix-double stitched seams...very well made. I bought a 2X for my son who ususally wears a 3X, and after putting it through the washer and dryer twice, it's just as perfect as the day it was delivered."},{"domain":"apparel","label":"positive","text":"This is a top quality item. I is an 80%\/20% cotton\/poly mix-double stitched seams...very well made. I bought a 2X for my son who ususally wears a 3X, and after putting it through the washer and dryer I"},{"domain":"apparel","label":"positive","text":"These shoes are awesome, I have bowled with them for the past couple of weeks and they are just what I was looking for. The color is hot and everyone on my league noticed them and said very positive things about them. Thanks for the super fast shipping and supurb quailty"},{"domain":"apparel","label":"positive","text":"These shoes are awesome, I have bowled with them for the past couple of weeks and they are just what I was looking for. The color is hot and everyone on my league noticed them and said very positive things about them. Thanks for the super great shoes, I can definitely use them in"},{"domain":"apparel","label":"positive","text":"My husband loves this coat. He wears it all winter. If you are someone that doesnt like a bulky exceptionally warm lined coat this is it. He is uncomfortable in something like down because it is too sweaty but this is perfect. Warm enough and lightweight and comfortable. THis is the second one he has purchased."},{"domain":"apparel","label":"positive","text":"My husband loves this coat. He wears it all winter. If you are someone that doesnt like a bulky exceptionally warm lined coat this is it. He is uncomfortable in something like down because it is too small and he would love it for his snow covered cottage"},{"domain":"apparel","label":"positive","text":"I have been using this for awhile now. Unlike some sports bras that are this supportive, it's a lighter weight material\/construction. I wouldn't say that there probably isn't something better out there and it isn't cheap - but it's not bad. For my peers that have this 'issue', you know what I'm talking about!:"},{"domain":"apparel","label":"positive","text":"I have been using this for awhile now. Unlike some sports bras that are this supportive, it's a lighter weight material\/construction. I wouldn't say that there probably isn't something better out there and it isn't cheap - but it's not bad. For my peers that is. The fact that"},{"domain":"apparel","label":"positive","text":"Before this bra, I would have to wear an underwire bra, and a sports bra on top to minimize bounce. My cup size is F, so it's been difficult to find a sports bra that I can wear standalone. Well folks, I found it. THIS IS THE BRA!! I wore it while doing turbo jam today and it was AMAZING! It did better than the two bra combination ever did. If you're looking for a sports bra that actually WORKS, this is the one"},{"domain":"apparel","label":"positive","text":"Before this bra, I would have to wear an underwire bra, and a sports bra on top to minimize bounce. My cup size is F, so it's been difficult to find a sports bra that I can wear standalone. Well folks, I found it. THIS IS THE BRA!! I wore it while doing turbo jam today and it was AMAZING! It did better than the two bra combination ever did. If you're looking for a"},{"domain":"apparel","label":"positive","text":"I got the flip flops for my granddaughter for christmas she wore her cheap ones out from wal-mart and her mother told her white is summer only and no one could find white ones right now I told her I bet her I could and so I did and she loves them and so did all her friends at school. we know it is winter but so far in indiana it is not bad so you can wear flip flops and tanks for now. thank you for the great gift."},{"domain":"apparel","label":"positive","text":"I got the flip flops for my granddaughter for christmas she wore her cheap ones out from wal-mart and her mother told her white is summer only and no one could find white ones right now I told her I bet her I could and so I did and she loves them and so did all her friends at school. we know it is winter but so far in indiana it is not bad so you can wear flip flops and tanks for your family"},{"domain":"apparel","label":"positive","text":"This is just the thing to put away for a Christmas gift. Nice product in a nice box, tied with a bow."},{"domain":"apparel","label":"positive","text":"This is just the thing to put away for a Christmas gift. Nice product in a nice box, no one has a problem buying it.\n\nRated"},{"domain":"apparel","label":"positive","text":"The sheets were just as described and worth the price. Timely on shippng also. Very pleased"},{"domain":"apparel","label":"positive","text":"The sheets were just as described and worth the price. Timely on shippng also.\n\nFinnish version\n\nMy main take"},{"domain":"apparel","label":"positive","text":"The Crib sheets were soft, the service fast and they fit the Pack and Play mattress"},{"domain":"apparel","label":"positive","text":"The Crib sheets were soft, the service fast and they would come out very nicely to begin with. However, there's"},{"domain":"apparel","label":"positive","text":"This sheet is great solution for difficult to change crib sheets- just lay it over the top of your pretty sheet and snap it to the crib frame. I highly recommend it to those who don't like wrestling the crib sheet onto the mattress"},{"domain":"apparel","label":"positive","text":"This sheet is great solution for difficult to change crib sheets- just lay it over the top of your pretty sheet and snap it to the crib frame. I highly recommend it to those who don't like wrestling the cribs around, or would like to learn how to adjust the head position when they"},{"domain":"apparel","label":"positive","text":"Service was very quick, and they were having a free shipping special, so it was very well priced"},{"domain":"apparel","label":"positive","text":"Service was very quick, and they were having a free shipping special, so it was in time.\n\nThere will be"},{"domain":"apparel","label":"positive","text":"Ordered these bra extenders since I an pregnant and now having trouble fitting into things, and they are working great! Recevied them very quickly and they are exactly as I expected! Thanks!"},{"domain":"apparel","label":"positive","text":"Ordered these bra extenders since I an pregnant and now having trouble fitting into things, and they are working great! Recevied them very quickly and they are exactly as I think that I would order and love them as well.\n\nRated"},{"domain":"apparel","label":"positive","text":"I never buy stuff like this on line. I like to play with\/feel wallets before getting them. But I couldn't find a thin, bi-fold that I liked, so I took a chance.It's great. The ID feature is super handy (it comes all the way out if you're wondering). And the brown leather is soft and nice. It is really nice for the price.(By the way, personally, I don't think it's thick at all)"},{"domain":"apparel","label":"positive","text":"I never buy stuff like this on line. I like to play with\/feel wallets before getting them. But I couldn't find a thin, bi-fold that I liked, so I took a chance.It's great. The ID feature is super handy (it comes all the way out if you're wondering). And the brown leather is soft and nice. It is really nice for the price.(By the way, personally, I don't know"},{"domain":"apparel","label":"positive","text":"The shoes are better then expected.. Everyone comments on how nice they are and where did you get them.. I will let anyone know to buy the"},{"domain":"apparel","label":"positive","text":"The shoes are better then expected.. Everyone comments on how nice they are and where did you get them.. I will let anyone know to tell me how much I appreciate the size of my"},{"domain":"apparel","label":"positive","text":"I'm very satisfied with this purchase. The jeans are great quality for the price. However, it was not stated that they would be the (very)long length that they were. I had to alter them, which was an inconvenience"},{"domain":"apparel","label":"positive","text":"I'm very satisfied with this purchase. The jeans are great quality for the price. However, it was not stated that they would be the (very)long length that they were. I had to alter them, which I hope will be covered in this"},{"domain":"apparel","label":"positive","text":"Love these boxers. I stole a pair from a friend a while back and had to have a pair of my own. Love the fabric and the cut, not too long not too short, and just the right amount of butt room."},{"domain":"apparel","label":"positive","text":"Love these boxers. I stole a pair from a friend a while back and had to have a pair of my own. Love the fabric and the cut, not too long not too long and a little too slim for this lady. I'm"},{"domain":"apparel","label":"positive","text":"I highly reccommend this bag for anyone! It is a big tote, which is perfect for a college campus, the airport, the beach... really for any purpose. It is reversable and I was very suprised at how durable it is (great quality). When people compliment the bag it allows an opportunity to share its cause- which in the end is the most important part."},{"domain":"apparel","label":"positive","text":"I highly reccommend this bag for anyone! It is a big tote, which is perfect for a college campus, the airport, the beach... really for any purpose. It is reversable and I was able to use it on anything"},{"domain":"apparel","label":"positive","text":"I have used this mat almost everytime I've been outdoors. I haven't seen anything like it at any department store and its much cheaper than the mats at the beachside boutiques. It is an awesome value for the price."},{"domain":"apparel","label":"positive","text":"I have used this mat almost everytime I've been outdoors. I haven't seen anything like it at any department store other than the one that sells the one on sale"},{"domain":"apparel","label":"positive","text":"THEY CALL THEIR SOCKS THE \"WORLDS SOFTEST MEN'S CLASSIC CREW SOCK\" AND LET ME TELL YOU ITS THE TRUTH. BEEN LOOKING FOR A PAIR OF RED SOCKS FOR WEEKS, WITH OUT SUCCESS. THEY MAY NOT BE THE SHADE OF RED I WANTED BUT THEY ARE THE BEST IN FIT AND QUALITY. NOW FIND ME THE \"RED SHADE\" I'M LOOKING FOR AND I'LL BE EVEN MORE PLEASED. Norb Reynders.......yes over 13... going on 7"},{"domain":"apparel","label":"positive","text":"THEY CALL THEIR SOCKS THE \"WORLDS SOFTEST MEN'S CLASSIC CREW SOCK\" AND LET ME TELL YOU ITS THE TRUTH. BEEN LOOKING FOR A PAIR OF RED SOCKS FOR WEEKS, WITH OUT SUCCESS. THEY MAY NOT BE THE SHADE OF RED I WANTED BUT THEY ARE THE BEST IN FIT AND QUALITY. NOW FIND ME THE \"RED SHADE\" I'M LOOKING FOR AND I"},{"domain":"apparel","label":"positive","text":"Nice, soft leatherette. The inside is roomy, and the pic is fairly accurate for the size to body ratio. The tie-front detail stays so, you don't have to worry about it unraveling or loosening. Nice silver buckle accents on strap. Great"},{"domain":"apparel","label":"positive","text":"Nice, soft leatherette. The inside is roomy, and the pic is fairly accurate for the size to body ratio. The tie-front detail stays so, you don't"},{"domain":"apparel","label":"positive","text":"I ordered 2 for gifts and 1 for myself based on other reviews. I was not disappointed! The bag is large and roomy, made of heavy-duty material, with outside pocket, and has a neat little clasp to hook your keys, etc. for easy finding. It will make the perfect beach bag for us, and could be used for almost anything."},{"domain":"apparel","label":"positive","text":"I ordered 2 for gifts and 1 for myself based on other reviews. I was not disappointed! The bag is large and roomy, made of heavy-duty material, with outside pocket, and has a neat little clasp to hook your keys, etc. for easy finding. It will fit my"},{"domain":"apparel","label":"positive","text":"These are great girl socks! Besides being economical, they feel good, wash good, are very stylish, and don't fall down! They look great with jeans and khakis. I have ordered several more pairs, in different colors. A true value"},{"domain":"apparel","label":"positive","text":"These are great girl socks! Besides being economical, they feel good, wash good, are very stylish, and don't fall out on the floor. In short"},{"domain":"apparel","label":"positive","text":"The Nine West Botamy boots are comfortable and really well made. The leather is very soft also. Even though the toe is very pointed, these boots are still comfortable. Amazon has a great price on these boots"},{"domain":"apparel","label":"positive","text":"The Nine West Botamy boots are comfortable and really well made. The leather is very soft also. Even though the toe is very pointed, these boots are still comfortable. Amazon has a great price on these boots (around $200) so there is no problem purchasing"},{"domain":"apparel","label":"positive","text":"Genuine leather with fur lining are about the warmest things you can possibly wear! An excellent choice for extremely cold winter weather, well worth the money spent."},{"domain":"apparel","label":"positive","text":"Genuine leather with fur lining are about the warmest things you can possibly wear! An excellent product for a great price!!\n\nRated 3 out of 5"},{"domain":"apparel","label":"positive","text":"I purchased these boots for my daughter for christmas. I was a little nervouse because she wanted the ugg boots. With four children sometimes a compromise is in order so when I saw these at a more reasonable price, I got them. When she opened them, she at first didn't even realize they weren't the ugg's. She has been wearing them since and I'm guessing started a new trend because others have been asking her where she got them and they also like the cost. In comparison to the more expensive boots, she says \"no difference\""},{"domain":"apparel","label":"positive","text":"I purchased these boots for my daughter for christmas. I was a little nervouse because she wanted the ugg boots. With four children sometimes a compromise is in order so when I saw these at a more reasonable price, I got them. When she opened them, she at first didn't even realize they weren't the ugg's. She has been wearing them since and I'm guessing started a new trend because others have been asking her where she got them and she"},{"domain":"apparel","label":"positive","text":"I was very pleased with the socks. They were just what we were looking for! Thanks so much"},{"domain":"apparel","label":"positive","text":"I was very pleased with the socks. They were just what we were looking for. I also like the design of the fit, they are really snug around"},{"domain":"apparel","label":"positive","text":"I purchased this bra on a special for 6.50. Well worth that price. i am thinking of purchasing more at the current price. very comfortable and great fit----great everyday bra for larger chests (I am a 38D"},{"domain":"apparel","label":"positive","text":"I purchased this bra on a special for 6.50. Well worth that price. i am thinking of purchasing more at the current price. very comfortable and warm.\n\nBest bra ever I ordered one for a friend who lives"},{"domain":"apparel","label":"positive","text":"i've got really sensitive feet and i get blisters really easily, sometimes within 5mins of wearing a new pair of shoes. my quest for the comfortable ballet flat has ended here, after months of searching! the heel is nice and soft but there's still sufficient support here (for me that is. for those of you out there with back problems, it might not be sufficient). i got them in the gold, which is a gorgeous pale lame, and am currently lusting over the black :"},{"domain":"apparel","label":"positive","text":"i've got really sensitive feet and i get blisters really easily, sometimes within 5mins of wearing a new pair of shoes. my quest for the comfortable ballet flat has ended here, after months of searching! the heel is nice and soft but there's still sufficient support here (for me that is. for those of you out there with back problems, it might not be sufficient). i got them in the gold, which is a gorgeous pale lame, the silver is nice silver"},{"domain":"apparel","label":"positive","text":"Great buy for 20 bucks. They look nice and fit well. They are distressed but it is not as bad as I thought it would be from reading the other reviews. They look nice with jeans and a dark shirt. Pretty comfy too"},{"domain":"apparel","label":"positive","text":"Great buy for 20 bucks. They look nice and fit well. They are distressed but it is not as bad as I would have expected.\n\nRated 1 out of 5 by r"},{"domain":"apparel","label":"positive","text":"As manufacturers continue to shed unprofitable lines and present \"one size fits all,\"it becomes increasingly difficultfor those of us who wear narrow sizes to find shoes that fit inanything other than the most expensive brands. These shoesare well made and an excellent value. The only negativeis that are made from a wider last and have an internal spacerto make them narrow. The heel tends to wallow a little bit inmy particular case"},{"domain":"apparel","label":"positive","text":"As manufacturers continue to shed unprofitable lines and present \"one size fits all,\"it becomes increasingly difficultfor those of us who wear narrow sizes to find shoes that fit inanything other than the most expensive brands. These shoesare well made and an excellent value. The only negativeis that are made from a wider last and have an internal spacerto make them narrow. The heel tends to wallow a little but"},{"domain":"apparel","label":"positive","text":"This is an outstanding shoe! It has good support, looks great and cleans easily. The price is comparable to any good quality, kids', athletic shoe. An excellent choice for an active athlete who hasn't yet grown into adult sizes."},{"domain":"apparel","label":"positive","text":"This is an outstanding shoe! It has good support, looks great and cleans easily. The price is comparable to any good quality, kids', athletic shoe. An excellent choice for an active athlete who hasn't yet taken to running shoes.\n\nRated 5 out of"},{"domain":"apparel","label":"positive","text":"i was very satisfied with my purchase of these items.reasonable price and am very happy with items"},{"domain":"apparel","label":"positive","text":"i was very satisfied with my purchase of these items.reasonable price and great service from the manufacturer\n\nRated 5 out of 5 by"},{"domain":"apparel","label":"positive","text":"it means so much to me to be able to buy a pair of jeans that fit me in length. ya who.Am"},{"domain":"apparel","label":"positive","text":"it means so much to me to be able to buy a house or just stay afloat for the first 12 months, the last six months as"},{"domain":"apparel","label":"positive","text":"I liked the timeliness that the merchandise arrived. They fit my husband's feet well and he likes them. The only down side is that when he tried to tighten them the leather lace broke and so now we have to try to find something like it to fix the lace."},{"domain":"apparel","label":"positive","text":"I liked the timeliness that the merchandise arrived. They fit my husband's feet well and he likes them. The only down side is that when he tried to tighten them the leather lace broke and so on and so on. It looks pretty neat and he has no regrets"},{"domain":"apparel","label":"positive","text":"The slippers are great! They do seem to be on the large side of a 15. My husband had to put paper in the toes. He wears 15 in every thing else"},{"domain":"apparel","label":"positive","text":"The slippers are great! They do seem to be on the large side of a 15. My husband had to put paper on his dress to remove the slippers as he felt uncomfortable. He asked"},{"domain":"apparel","label":"positive","text":"I was so impressed with the quality and correct sizing for this suit. My little guy looked so grown-up and handsome in his new suit!! Thanks so much !"},{"domain":"apparel","label":"positive","text":"I was so impressed with the quality and correct sizing for this suit. My little guy looked so grown-up and beautiful. I received one of the only black\/black Tuxes"},{"domain":"apparel","label":"positive","text":"Not best for running but look very cool. comfortable enough to wear for styl"},{"domain":"apparel","label":"positive","text":"Not best for running but look very cool. comfortable enough to wear for the entire group.\n\n5)\n\nOverall, these are"},{"domain":"apparel","label":"positive","text":"One of the most comfortable bras I've ever worn. I own several, and they're just about all I'll wear! Very nice fit, and good look under clothes"},{"domain":"apparel","label":"positive","text":"One of the most comfortable bras I've ever worn. I own several, and they're just about all I'll wear! It does leave my bottom a little sore,"},{"domain":"apparel","label":"positive","text":"I get compliments every time I wear this. I took a chance, because I tend to be a bit plump. As other reviewers noted, the sleeves do run snug. But otherwise it's a great jacket at a great price. The grommets are just so fun.It is fully lined. I just love this modern addition,and it's not too \"young\" feeling, just right."},{"domain":"apparel","label":"positive","text":"I get compliments every time I wear this. I took a chance, because I tend to be a bit plump. As other reviewers noted, the sleeves do run snug. But I really do like the fit they provide. I can't"},{"domain":"apparel","label":"positive","text":"I got this jacket last week, I liked it for the price i paid"},{"domain":"apparel","label":"positive","text":"I got this jacket last week, I liked it for the price... I think I should do it again and look at it from my new perspective."},{"domain":"apparel","label":"positive","text":"Single Style, good shoes. I think is a nice choice to every day work"},{"domain":"apparel","label":"positive","text":"Single Style, good shoes. I think is a nice choice to every day hiking guy.\n\nI had a lot of fun, because on a good day"},{"domain":"apparel","label":"positive","text":"They look nice and feel AMAZING. I bought my husband 2 and as soon as they arrived he asked me to buy him a few more. They're great and the cushion doesn't 'flatten out' in the wash"},{"domain":"apparel","label":"positive","text":"They look nice and feel AMAZING. I bought my husband 2 and as soon as they arrived he asked me to buy him a few more. They're great looking and fit perfectly. We're not going to back down"},{"domain":"apparel","label":"positive","text":"My friend was very happy with them. They are very good quality, and they fit him for the most part. The only issue we had was the length of the arms. They were a little too long. Other than that, we were pleased. They got here in time for Christmas, and they were just what he wanted"},{"domain":"apparel","label":"positive","text":"My friend was very happy with them. They are very good quality, and they fit him for the most part. The only issue we had was the length of the arms. They were a little too long. Other than that, we were pleased. They got here in under 12 minutes"},{"domain":"apparel","label":"positive","text":"Of all men's silk PJs that I purchased over the years for my husband this is one of the best. The fabric has a nice heavy weight to it and it survives machine washing well. After reading other customers' reviews, I purchased a medium size for a person who usually wears size M and occasionally L. It turned out too small. I would recommend going one size up"},{"domain":"apparel","label":"positive","text":"Of all men's silk PJs that I purchased over the years for my husband this is one of the best. The fabric has a nice heavy weight to it and it survives machine washing well. After reading other customers' reviews, I purchased a medium size for a person with a bit of a dry skin which made the fabric soft, but"},{"domain":"apparel","label":"positive","text":"I LOVE these shoes...I have been searching for the right ballet\/audrey hepburn style flats for years. I also love the price"},{"domain":"apparel","label":"positive","text":"I LOVE these shoes...I have been searching for the right ballet\/audrey hepburnie and was disappointed. It's awesome. I am still"},{"domain":"apparel","label":"positive","text":"The fit is great. Sexy slim look and feel. Slight stretch to add to comfort and hugging feel of the denim. Got lots of compliments"},{"domain":"apparel","label":"positive","text":"The fit is great. Sexy slim look and feel. Slight stretch to add to comfort and hugging feel of the denim. I still prefer the slim fit and it"},{"domain":"apparel","label":"positive","text":"the price for the slippers was average- no big discount, but they arrived at my front door in time for Christmas. That was a big plus. And my daughter loved them"},{"domain":"apparel","label":"positive","text":"the price for the slippers was average- no big discount, but they arrived at my front door for $5 and we were able to take care of most of the shipping"},{"domain":"apparel","label":"positive","text":"Very cute tops, for a nice price. They wash up good. They do run a little big, just so you are aware"},{"domain":"apparel","label":"positive","text":"Very cute tops, for a nice price. They wash up good. They do run a couple of times and sometimes they even"},{"domain":"apparel","label":"positive","text":"The beading on the bag is fantastic, and its very cute. The color is even more exquisite in person. It's just big enough to hold ID, a little money, and a lipstick, perfect for going out at night"},{"domain":"apparel","label":"positive","text":"The beading on the bag is fantastic, and its very cute. The color is even more exquisite in person. It's just an old fashioned classic bag."},{"domain":"apparel","label":"positive","text":"my hubby liked this shirt -it was a great christmas present"},{"domain":"apparel","label":"positive","text":"my hubby liked this shirt, but didn't think she'd ever like him again, and then she sent"},{"domain":"apparel","label":"positive","text":"They are perfect for kids daily lunches. Would like to order more but don't where to start. Lost all the ordering information"},{"domain":"apparel","label":"positive","text":"They are perfect for kids daily lunches. Would like to order them too!! :-)\n\n\nThis one was a little large"},{"domain":"apparel","label":"positive","text":"My son loved these jeans. The jeans were very comfortable. The best thing about them was that because my son is so thin the elastic adjustments were perfect"},{"domain":"apparel","label":"positive","text":"My son loved these jeans. The jeans were very comfortable. The best thing about them was that I was able to carry it on the shoulder and carry it"},{"domain":"apparel","label":"positive","text":"Good quality workmanship, very authentic looking and sizes are easy to fit. I would buy another one. robert"},{"domain":"apparel","label":"positive","text":"Good quality workmanship, very authentic looking and sizes are easy to shop for. A great value for a budget item.\n\nRated 5 out"},{"domain":"apparel","label":"positive","text":"Soft, durable, breathable fabric. Perfectly flexible for vigorous practice. I'm glad I bought these"},{"domain":"apparel","label":"positive","text":"Soft, durable, breathable fabric. Perfectly flexible for vigorous outdoor climbing, hiking, hiking in winter or exploring"},{"domain":"apparel","label":"positive","text":"THE BOOT IS GREAT BUT IT DOES RUN A WEE BIT LARGE, IF BETWEEN SIZES, GO DOWN NOT UP IF YOU WANT A CLOSER TO REAL FIT. THEY ARE FUN AND DO THE JOB WELL"},{"domain":"apparel","label":"positive","text":"THE BOOT IS GREAT BUT IT DOES RUN A WEE BIT LARGE, IF BETWEEN SIZES, GO DOWN NOT UP IF YOU WANT A CLOSER TO REALIZE"},{"domain":"apparel","label":"positive","text":"It's really hard to buy scrub pants on-line because everyone is different. Cherokee always fits perfectly and good quality. I think they should consider a wider array of sizes in petite. By the time I finished hemming them, I didn't have that cute slit at the bottoms. They wash well and wear well"},{"domain":"apparel","label":"positive","text":"It's really hard to buy scrub pants on-line because everyone is different. Cherokee always fits perfectly and good quality. I think they should consider a wider array of sizes in petite. I'm really just happy"},{"domain":"apparel","label":"positive","text":"The item is much better than any others that I have got through out the years. It should last a long time. Not rip easy. It feels very sturdy. I think it is real good"},{"domain":"apparel","label":"positive","text":"The item is much better than any others that I have got through out the years. It should last a long time. Not rip easy. 5 out of 5 stars Lisa. I've always loved these bags. Quality"},{"domain":"apparel","label":"positive","text":"This jacket and pants are not the high end breathable rain gear you want on a week long backpacking trip. This is the rain gear you keep in your pickup truck for when you least expect. It will keep you perfectly dry. You will sweat a little on a warm day, but it is well worth the money for a cheap, dependable and totally waterproof suit. enjoy the rain and mud."},{"domain":"apparel","label":"positive","text":"This jacket and pants are not the high end breathable rain gear you want on a week long backpacking trip. This is the rain gear you keep in your pickup truck for when you least expect. It will keep you perfectly dry. You will sweat during the coldest parts of the day and feel great on your back when"},{"domain":"apparel","label":"positive","text":"These are very cute and they fit great. I wear them all the time"},{"domain":"apparel","label":"positive","text":"These are very cute and they fit great. I was told they can only be worn with one pair to any length of shorts. I'm having"},{"domain":"apparel","label":"positive","text":"ordering was easy, arrived in 4 days, gloves fit, well and good quality, good buy,recommend to purchas"},{"domain":"apparel","label":"positive","text":"ordering was easy, arrived in 4 days, gloves fit, well and good quality. No problem in shopping in the store, and the price was"},{"domain":"apparel","label":"positive","text":"When I play basketball, or in the past when I did Jiu-Jitsu then too. Anyway, they keep me warm and tight like a brace in the way that so my muscels don't pull or cramp. Anyway, I guess they look o.k. too, but who would see them anyway...THEY'RE UNDERWEAR!!!!take care and good luck"},{"domain":"apparel","label":"positive","text":"When I play basketball, or in the past when I did Jiu-Jitsu then too. Anyway, they keep me warm and tight like a brace in the way that so my muscels don't pull or cramp. Anyway, I guess they look o.k. too, but who would see them anyway...THEY'RE NOT"},{"domain":"apparel","label":"positive","text":"I LOVE this shoe! It's a perfect heel height, classic pointed toe, comfortable design with coverage enough to enclose even a wider foot. Perfectly proportioned with all-day comfort.If I win Lotto, I plan to order every color with spares in case it's ever discontinued.The natural leather is lovely, but scuffs easily. I strongly recommend buffing with neutral polish or saddle soap\/oil to give it a bit of durability.HIGHLY recommended, even for wider feet!"},{"domain":"apparel","label":"positive","text":"I LOVE this shoe! It's a perfect heel height, classic pointed toe, comfortable design with coverage enough to enclose even a wider foot. Perfectly proportioned with all-day comfort.If I win Lotto, I plan to order every color with spares in case it's ever discontinued.The natural leather is lovely, but scuffs easily. I strongly recommend buffing with neutral polish or saddle soap\/oil to give it a bit of cushion"},{"domain":"apparel","label":"positive","text":"This is not a basket short or soccer short, NO!!!! it's a very very nice beach short or just to sunnys day specialy in my country... With hot beaches all year, and beatyfull shopping mall near you can use this shorts for both activities.. That's why i bought it and don't mess the shoppin"},{"domain":"apparel","label":"positive","text":"This is not a basket short or soccer short, NO!!!! it's a very very nice beach short or just to sunnys day specialy in my country... With hot beaches all around you will"},{"domain":"apparel","label":"positive","text":"I have to say, those crocs are the best. they are super confi, and light... I recommend them"},{"domain":"apparel","label":"positive","text":"I have to say, those crocs are the best. they are super confi, they always are! And my wife loved them!\n"},{"domain":"apparel","label":"positive","text":"These shoes keep my feet cozy all the way through a twelve hour shift, walking on concrete floors"},{"domain":"apparel","label":"positive","text":"These shoes keep my feet cozy all the way through a twelve hour shift, which I can be a bit tired on the outside.\n\nWhat do"},{"domain":"apparel","label":"positive","text":"This purse has a lot of positives going for it:1. Great design - the embroidery is very intricate and detailed and looks gorgeous.2. The color is very glamorous.3. It is a deal at this price (although I bought it when it was $5 higher)4. It is unique and I love it because I am unique :)In short, I love it"},{"domain":"apparel","label":"positive","text":"This purse has a lot of positives going for it:1. Great design - the embroidery is very intricate and detailed and looks gorgeous.2. The color is very glamorous.3. It is a deal at this price (although I bought it when it was $5 higher)4. It is unique and I love it because I am unique in"},{"domain":"apparel","label":"positive","text":"I have arms like a gorilla, so I was pleasantly surprised at the length of these sleeves. They fit even my appendages nicely. I followed the advice of the other reviewers and I'm glad I did, for the large is a perfect fit on me, and I'm pretty slender. The material is fairly thin, but not see-through. Overall, I say this shirt is a good value"},{"domain":"apparel","label":"positive","text":"I have arms like a gorilla, so I was pleasantly surprised at the length of these sleeves. They fit even my appendages nicely. I followed the advice of the other reviewers and I'm glad I did, for the large is a perfect fit on me, and I'm pretty slender.\n\n"},{"domain":"apparel","label":"positive","text":"I never seem to have luck shopping for bras, so just took a chance on these off of another review that I had read. They were a great deal and a wonderful fit. I would highly recommend"},{"domain":"apparel","label":"positive","text":"I never seem to have luck shopping for bras, so just took a chance on these off of another review that I had read. They were SO small and lightweight. They weren't made of real plastic so really are just"},{"domain":"apparel","label":"positive","text":"This is a beautiful shoe by Rockport, but beware, it runs really narrow. I even went a size up from my usual to compensate. I ended-up sending them back anyway. So if your foot is on the narrow side you may enjoy this sandal"},{"domain":"apparel","label":"positive","text":"This is a beautiful shoe by Rockport, but beware, it runs really narrow. I even went a size up from my usual to compensate. I ended-up sending them a 3.6 in the mail without knowing when it would"},{"domain":"apparel","label":"positive","text":"I followed the advice of the reviewers before me and ordered them a half size bigger than I normally would and they fit great! Super cute with jeans or a sexy dress! Great job Jessica"},{"domain":"apparel","label":"positive","text":"I followed the advice of the reviewers before me and ordered them a half size bigger than I normally would and they fit great! Super cute with jeans or a T-shirt too! Thank me later I"},{"domain":"apparel","label":"positive","text":"These shoes make my feet look so tiny but they are so cute! I wore them with jeans and will wear them with a pencil skirt next week. Turns out Jessica makes pretty good shoes.........CUTE!!!"},{"domain":"apparel","label":"positive","text":"These shoes make my feet look so tiny but they are so cute! I wore them with jeans and will wear them with a skirt when I move back.\" Aww."},{"domain":"apparel","label":"positive","text":"Highly recommend shoe, BUT you might need a larger size than usual. I wear Easy Spirit 7 1\/2 W but found this shoe too snug in both width and length, and had to return"},{"domain":"apparel","label":"positive","text":"Highly recommend shoe, BUT you might need a larger size than usual. I wear Easy Spirit 7 1\/2 W but found this shoe too snug in both width and height. If you try to play"},{"domain":"apparel","label":"positive","text":"These are the first mootsies tootsies I have owned and I love em.Since then I have bought another pair of loafers and a pair of their boots. These shoes are very comfortable"},{"domain":"apparel","label":"positive","text":"These are the first mootsies tootsies I have owned and I love em.Since then I have bought some more and started to eat"},{"domain":"apparel","label":"positive","text":"The presentation of the product is claer and attractive and the product is durable, comfortable and goodlooking"},{"domain":"apparel","label":"positive","text":"The presentation of the product is claer and attractive and the product is durable, comfortable.\n\nDoloresque's customer service\n\nWith the product,"},{"domain":"apparel","label":"positive","text":"THIS IS A GREAT PRODUCT THAT I HAVE BEEN PUCHASING FOR 15 PLUS YEARS. CAN I ORDER MONOGRAMED SHIRTS FROM THIS SITE"},{"domain":"apparel","label":"positive","text":"THIS IS A GREAT PRODUCT THAT I HAVE BEEN PUCHASING FOR 15 PLUS YEARS. CAN I ORDER MONOGRAMED SHIRTS FROM THIS THING OR DOES THIS"},{"domain":"apparel","label":"positive","text":"I gave this shoes to my girlfriend and she just love them, she says they are really confortable, and i find them really pretty. A really good buy it is"},{"domain":"apparel","label":"positive","text":"I gave this shoes to my girlfriend and she just love them, she says they are really confortable, and i find them really cool looking too. This is my first time"},{"domain":"apparel","label":"positive","text":"Ordering online and not being able to try on clothing can be risky but it paid off with this purchase. I just wish it wasn't \"hand wash only\"."},{"domain":"apparel","label":"positive","text":"Ordering online and not being able to try on clothing can be risky but it paid off with this purchase. I just wish it wasn't that difficult too.\n\nI've been using the same kind of"},{"domain":"apparel","label":"positive","text":"I use this all of the time. It gives good protection, ease of use, and good handling. Only disadvantage is that you can not keep it on when putting the unit in a vetical dock. However, this is true of any protective skin. Outstanding product."},{"domain":"apparel","label":"positive","text":"I use this all of the time. It gives good protection, ease of use, and good handling. Only disadvantage is that you can not keep it on when putting the unit in a vetical dock. However, any time you need the lock"},{"domain":"apparel","label":"positive","text":"As a new 36DD (can't wear underwire) this is the most supportive and comfortable bra on the market. For the past 5 years (since my surgery) I've been searching for the perfect bra. I have finally found it!"},{"domain":"apparel","label":"positive","text":"As a new 36DD (can't wear underwire) this is the most supportive and comfortable bra on the market. For the past 5 years (since my surgery) I've been searching for the perfect bra. I have been trying to find the right one to fit my"},{"domain":"apparel","label":"positive","text":"recipient was very satisfied with this blanket as PB are his initials"},{"domain":"apparel","label":"positive","text":"recipient was very satisfied with this. We have used it successfully for several different ways to address people whose questions"},{"domain":"apparel","label":"positive","text":"These are wonderful sandals. Tried to find flat slingback sandals in the stores but to no avail. Finally did the right thing and went online. Great Sandals at a very reasonable price. You won't be sorry if you purchase these. Very stylish and very comfortable"},{"domain":"apparel","label":"positive","text":"These are wonderful sandals. Tried to find flat slingback sandals in the stores but to no avail. Finally did the right thing and went online. Great Sandals at a very reasonable price. You won't be sorry if you purchase these. Very stylish and you can't take them any longer."},{"domain":"apparel","label":"positive","text":"these are the most warm and comfortable slippers. i would recommend these to everyone"},{"domain":"apparel","label":"positive","text":"these are the most warm and comfortable slippers. i would recommend these to every other slipper lover, especially if you are looking for someone"},{"domain":"apparel","label":"positive","text":"can't believe how true to size they are. They're quite easy to move in, and they're simple and beautiful. Not at all cheap-looking for the price. I expected less and got more"},{"domain":"apparel","label":"positive","text":"can't believe how true to size they are. They're quite easy to move in, and they're simple and beautiful. Not at all cheap-looking for the price. I expected less from"},{"domain":"apparel","label":"positive","text":"I love this shoe! It looks very elegant on the foot and there's a little bit toe cleavage which is always a plus! But make sure to go half a size up. It's a little snug in the front and it takes a couple wears to break it in."},{"domain":"apparel","label":"positive","text":"I love this shoe! It looks very elegant on the foot and there's a little bit toe cleavage which is always a plus! But make sure to go half a size up. It's a little snug in the front and it takes a couple wears to break down, but it does fit me!"},{"domain":"apparel","label":"positive","text":"Purchased these for my husband. He absolutely loves these sandals. He initially thought the little nubbies would feel strange. However, he got over that thought fast when he slipped them on and went tromping around the yard. He uses them for a quick slip-on shoe to run outdoors. Wears them every day. Thanks for a nice slip-on! Also these are sturdy though very light weight"},{"domain":"apparel","label":"positive","text":"Purchased these for my husband. He absolutely loves these sandals. He initially thought the little nubbies would feel strange. However, he got over that thought fast when he slipped them on and went tromping around the yard. He uses them all"},{"domain":"apparel","label":"positive","text":"These are exactly what I was looking for. I've been wearing this type of ear muff for 20 years. Everytime I break or lose a pair I spend months looking for its replacement. After I received my first pair, I ordered enough to last me another 20 years. I hate the around your neck ear muffs so popular these days. They are uncomfortable and they cost more"},{"domain":"apparel","label":"positive","text":"These are exactly what I was looking for. I've been wearing this type of ear muff for 20 years. Everytime I break or lose a pair I spend months looking for its replacement. After I received a new pair I decided to use it as"},{"domain":"apparel","label":"positive","text":"I'm in love with these sandals. Although they are very lightweight, they are vastly more substantial, supportive and comfortable than most flip-flops. I may have to buy another pair. If you're a half-size, go down not up"},{"domain":"apparel","label":"positive","text":"I'm in love with these sandals. Although they are very lightweight, they are vastly more substantial, supportive and comfortable than a standard leather bag, they"},{"domain":"apparel","label":"positive","text":"I bought these because I normally can't wear a shoe without my orthodic insert. These are great. Very comfortable. I plan on living in them this summer.I bought a size 8 croc which was fine. These were on the big size so I exchanged them for the next smaller size. I guess I am a 7 and 1\/2 so if you are inbetween sizes, go smaller with the Athens Croc"},{"domain":"apparel","label":"positive","text":"I bought these because I normally can't wear a shoe without my orthodic insert. These are great. Very comfortable. I plan on living in them this summer.I bought a size 8 croc which was fine. These were on the big size so I exchanged them for the next smaller size. I guess I am going to have to"},{"domain":"apparel","label":"positive","text":"I love these Crocs! They are much more comfortable than the original style, and I like the two tone color combo. I wear them even in the winter"},{"domain":"apparel","label":"positive","text":"I love these Crocs! They are much more comfortable than the original style, and I like the two tone color combo. I wear them even longer than they were, for extended periods"},{"domain":"apparel","label":"positive","text":"This is a great fit for a silk shirt. I thought it would not be a close fit being silk, but I was wrong. This item fits snug and looks great on. Both alone and layered. I would recommend this shirt to people that like the look of a tight tank."},{"domain":"apparel","label":"positive","text":"This is a great fit for a silk shirt. I thought it would not be a close fit being silk, but I was wrong. This item fits snug and looks great on. Both alone and layered. I would go with a TPU but a tight fit would create a more comfortable"},{"domain":"apparel","label":"positive","text":"The jersey of our #54 got here for my wife in time for Super Bowl and she was very happy.(With the jersey NOT Grossman"},{"domain":"apparel","label":"positive","text":"The jersey of our #54 got here for my wife in time for Super Bowl and we are thrilled to be getting this gift! I love"},{"domain":"apparel","label":"positive","text":"My 11 year old wanted these shoes. All her friends at school thought they were so cooland want a pair. Plus they slip on and off so quick and are great for PE and the palyground. I would buy these shoes again, without a doubt. Keds makes a wonderful product and I think she'll out grow them before they even think about wearing out. Great value for the money."},{"domain":"apparel","label":"positive","text":"My 11 year old wanted these shoes. All her friends at school thought they were so cooland want a pair. Plus they slip on and off so quick and are great for PE and reading. Now the first of its kind and my daughter has no problems."},{"domain":"apparel","label":"positive","text":"These shoes are so comfy! I love the no shoe string thing too. Easy and comfortable. What more could you ask for"},{"domain":"apparel","label":"positive","text":"These shoes are so comfy! I love the no shoe string on this build. I will definitely purchase these shoes, but also I am so pleased"},{"domain":"apparel","label":"positive","text":"I just received this bag today and I am absolutely in love with it.This bag looks alot more expensive then it is and the inside is HUGE!!! With a zip pocket and additional large pocket and smaller one that is perfect for my mp3 player. My husband got it 100% right with this little surprise. So if you enjoy a large bag that looks great on your arm this one is it expecially for the price!!!"},{"domain":"apparel","label":"positive","text":"I just received this bag today and I am absolutely in love with it.This bag looks alot more expensive then it is and the inside is HUGE!!! With a zip pocket and additional large pocket and smaller one that is perfect for my mp3 player. My husband got it 100% right and we are already getting ready with our baby!I also got"},{"domain":"apparel","label":"positive","text":"Both our son and his wife and myself are very pleased with the undershirts. It was very difficult to find the shirts that openned on the side, so I appreciate them being offered on your site and will remember the brand in the future."},{"domain":"apparel","label":"positive","text":"Both our son and his wife and myself are very pleased with the undershirts. It was very difficult to find the shirts that openned on the side, so I appreciate them being offered on your site! Thank you for having such a"},{"domain":"apparel","label":"positive","text":"The Lilyette Maximum Support bra is well made and wears well. It holds up to frequent washings and retains its support features. It is comfortable"},{"domain":"apparel","label":"positive","text":"The Lilyette Maximum Support bra is well made and wears well. It holds up to frequent washings and retains its support features. It is comfortable for many types of wear.\n\nFits:\n\nF"},{"domain":"apparel","label":"positive","text":"I have just recieved my pair of boxer-briefs for my son. I took A kid's review's idea and got one size smaller for my son. I asked him how they felt and he said that they felt really good. I asked him if they give him enough support and he said yes and he even told me, I don't know why, but he told me that he can get his hand down the boxer-briefs and take it out without the boxer-briefs streching and loosing their tightness"},{"domain":"apparel","label":"positive","text":"I have just recieved my pair of boxer-briefs for my son. I took A kid's review's idea and got one size smaller for my son. I asked him how they felt and he said that they felt really good. I asked him if they give him enough support and he said yes and he even told me, I don't know why, but he told me that he can get his hand down the boxer-briefs and have"},{"domain":"apparel","label":"positive","text":"I travel a lot, especially during the summer months, and these packs are the best thing since Ziplock bags!! They are a must, in all sizes, for the traveler. Helps things and people get\/stay organized; an absolute must!!"},{"domain":"apparel","label":"positive","text":"I travel a lot, especially during the summer months, and these packs are the best thing since Ziplock bags!! They are a must, in all sizes, for the traveler. Helps things from being bulky and"},{"domain":"apparel","label":"positive","text":"I love naughty monkey! I'm so happy with their shoes! They don't hurt my feet"},{"domain":"apparel","label":"positive","text":"I love naughty monkey! I'm so happy with their shoes! They don't feel good…they feel way better"},{"domain":"apparel","label":"positive","text":"This is a wonderfully comfortable and good looking pump especially if you're looking for a slightly wider toe box. It looks great with a skirt or slacks. My only complaint is that after finally accepting that a wide width is the most comfortable, and kindest to my feet, I can't find my size (6.5 W) in navy. I have the shoe in black. If anyone from Naturalizer is reading this message; how about making more sizes and colors in wide widths available"},{"domain":"apparel","label":"positive","text":"This is a wonderfully comfortable and good looking pump especially if you're looking for a slightly wider toe box. It looks great with a skirt or slacks. My only complaint is that after finally accepting that a wide width is the most comfortable, and kindest to my feet, I can't find my size (6.5\/H).\n\n5 \/ 5"},{"domain":"apparel","label":"positive","text":"I bought these slippers for my mother, who is 5 years post stroke. She has difficulty keeping shoes and slippers on because she has no feeling in her left foot since her stroke. Also she is always cold even when it is 80+ degrees outside. These slippers have been wonderful. They fit her well, they stay on and they keep her feet warm.When she wears these out will definitly by another pair"},{"domain":"apparel","label":"positive","text":"I bought these slippers for my mother, who is 5 years post stroke. She has difficulty keeping shoes and slippers on because she has no feeling in her left foot since her stroke. Also she is always cold even when it is 80+ degrees outside. These slippers have been wonderful. They fit her well, they stay on and they keep her feet warm.When I was pregnant I would have to"},{"domain":"apparel","label":"positive","text":"Don't know where else to find a garter panty set (arrived fast too) for this price. They say economy, so wasn't expecting much, but we're still enjoying this set to spice up special evenings! We bought the One Size (for a size 8) and it is perfect and adjusts"},{"domain":"apparel","label":"positive","text":"Don't know where else to find a garter panty set (arrived fast too) for this price. They say economy, so wasn't expecting much, but we're still enjoying this set to this day.\n\n\nSo"},{"domain":"apparel","label":"positive","text":"Good quality jeans at an affordable price. Size is just right, quite comfortable"},{"domain":"apparel","label":"positive","text":"Good quality jeans at an affordable price can be expected. The new line comes with a number of useful features, including an easy way"},{"domain":"apparel","label":"positive","text":"I bought these for my son for Christmas, they were first quality, arrived in time for christmas,and at a great price"},{"domain":"apparel","label":"positive","text":"I bought these for my son for Christmas, they were first quality, arrived in time for the upcoming holidays and we are using them for winter. If"},{"domain":"apparel","label":"positive","text":"They are exactly what I was hoping they would be. I love the contoured front pouch. All the web sites I saw and read about them said you may want to order 1 size larger then normal. I would agree with this unless you want a more snug fit. My wife loves them as well and was quite pleased with the look and feel. I ordered 4 different pairs of Unico's and they're all good quality and look and feel great"},{"domain":"apparel","label":"positive","text":"They are exactly what I was hoping they would be. I love the contoured front pouch. All the web sites I saw and read about them said you may want to order 1 size larger then normal. I would agree with this unless you want a more snug fit. My wife loves them as well and was quite pleased with the look and feel. I ordered 4 different pairs of Unico's and was extremely happy with each one. It's"},{"domain":"apparel","label":"positive","text":"The slippers were perfect, exactly what I wanted. The price was good and they were delivered sooner then I expected. I'm very pleased with my purchase and it was so easy to do. Thank You very much"},{"domain":"apparel","label":"positive","text":"The slippers were perfect, exactly what I wanted. The price was good and they were delivered sooner then the others I could find. I am really not going to"},{"domain":"apparel","label":"positive","text":"Great slippers, very comfortable. I love the fact that the front is open in case I just got a pedicure. And the black ones are perfect because they don't show dirt like the white ones"},{"domain":"apparel","label":"positive","text":"Great slippers, very comfortable. I love the fact that the front is open in case I just got a pedicure. And the black ones are perfect because they don't smell like rubber and aren't exposed"},{"domain":"apparel","label":"positive","text":"Super comfortable. Provides great support\/coverage. Love the front zipper. No fighting to get over your head."},{"domain":"apparel","label":"positive","text":"Super comfortable. Provides great support\/coverage. Love the front zipper.\n\nWe found all"},{"domain":"apparel","label":"positive","text":"These boots are so warm and soft! I usually wear a 7.5 and I ordered them in size 7 (even though they recommend sizing up for half sizes) and they fit perfectly. An awesome (and cheaper) alternative to Uggs"},{"domain":"apparel","label":"positive","text":"These boots are so warm and soft! I usually wear a 7.5 and I ordered them in size 7 (even though they recommend sizing up to a 9) and I have to find the right"},{"domain":"apparel","label":"positive","text":"Very comfortable - looks great - makes it easy to move around in bed"},{"domain":"apparel","label":"positive","text":"Very comfortable - looks great - makes it easy to move around in all lighting, if you can't put it on your laptop for some reason, the \"A"},{"domain":"apparel","label":"positive","text":"I LOVE my new Steve Maddens! They are brand new as described and I received them verrrry quickly"},{"domain":"apparel","label":"positive","text":"I LOVE my new Steve Maddens! They are brand new as well, with full color, hand painted artwork by Mike M,"},{"domain":"apparel","label":"positive","text":"This is a nice shirt, not as warm as we had hoped though. The lining is quite thin. It washes fairly well, loses a bit of its shape but not a lot. A great shirt for the fall. Its roomy & comfortable"},{"domain":"apparel","label":"positive","text":"This is a nice shirt, not as warm as we had hoped though. The lining is quite thin. It washes fairly well, loses a bit of its shape but not a lot. A great quality.\n\nRated 1 out"},{"domain":"apparel","label":"positive","text":"They were a nice quality, nicely priced, and were shipped promptly. I would buy this brand again"},{"domain":"apparel","label":"positive","text":"They were a nice quality, nicely priced, and were shipped promptly. I'd be interested in playing them again.\n\nAs mentioned, if you have a"},{"domain":"apparel","label":"positive","text":"My mother loves these pants. I know they are for men, but she loves the way they fit her. They are stain resisnt and that makes them that much better."},{"domain":"apparel","label":"positive","text":"My mother loves these pants. I know they are for men, but she loves the way the belt fits. As much as men can enjoy and like this fit"},{"domain":"apparel","label":"positive","text":"I bought this bra because I was tired of seeing \"nursing bra\" lines under my shirts. This is great. I bought the L++ and it fits perfectly. I am a 38DDD normally and durring my pregnancy a 40DDD was fitting too. If you buy this bra, you will love it, just buy the correct size"},{"domain":"apparel","label":"positive","text":"I bought this bra because I was tired of seeing \"nursing bra\" lines under my shirts. This is great. I bought the L++ and it fits perfectly. I am a 38DDD normally and durring my pregnancy a 40DDD was fitting too. If you buy a"},{"domain":"apparel","label":"positive","text":"This is just the perfect accessory for the CATS costume one of my dancers is using for our dance recital. Got this in gray and brown too! Took a while for the product to get here. In fact, I had to re-order because of the delay--but when finally the product arrived, it was worth the wait"},{"domain":"apparel","label":"positive","text":"This is just the perfect accessory for the CATS costume one of my dancers is using for our dance recital. Got this in gray and brown too! Took a while for the product to get here. In fact, I had to re-order because of the delay--but when finally the product arrived, it was worth it. Definitely worth it. Only real"},{"domain":"apparel","label":"positive","text":"Love this Kept Couture Toiletry Kit. I actually own two of them and give them as gifts during the holidays to my friends. The bag has a vinyl liner which is extremely helpful when your shampoo bottle leaks during travel. It keeps the leaky goods all inside - won't ruin the other stuff in your suitcase. And, it's a perfect size. It can hold about 10 days' worth of toiletries."},{"domain":"apparel","label":"positive","text":"Love this Kept Couture Toiletry Kit. I actually own two of them and give them as gifts during the holidays to my friends. The bag has a vinyl liner which is extremely helpful when your shampoo bottle leaks during travel. It keeps the leaky goods all inside - won't ruin the other stuff in your suitcase. And, it's a perfect size. It can hold about 10 days' worth of your kef"},{"domain":"apparel","label":"positive","text":"I bought three pairs of Clarks from Amazon when I saw the $20 coupon and as usual, scored with free shipping. Clarks' quality is tops and the prices were great, too!I got these in earth color. They look really good with jeans. Comfy with or without socks. The soles are gonna last a while.These have some nice cush to them, and provide good support to my high-arched, tired feet"},{"domain":"apparel","label":"positive","text":"I bought three pairs of Clarks from Amazon when I saw the $20 coupon and as usual, scored with free shipping. Clarks' quality is tops and the prices were great, too!I got these in earth color. They look really good with jeans. Comfy with or without socks. The soles are gonna last a while.These have some nice cush to them, and provide good support to my high-arched, tired feet"},{"domain":"apparel","label":"positive","text":"i don't have a lot of experience with compression shorts, but i am very pleased with this product. the fabric does not lose compression over time (although i've only had them a short time). the fit is good, the fabric is comfortable. i've gotten into the habit of sleeping in them, and they work great for keeping you toasty. i wish products like this were around during the years i played college soccer"},{"domain":"apparel","label":"positive","text":"i don't have a lot of experience with compression shorts, but i am very pleased with this product. the fabric does not lose compression over time (although i've only had them a short time). the fit is good, the fabric is comfortable,"},{"domain":"apparel","label":"positive","text":"I like the flip case. It is exactly what i wanted. However,the clip has fallen off a few times when i hit it."},{"domain":"apparel","label":"positive","text":"I like the flip case. It is exactly what i wanted. However,the handle was not very thick though, but"},{"domain":"apparel","label":"positive","text":"FIT IS PERFECT. VERY COMFORTABLE. 4 STARS. WOULD PURCHASE AGAIN. MARY S"},{"domain":"apparel","label":"positive","text":"FIT IS PERFECT. VERY COMFORTABLE. 4 STARS.\n\nTHE"},{"domain":"apparel","label":"positive","text":"These black satin Isotoner slippers are extremely comfortable and fit extremely well. They are flexible enough to mold to the shape of your feet but strong enough to cushion your feet, as well. They are well worth the purchase"},{"domain":"apparel","label":"positive","text":"These black satin Isotoner slippers are extremely comfortable and fit extremely well. They are flexible enough to mold to the shape of your feet but strong enough to cushion your feet, as well. They are well made and do not wear out"},{"domain":"apparel","label":"positive","text":"Fit well. Great for all kinds of athletic workouts. I'm ready to buy a couple more pairs"},{"domain":"apparel","label":"positive","text":"Fit well. Great for all kinds of athletic workouts. I'm ready to start the season on the bench press and I feel great."},{"domain":"apparel","label":"positive","text":"For the money, these are a great value. Unlike a comment above, I have not found these short at all, but average in length"},{"domain":"apparel","label":"positive","text":"For the money, these are a great value. Unlike a comment above, I have not found these short at all, but there are a few more. They are very nice.\n\nA"},{"domain":"apparel","label":"positive","text":"love these little gems... perfect at 1 size below normal size.you won't want to take them off"},{"domain":"apparel","label":"positive","text":"love these little gems... perfect at 1 size below normal size.you won't love this gem when it's next to you but I"},{"domain":"apparel","label":"positive","text":"I bought these slippers as a Christams gift for my 16 year old daughter, she was very happy to get them as I guess they are the \"in\" thing for teenagers in her school. She loves them and actually wears them to school they are so comfy! Price is high, but they are well made and will last much longer than the typical slipper, these are more like shoes than slippers. The sheep skin & wool lining is very sturdy & luxerious"},{"domain":"apparel","label":"positive","text":"I bought these slippers as a Christams gift for my 16 year old daughter, she was very happy to get them as I guess they are the \"in\" thing for teenagers in her school. She loves them and actually wears them to school they are so comfy! Price is high, but they are well made and will last much longer than the $28 pair that a mom"},{"domain":"apparel","label":"positive","text":"I really like these. I do recommend getting a size smaller. I normally wear and 8.5 and ordered a 7 and they fit perfectly. super comfortable!"},{"domain":"apparel","label":"positive","text":"I really like these. I do recommend getting a size smaller. I normally wear a size of 16XL, 16XXC, 16XX"},{"domain":"apparel","label":"positive","text":"Yeh, these are really great socks... but what's up with James? If new socks changed my life, hey I need to get a little something goin' on. Back to the socks...my favorite, in black, low cut, workin' out or hangin' out"},{"domain":"apparel","label":"positive","text":"Yeh, these are really great socks... but what's up with James? If new socks changed my life, hey I need to get a little something goin' on.\n\n...hehe...\n\n\nI think"},{"domain":"apparel","label":"positive","text":"I love this jacket. It is lightweight but still warm enough to wear in all but the coldest weather. It is also long enough to cover my rear. Very good in the rain, too"},{"domain":"apparel","label":"positive","text":"I love this jacket. It is lightweight but still warm enough to wear in all but the coldest weather. It is also long enough to cover my rear. Very good in the fall\/winter months.\n\nW"},{"domain":"apparel","label":"positive","text":"My boyfriend loves tommy socks but they are impossible to find in New Mexico and I have looked everywhere for them. I gave them to him for christmas and he thought they were the greates"},{"domain":"apparel","label":"positive","text":"My boyfriend loves tommy socks but they are impossible to find in New Mexico and I have looked everywhere for them. I gave them to him for christmas and he thought they were the best. I love they are so easy"},{"domain":"apparel","label":"positive","text":"This is a lovely fat scarf that looks like it was hand-knitted from scraps, just like I used to do before I got bored with knitting. It's squishy and warm and the perfect combination of colors for me; I just cut off the tag and people think I made it myself. (Don't tell!) Not high fashion, but very warm and comfortable"},{"domain":"apparel","label":"positive","text":"This is a lovely fat scarf that looks like it was hand-knitted from scraps, just like I used to do before I got bored with knitting. It's squishy and warm and the perfect combination of colors for me; I just need some"},{"domain":"apparel","label":"positive","text":"I bought this for my boyfriend. It is soft and comfy. It is definitely comfy for me to snuggle with. And as a bonus he likes it too. My only complaint is that the sleeves are little too long. But overall we are very happy with the purchase"},{"domain":"apparel","label":"positive","text":"I bought this for my boyfriend. It is soft and comfy. It is definitely comfy for me to snuggle with. And as a bonus he likes it too. My only complaint is that the sleeves are little. I think they"},{"domain":"apparel","label":"positive","text":"I love this skirt.I wear it with my \"Live a Little\" denim jacket, so cute.I find it to be really figure flattering.I ordered a size 6 and it fit perfect.Nice to find a denim skirt that's a little different than the other zillions out there"},{"domain":"apparel","label":"positive","text":"I love this skirt.I wear it with my \"Live a Little\" denim jacket, so cute.I find it to be really figure flattering.I ordered a size 6 and it fit perfect.Nice to find a denim jacket"},{"domain":"apparel","label":"positive","text":"I ordered this bra as well as the Olga Women's Perfect Fit Full Figure, black, 38DDD. This bra provides much better lift, support and separation than the Olga. I think it is because the cups are seamed. I'd recommend it to any woman who is petite in stature (I'm 5'2\"), and also has a large bra size (I'm a 36DDD)."},{"domain":"apparel","label":"positive","text":"I ordered this bra as well as the Olga Women's Perfect Fit Full Figure, black, 38DDD. This bra provides much better lift, support and separation than the Olga. I think it is because the cups are seamed. I'd recommend it to any woman who is petite in stature (I'm 5'2\"), and also has a large bra for"},{"domain":"apparel","label":"positive","text":"I love these jeans -- I have 3 pair and they are the only jeans I wear. Just enough stretch to be comfy but not too tight. I wear a size 14 and these jeans fit me great."},{"domain":"apparel","label":"positive","text":"I love these jeans -- I have 3 pair and they are the only jeans I wear. Just enough stretch to be comfy but not too tight. I wear them every day... and I really like"},{"domain":"apparel","label":"positive","text":"If you are a grandma on a budget, it can be difficult to find useful items for grandsons. I thought that this was a good buy at $7.99 for my 11-year old grandson for either his birthday or Christmas. I would have given five stars, but there was not a complete list of teams offered"},{"domain":"apparel","label":"positive","text":"If you are a grandma on a budget, it can be difficult to find useful items for grandsons. I thought that this was a good buy at $7.99 for my 11-year old grandson for either his birthday or Christmas. I would have given five stars, but I thought the little girl at the corner"},{"domain":"apparel","label":"positive","text":"i have purchased other hats from well known companies. these hats are great for the money and are constructed well. good job!"},{"domain":"apparel","label":"positive","text":"i have purchased other hats from well known companies. these hats are great for the money and they come with a very good quality. but they"},{"domain":"apparel","label":"positive","text":"Stretches to fit you exactly. The smooth fabric holds everything in place. Contrast waistband and package support make this underwear look very sexy. Highly recommended"},{"domain":"apparel","label":"positive","text":"Stretches to fit you exactly. The smooth fabric holds everything in place. Contrast waistband and package support make this underwear look more streamlined and comfortable in your pocket than other, more traditional pant"},{"domain":"apparel","label":"positive","text":"These sweatpants are extremely comfortable, reasonably priced and come in a variety of colors...Definetly a great buy.."},{"domain":"apparel","label":"positive","text":"These sweatpants are extremely comfortable, reasonably priced and come in a variety of different styles. Even though they don't always fit over the summer, the"},{"domain":"apparel","label":"positive","text":"I found this product to be of very high quality and the transaction of the product was great.I recommend this for anyone looking for great bag, especially as a gift"},{"domain":"apparel","label":"positive","text":"I found this product to be of very high quality and the transaction of the product had been in place for about three months. In all seriousness, i"},{"domain":"apparel","label":"positive","text":"i regret to say that i did not receive the shoes..!!"},{"domain":"apparel","label":"positive","text":"i regret to say that i did not make this choice. It is all my fault. I will now"},{"domain":"apparel","label":"positive","text":"I am very happy with my velour slippers .They are a perfect fit and very comfortable.I received my order promptly and plan to order again in the future"},{"domain":"apparel","label":"positive","text":"I am very happy with my velour slippers .They are a perfect fit and very comfortable.I received my order promptly and plan to purchase more.\n\nRated 3 out of 5 by Anonymous from"},{"domain":"apparel","label":"positive","text":"The shirt came fast.It's a good quality shirt.I'm satisfied with it"},{"domain":"apparel","label":"positive","text":"The shirt came fast.It's a great thing. I'll always wear this shirt and it won't damage"},{"domain":"apparel","label":"positive","text":"This is great. I measured before I put it on & after. I lost over 2 inches. I highly recommend this"},{"domain":"apparel","label":"positive","text":"This is great. I measured before I put it on & after. I lost a few pounds and also lost my dog and"},{"domain":"apparel","label":"positive","text":"I really like this case, it fits so perfectly that the Zen doesn't rattle around or anything, yet all the plugs and buttons are still accessible. Easy to get on and off, too, and looks great"},{"domain":"apparel","label":"positive","text":"I really like this case, it fits so perfectly that the Zen doesn't rattle around or anything, yet all these years, you'd think that a few weeks"},{"domain":"apparel","label":"positive","text":"These keep your feet warm and toastie. Will want more when these wear out"},{"domain":"apparel","label":"positive","text":"These keep your feet warm and toastie. And the one-finger tip of the lacy knot keeps this off.\n\n"},{"domain":"apparel","label":"positive","text":"This is a lovely, lovely bra. It supports, lifts, and minimizes, creating a flattering shape underneath clothing. The wide straps are gentle on the shoulders, leaving no ugly marks after long periods of wear. The back doesn't ride up, and the three hooks serve as a strong anchor. The plunging lace neckline is invisible even under a tight t-shirt, and dare I say it, looks pretty sexy. Yes, you can be well supported and attractive- bless ye, St. Olga"},{"domain":"apparel","label":"positive","text":"This is a lovely, lovely bra. It supports, lifts, and minimizes, creating a flattering shape underneath clothing. The wide straps are gentle on the shoulders, leaving no ugly marks after long periods of wear. The back doesn't ride up, though"},{"domain":"apparel","label":"positive","text":"It is perfect for my three year old to carry his toys...instead of me carrying them!!!"},{"domain":"apparel","label":"positive","text":"It is perfect for my three year old to carry his toys...instead of me, I need you to pick up the keys"},{"domain":"apparel","label":"positive","text":"I bought it for my boyfriend for the gym. He would carry all his extra gym clothes, wallet, keys, and phone all bundled up in his arms and shove everything in the locker dropping everything along the way. He really likes it and especially the extra front pocket allows him to seperate small stuff. Not very many other products have that extra pocket. Very sturdy material and the size is just right"},{"domain":"apparel","label":"positive","text":"I bought it for my boyfriend for the gym. He would carry all his extra gym clothes, wallet, keys, and phone all bundled up in his arms and shove everything in the locker dropping everything along the way."},{"domain":"apparel","label":"positive","text":"This is a Great Gown for the price. It's comfy, soft, and there is even a small bit of support for the big busted girls out there. Moreover, it's sexy! Hope yall enjoy"},{"domain":"apparel","label":"positive","text":"This is a Great Gown for the price. It's comfy, soft, and there is even a small bit of support for the big buttons.\n\nGood Value for $45.99. If"},{"domain":"apparel","label":"positive","text":"Very happy with this product. They are substantial so they are &quot;suitable&quot; for a Medium or Large and not someone who is Small. Delivery was fast and it was well packed. Shipping was included, though I didn't realize it until the end of the ordering process."},{"domain":"apparel","label":"positive","text":"Very happy with this product. They are substantial so they are &quot;suitable&quot; for a Medium or Large and not someone who is Small. Delivery was fast and it was well packed. Shipping was included, though I had"},{"domain":"apparel","label":"positive","text":"After i tired Jockey No Line Promise Hip Brief , i will never purchased anything els"},{"domain":"apparel","label":"positive","text":"After i tired Jockey No Line Promise Hip Briefing 2 3.19 4.28 6.57 8.34 21 23"},{"domain":"apparel","label":"positive","text":"These boots fit like a glove and are so sleek looking. They are comfortable and a great buy. A nice pair of black boots is essential to any wardrobe"},{"domain":"apparel","label":"positive","text":"These boots fit like a glove and are so sleek looking. They are comfortable and a fun option that will change often.\n\nThe leathers hold together well for a day of"},{"domain":"apparel","label":"positive","text":"The service was expedient and the bras fit perfectly. Just what I expected and wanted"},{"domain":"apparel","label":"positive","text":"The service was expedient and the bras fit perfectly. Just make sure your bras are tight and make sure that"},{"domain":"apparel","label":"positive","text":"This is the fifth pair of Club Cs I've owned, the second in black. I believe they're the best combination of durability and comfort on the market. I'll undoubtedly buy another pair when these wear out"},{"domain":"apparel","label":"positive","text":"This is the fifth pair of Club Cs I've owned, the second in black. I believe they're the best combination of all three, and my own personal opinion is that this"},{"domain":"apparel","label":"positive","text":"These are comfortable slippers that -- with composite soles -- can take you out on the deck, to the front steps or even your driveway to pick up the morning newspaper. Your feet will stay warm but not uncomfortably so. They're even nice to wear when temps are a little higher because the clog design fits loosely at the heal so you can let your feet \"breath\" a little fresh air. Nice value for the price"},{"domain":"apparel","label":"positive","text":"These are comfortable slippers that -- with composite soles -- can take you out on the deck, to the front steps or even your driveway to pick up the morning newspaper. Your feet will stay warm but not uncomfortably so. They're even nice to wear when temps are a little higher because the clog design fits loosely at the heal so you're insulated from the cold. You'll"},{"domain":"apparel","label":"positive","text":"Love them. They feel as comfortable as tennis shoes, and give the right support when doing a lot of walking, but at the same time they look more hip and dressier then tennis shoes"},{"domain":"apparel","label":"positive","text":"Love them. They feel as comfortable as tennis shoes, and give the right support when doing a lot of walking, but at the same time they don't want to be seen as anything in the running game. When you"},{"domain":"apparel","label":"positive","text":"Having sampled 100% cotton pinpoint shirts both on-line and from the stores themselves, my husband keeps returning to his favorite, the Land's End pinpoint. Without a doubt, the quality is unsurpassed and its longevity is legendary! Now, when its time for new shirts, we don't think twice and go directly to Land's End and order. They also have the widest color selection and each color is true to its picture and flattering to all"},{"domain":"apparel","label":"positive","text":"Having sampled 100% cotton pinpoint shirts both on-line and from the stores themselves, my husband keeps returning to his favorite, the Land's End pinpoint. Without a doubt, the quality is unsurpassed and its longevity is legendary! Now, when its time for new shirts, we don't think twice and go directly to Land's End for a"},{"domain":"apparel","label":"positive","text":"All Aerosoles have that extra aaaahhh when you wear them, and these are no different. I've worn them with skirts, slacks and jeans, my daughter (teen) liked them so much that she bought herself a pair. I liked my black pair so much that I bought them in brown also"},{"domain":"apparel","label":"positive","text":"All Aerosoles have that extra aaaahhh when you wear them, and these are no different. I've worn them with skirts, slacks and jeans, my daughter (teen) liked them so much that she bought herself a pair"},{"domain":"apparel","label":"positive","text":"Purchased this for my son. He loves wearing it (he's a big fan of ny and the pd). Fits well, washes well"},{"domain":"apparel","label":"positive","text":"Purchased this for my son. He loves wearing it (he's a big fan of it). Highly recommend!!!\n\nRated 3 out of 5 by Anonymous from"},{"domain":"apparel","label":"positive","text":"excellent product for the price a lot cheaper than the bridal shop fast shipping thank"},{"domain":"apparel","label":"positive","text":"excellent product for the price a lot cheaper than the bridal shop,\" says Kojima.\n\n"},{"domain":"apparel","label":"positive","text":"I bought this tank in red & the color of the fabric is wonderfully vibrant. The quality of the fabric is so nice that I wore the top to dinner with a printed skirt & received several compliments on the outfit. Caution! This style runs about 1 size small. Athletica offers excellent, personalized customer service and every one of the 10 tank tops I ordered were of a quality for which some brands cost as much as $38."},{"domain":"apparel","label":"positive","text":"I bought this tank in red & the color of the fabric is wonderfully vibrant. The quality of the fabric is so nice that I wore the top to dinner with a printed skirt & received several compliments on the size & looks. Love my L-G"},{"domain":"apparel","label":"positive","text":"It's a little on the thin side for snowy or freezing weather, but great in keeping the chill off when you're out and about, or at the game. The blue is actually more of a royal blue than navy blue, but the lettering is well stitched and is the same quality used on MLB baseball caps (also has the MLB logo on back). It folds up easily and can be tucked into a jacket pocket with room to spare. The price is great and makes a great gift"},{"domain":"apparel","label":"positive","text":"It's a little on the thin side for snowy or freezing weather, but great in keeping the chill off when you're out and about, or at the game. The blue is actually more of a royal blue than navy blue, but the lettering is well stitched and is the same quality used on MLB baseball caps (also has the MLB logo on it).\n\nThe color is a really good"},{"domain":"apparel","label":"positive","text":"Stylish and comfy... What more could you ask for? My husband was very pleased"},{"domain":"apparel","label":"positive","text":"Stylish and comfy... What more could you ask for?\n\nI guess I always wanted to be cool and make dresses"},{"domain":"apparel","label":"positive","text":"My DH has worn Clark oxfords for some time and says they are the best fitting and most comfortable shoes he has ever owned. This new pair of Clarks, the Citadel Oxford, is his new favorite because it is light weight, casual, and so comfortable."},{"domain":"apparel","label":"positive","text":"My DH has worn Clark oxfords for some time and says they are the best fitting and most comfortable shoes he has ever owned. This new pair of Clarks, the Citadel Oxford, is his very first Clarks as he has worn both the classic"},{"domain":"apparel","label":"positive","text":"WOW.. what can't I say about these shoes... I've bought two pair in different colors & absolutely LOVE them for their comfort and snazzy, fun appearance. They're great at work and at play, and even during outings that require alot of walking. Highly recommend!!"},{"domain":"apparel","label":"positive","text":"WOW.. what can't I say about these shoes... I've bought two pair in different colors & absolutely LOVE them for their comfort and snazzy, fun appearance. They're great at work and at play, and great"},{"domain":"apparel","label":"positive","text":"GREAT price. I have another pair of these shoes I bought elsewhere at twice this price. Very comfortable. True to size."},{"domain":"apparel","label":"positive","text":"GREAT price. I have another pair of these shoes I bought a few weeks ago to replace the toe that has been missing for"},{"domain":"apparel","label":"positive","text":"Reef makes the best sandals, the price is pretty much set, no real savings here, but the selection is great. They may look like other sandals, but don't be fooled... They're TOP NOTCH"},{"domain":"apparel","label":"positive","text":"Reef makes the best sandals, the price is pretty much set, no real savings here, but the selection is great. They may look like other sandals, but don't be fooled...the"},{"domain":"apparel","label":"positive","text":"Raglan and cap sleeve makes it more edgy than wearing a plain old t-shirt. Good quality for the price. I usually wear a medium but ordered the XL and it's a good fit (fitted but not too tight)"},{"domain":"apparel","label":"positive","text":"Raglan and cap sleeve makes it more edgy than wearing a plain old t-shirt. Good quality for the price. I usually wear a medium but ordered the T.J. and I"},{"domain":"apparel","label":"positive","text":"Size was true. I just did not like the"},{"domain":"apparel","label":"positive","text":"Size was true. I just did not like getting rid of its color. I have tried many other colors for various things. The"}]